[
  {
    "slug": "2fauth",
    "logo": "logo.png",
    "name": "2FAuth",
    "description": "2FAuth is a web based self-hosted alternative to One Time Passcode (OTP) generators like Google Authenticator, designed for both mobile and desktop.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "ackee",
    "logo": "logo.png",
    "name": "Ackee",
    "description": "Ackee is a self-hosted, Node.js based analytics tool designed for those who value privacy. It operates on your own server, analyzing the traffic of your websites and providing valuable statistics through a minimalistic interface. Ackee offers an overview of all your websites, allowing you to analyze their collective performance. It provides insights into views, referrers, durations, and more. You can easily add, edit, and delete your domains, with a new tracking code just a few clicks away. Ackee's minimal UI allows you to analyze your data without losing focus, and its multi-step anonymization process ensures your users' privacy. The app allows you to analyze as many domains and apps as you want, and its interface is designed to be fast and easy to navigate. Ackee also offers a centralized GraphQL API, perfect for collecting data from a variety of sources. It uses a multi-step process to keep tracked data anonymized while still providing helpful analytics.",
    "tags": [
      "Analytics",
      "Privacy"
    ]
  },
  {
    "slug": "activepieces",
    "logo": "logo.svg",
    "name": "Activepieces",
    "description": "Activepieces is a powerful open-source business automation tool designed to streamline your work without the need for coding. It serves as an excellent alternative to Zapier, allowing you to automate your daily tasks or even your entire business with just a few clicks on the user interface. With Activepieces, you can enjoy the flexibility of using our 3rd party no-code apps to quickly read and write to your favorite apps. Currently, we support 74 apps and counting. The tool is self-hosted, ensuring your data remains on your machine, providing an added layer of security. Activepieces also offers infinite flexibility and powerful logging, making it a robust solution for business automation without limits.",
    "tags": [
      "No-Code",
      "Business Apps",
      "Automation"
    ]
  },
  {
    "slug": "actualbudget",
    "logo": "logo.png",
    "name": "Actual Budget",
    "description": "Actual is a personal finance tool designed to help you manage your finances with ease and convenience. This local-first application is 100% free and open-source, providing you with a reliable platform to keep track of your financial transactions. It's written in NodeJS and features a synchronization element that allows your changes to seamlessly move between devices. This means you can access and manage your financial data from any device without any hassle. The app is not just about tracking your expenses, it also includes features for budgeting, account management, and generating reports and filters. With Actual, managing your personal finances becomes a breeze.",
    "tags": [
      "Finance"
    ]
  },
  {
    "slug": "adguardhome",
    "logo": "logo.svg",
    "name": "AdGuard Home",
    "description": "AdGuard Ad Blocker is a comprehensive solution designed to enhance your online browsing experience by eliminating all kinds of ads, from annoying banners and pop-ups to intrusive video ads. It not only removes these distractions but also maintains the functionality and appearance of the websites you visit. The app also offers privacy protection, shielding your data from web analytics and online trackers. In addition, AdGuard ensures browsing security by protecting against phishing and malicious sites. It also includes a parental control feature, providing a safe online environment for children by blocking inappropriate and adult content. The app is designed to work across all browsers and apps, offering a seamless ad-free experience. Moreover, it saves traffic and speeds up page loading by filtering ads before they reach your device. AdGuard is more than just an ad blocker; it's a tool that enhances your online safety and browsing speed.",
    "tags": [
      "Privacy",
      "Security"
    ]
  },
  {
    "slug": "adminer",
    "logo": "logo.svg",
    "name": "Adminer",
    "description": "Adminer is a comprehensive database management tool, designed to simplify and streamline your database operations. Written in PHP, it is a lightweight yet powerful tool that supports a wide range of databases including MySQL, MariaDB, PostgreSQL, SQLite, MS SQL, Oracle, Elasticsearch, MongoDB and others. With Adminer, you can easily connect to a database server using a username and password, select an existing database or create a new one, and manage all aspects of your database including tables, columns, indexes, foreign keys, triggers, views, stored procedures, and functions. It also allows you to execute any SQL command from a text field or a file, and export your database structure, data, views, routines, and databases to SQL or CSV. Adminer prioritizes security, user experience, performance, feature set, and size, making it a reliable and efficient tool for all your database management needs.",
    "tags": [
      "Databases",
      "Developer Tools"
    ]
  },
  {
    "slug": "alltube",
    "logo": "logo.png",
    "name": "AllTube",
    "description": "AllTube Download is an application designed to facilitate the downloading of videos from YouTube. It provides an HTML GUI for youtube-dl, a command-line program to download videos from YouTube and other video sites. The app allows users to download videos directly to their server, making it easy to access and manage their favorite content. AllTube supports various configurations and can be customized according to user preferences. It also offers a JSON API, which returns a JSON object generated by youtube-dl, providing detailed information about the video. The app is lightweight and efficient, making it a great choice for those who frequently download videos from YouTube.",
    "tags": [
      "Media",
      "Video",
      "Downloader"
    ]
  },
  {
    "slug": "ampache",
    "logo": "logo.png",
    "name": "Ampache",
    "description": "Ampache is a web-based audio/video streaming application and file manager that allows you to access your music and videos from anywhere, anytime. With this app, you can browse and manage your music collection through a simple web interface, and even synchronize local and remote catalogs to create a unique, consistent collection. Ampache also offers music streaming capabilities, allowing you to stream your music to your preferred player, control it with Localplay, or directly listen on the web page with the HTML5 player. The app is completely free and open source, and it's designed to work on almost any internet-enabled device, including your phone, tablet, or television. Ampache is not a media organizer, but a tool that presents an already organized collection in a useful way.",
    "tags": [
      "Media",
      "File Management"
    ]
  },
  {
    "slug": "anonupload",
    "logo": "logo.png",
    "name": "AnonUpload",
    "description": "AnonUpload is a secure, anonymous file sharing application that does not require a database. It is built with privacy as a priority, ensuring that the direct filename used is not displayed. This PHP file uploader is designed to work anywhere, be it Nginx, Apache, Lightspeed, or any other platform. AnonUpload supports a wide range of file types including jpeg, jpg, gif, png, zip, xls, doc, mp3, mp4, mpeg, wav, avi, rar, 7z, txt and more. It also provides size verification for uploaded files, allowing for a maximum upload size of 10GB and no minimum size. The application also includes a download time feature, which sets a waiting time before a file can be downloaded.",
    "tags": [
      "File Management",
      "Privacy"
    ]
  },
  {
    "slug": "answer",
    "logo": "logo.png",
    "name": "Answer",
    "description": "Answer is an open-source knowledge-based software designed to facilitate a Q&A environment for your products, customers, teams, and more. It allows users to ask questions and get answers, fostering a dynamic exchange of information. The app features a modern and responsive UI, and it's extensible with plugins. It also offers content organization capabilities, allowing you to categorize and tag your content for easy navigation. Additionally, Answer integrates with your existing tools and services to streamline your workflow. The app also incorporates gamification elements, rewarding users for their contributions, making the process of knowledge sharing more engaging. It's a powerful tool for product technical support, customer support, and user communication.",
    "tags": [
      "Community",
      "Q&A",
      "Knowledge Base",
      "Support"
    ]
  },
  {
    "slug": "appsmith",
    "logo": "logo.png",
    "name": "Appsmith",
    "description": "Appsmith is a powerful tool designed to help engineers build custom software on top of their data. It simplifies internal tool development for businesses, streamlining operations, automating processes, and integrating multiple apps and data sources. Appsmith allows you to quickly build, deploy, and share applications that run critical business operations. It features intent-based auto-layouts for building responsive apps faster and offers a drag-and-drop interface for creating beautiful UIs without writing a single line of HTML/CSS. You can connect to any database, SaaS tool, or GraphQL/REST API, and query your data directly using SQL or the built-in query builder. Appsmith also provides the ability to write in-line JavaScript or reusable code blocks to extend your app's functionality, customize your UI, or write conditional logic. It's a secure, open-source platform that can be self-hosted for total control, privacy, and security.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "appwrite",
    "logo": "logo.svg",
    "name": "Appwrite",
    "description": "Appwrite is an open-source backend as a service server that abstracts and simplifies complex and repetitive development tasks behind a very simple to use REST API.",
    "tags": []
  },
  {
    "slug": "audiobookshelf",
    "logo": "logo.png",
    "name": "Audiobookshelf",
    "description": "Audiobookshelf is a self-hosted server designed to manage and play your audiobooks and podcasts. It works best when you have an organized directory structure, as it takes information from your folder names, including the author name, series name, book title, publish year, series sequence, and subtitle. The app uses the ID3 metadata tags in audio files to populate data, and it supports the same configuration options you would pass to a Docker container. Audiobookshelf is designed to be deployed on your own server using Easypanel, a modern server control panel. With Audiobookshelf, you can enjoy your favorite audiobooks and podcasts in a well-organized and easily accessible manner.",
    "tags": [
      "Media",
      "Educational",
      "Productivity"
    ]
  },
  {
    "slug": "authorizer",
    "logo": "logo.png",
    "name": "Authorizer",
    "description": "Authorizer is a powerful tool designed to simplify the process of user authentication and authorization in your applications. It allows you to build secure apps 10x faster with its low code tool and low-cost deployment. With Authorizer, you have full control over your user data, which can be stored in your preferred database. The app supports multiple authentication recipes and allows you to authorize users based on your business roles. It is compatible with OAuth2 and OpenID APIs. Authorizer also offers secure session management with the best services baked in, including HTTP only cookies and Authorization Code flow for mobile-based authentication. It supports a wide range of databases, including major SQL, NoSQL, and GraphDBs. You can customize emails, configure webhooks for various events, and add an extra layer of security with email-based OTP for basic authentication. With Authorizer, you can deploy your authentication and authorization service anywhere with multiple deployment options. It is a comprehensive solution for all your authentication and authorization needs.",
    "tags": [
      "Authentication",
      "Authorization",
      "Security",
      "Developer Tools"
    ]
  },
  {
    "slug": "automatisch",
    "logo": "logo.png",
    "name": "Automatisch",
    "description": "Automatisch is a powerful, self-hosted workflow automation tool designed for connecting your apps and automating repetitive tasks. With Automatisch, you can create workflows to sync data, send notifications, and perform various actions seamlessly across different services. This container is based on Docker Baseimage KasmVNC, providing additional environment variables and configurations for enhanced flexibility. It also supports the docker manifest for multi-platform awareness, ensuring the correct image for your architecture.",
    "tags": [
      "Workflow Automation",
      "Self-Hosted",
      "Task Management",
      "API Integrations"
    ]
  },
  {
    "slug": "babybuddy",
    "logo": "logo.png",
    "name": "BabyBuddy",
    "description": "BabyBuddy is a comprehensive, user-friendly platform designed to help parents and caregivers manage essential details about their child’s growth and development. It provides tools for tracking feedings, sleep schedules, diaper changes, and milestones, making parenting a more organized and informed journey. With BabyBuddy, you can access detailed insights into your child's habits, progress, and overall well-being. The app offers customization options to fit individual family needs and supports data export for secure backup or sharing with healthcare professionals. BabyBuddy is lightweight, easy to deploy, and designed with a focus on privacy, ensuring your family’s data is safe and accessible only to you.",
    "tags": [
      "Parenting",
      "Tracking",
      "Child Development",
      "Family Management"
    ]
  },
  {
    "slug": "barrage",
    "logo": "logo.png",
    "name": "Barrage",
    "description": "Barrage is a minimalistic Deluge WebUI app with full mobile support. It features a responsive mobile-first design, allowing you to manage your torrents with ease from any device. With Barrage, you can add torrents by URL or magnet, sort and filter your torrents, and set global upload and download speed limits. It also allows you to change file priorities and modify torrent options. The app is designed to be deployed with Docker, making it a convenient and efficient tool for managing your torrents.",
    "tags": [
      "File Management",
      "Developer Tools"
    ]
  },
  {
    "slug": "baserow",
    "logo": "logo.svg",
    "name": "Baserow",
    "description": "Baserow is an open-source, no-code database tool that allows you to create your own online database without any technical experience. It is a user-friendly alternative to Airtable, offering the power of a developer right from your browser. Baserow is perfect for organizing your projects, ideas, or business processes, allowing you to structure everything according to your needs. It is a flexible software that can be tailored to your needs, ensuring clear and accessible data for all your team members. With Baserow, you can easily integrate with other software, collaborate in real-time, and enjoy unlimited rows for your data. It is also developer-friendly, allowing for the creation of custom plugins. Baserow offers a free plan for those who want to try it out, as well as premium and advanced plans for users with more advanced needs.",
    "tags": [
      "No-Code",
      "Databases"
    ]
  },
  {
    "slug": "bazarr",
    "logo": "logo.png",
    "name": "Bazarr",
    "description": "Bazarr is a companion application to Sonarr and Radarr, designed to manage and download subtitles based on your specific needs. It allows you to define your preferences by TV show or movie, and Bazarr handles the rest. The app automatically searches for missing subtitles and downloads them as soon as they become available in your desired language. It also offers a manual search feature to find all matching subtitles, allowing you to choose the one you want and download it to your media directory. Bazarr also regularly searches for matching subtitles and upgrades the ones you previously downloaded if a better one is found. Please note that Bazarr does not scan the disk to detect series and movies, it only manages the series and movies that are indexed in Sonarr and Radarr.",
    "tags": [
      "Media",
      "Subtitles",
      "Download"
    ]
  },
  {
    "slug": "blender",
    "logo": "logo.png",
    "name": "Blender",
    "description": "Blender is a comprehensive, free and open-source 3D computer graphics software toolset. It is used for creating animated films, visual effects, art, 3D printed models, motion graphics, interactive 3D applications, virtual reality, and computer games. The app is designed to be accessed at your host, providing a desktop GUI for easy interaction. It supports hardware acceleration for an enhanced desktop experience, although GPU rendering is not supported out of the box. The app is compatible with multiple architectures, ensuring it can be used on a variety of systems. Please note that while this app can run on Arm devices, it is recommended not to mount in /dev/dri due to the OpenGL ES version not being high enough to run Blender.",
    "tags": [
      "3D Graphics",
      "Animation",
      "Visual Effects",
      "Art",
      "Motion Graphics",
      "Virtual Reality",
      "Computer Games"
    ]
  },
  {
    "slug": "bookstack",
    "logo": "logo.svg",
    "name": "Bookstack",
    "description": "BookStack is a free and open-source platform designed to help you organize and store information in a simple and efficient way. It is a self-hosted solution that allows you to create, edit, and manage content through an easy-to-use interface. The content is divided into three real-world groups: Books, Chapters, and Pages, making it easy to navigate and find the information you need. The platform also includes a powerful search feature that allows you to search at the book level or across all books, chapters, and pages. You can also link directly to any paragraph, keeping your documentation interconnected. BookStack offers configuration options that let you customize the system to suit your needs, including changing the name, logo, and registration options. It also includes built-in diagrams.net drawing capability for creating diagrams within your documentation, a markdown editor for those who prefer to write in markdown, and integrated authentication options. The platform supports multiple languages and offers both dark and light modes for a comfortable user experience. It also includes a full role and permission system, multi-factor authentication, and features like cross-book sorting, page revisions, and image management.",
    "tags": [
      "Wiki",
      "Documentation",
      "Open Source"
    ]
  },
  {
    "slug": "botpress",
    "logo": "logo.png",
    "name": "Botpress",
    "description": "Botpress is a revolutionary platform that allows you to build next-generation chatbots powered by OpenAI. It offers an intuitive visual flow editor to bring your users’ conversations to life. With Botpress, you can create chatbots that are always on brand, thanks to ChatGPT’s copywriting abilities. The platform also provides a range of GPT-first tools and features such as dynamic knowledge ingestion, sentiment analysis, automatic self-improvement, data enhancements, and AI recommendations. Botpress supports 100+ languages, enabling you to launch your chatbot globally. It also offers one-click deployment across various channels. With Botpress, building human-like chatbots has never been this easy.",
    "tags": [
      "Chat",
      "AI",
      "Automation"
    ]
  },
  {
    "slug": "budibase",
    "logo": "logo.svg",
    "name": "Budibase",
    "description": "Budibase is an open-source platform designed to simplify the creation of internal tools, saving teams hundreds of hours in the process. With Budibase, you can generate powerful internal tools and forms in just a few seconds, without any coding experience required. The platform allows you to connect to an external database, pull data from a Rest API, import a CSV, or start from scratch with Budibase's built-in database. You can design your tools using drag-and-drop components and automate workflows with just a few clicks. Budibase is trusted by over 75,000 teams and is designed to speed up your business operations. Whether you need to collect data securely, automate tasks, or streamline operations, Budibase has you covered.",
    "tags": [
      "No-Code",
      "Internal tools",
      "Forms",
      "Workflows"
    ]
  },
  {
    "slug": "bytebase",
    "logo": "logo.png",
    "name": "Bytebase",
    "description": "Bytebase is a versatile application designed to streamline database management tasks. It supports a wide range of databases including MySQL, PostgreSQL, Snowflake, Oracle, SQL Server, MongoDB, Redis, Redshift, ClickHouse, TiDB, OceanBase, Google Spanner, and MariaDB. With Bytebase, you can easily configure and manage your database instances, perform SQL reviews, manage data models, roles, and permissions, and handle change workflows in batch mode. The app also offers features for secure data handling, VCS integration, slow query management, and disaster recovery. It comes with an embedded PostgreSQL instance for storing its metadata, but for production setup, it is recommended to store the metadata in an external PostgreSQL database. Bytebase is designed to be deployed easily and quickly, offering a step-by-step quick start guide for users.",
    "tags": [
      "Databases"
    ]
  },
  {
    "slug": "cachet",
    "logo": "logo.png",
    "name": "Cachet",
    "description": "Meet Cachet, the open-source status page system designed to improve downtime communication. Used by great companies worldwide, Cachet allows you to effectively communicate downtime and system outages to your customers, teams, and shareholders. It comes with a beautifully crafted design that is responsive and works seamlessly on your desktop, tablet, and phone. Cachet supports multiple languages and comes with a powerful JSON API for updating your status page with incidents and component status changes. It also allows you to schedule maintenance events ahead of time and provides a dashboard for setting up metrics to measure various aspects such as uptime, error rates, etc. For added security, Cachet supports two-factor authentication. It's a beautifully simple service for managing your service statuses.",
    "tags": [
      "Monitoring",
      "Communication"
    ]
  },
  {
    "slug": "calcom",
    "logo": "logo.png",
    "name": "Calcom",
    "description": "Cal.com is a versatile scheduling app designed to streamline the process of setting up meetings, appointments, and events. It allows users to set their availability, connect their existing calendars, and share a personal link for others to book a meeting at a time that works for both parties. The app ensures you never get double booked by checking for conflicts across all your calendars. It also offers workflow automation, enabling you to build processes around your events with automatic notifications, reminders, and follow-ups. With features like round-robin scheduling, routing forms, and meeting overload prevention, Cal.com adapts to any business, making it an ideal solution for doctors, companies, teachers, and experts. The app is available in over 26 languages and can be embedded anywhere for easy access. It also offers simple rescheduling and requires confirmation to ensure smooth scheduling.",
    "tags": [
      "Calendars",
      "Scheduling",
      "Productivity"
    ]
  },
  {
    "slug": "calibre",
    "logo": "logo.png",
    "name": "Calibre",
    "description": "Calibre is a comprehensive e-book management tool designed to organize, convert, and read your e-book collection. It supports most of the major e-book formats and is compatible with various e-book reader devices. Calibre can fetch metadata for your books from the internet, enhancing your library with relevant information. It also allows you to download newspapers and convert them into e-books for a more convenient reading experience. The app is cross-platform, running on Linux, Windows, and macOS. With Calibre, you can easily add books to your library, convert them to a format your reader understands, and send them to your device. It also offers advanced features like e-book editing, metadata editing, and e-book comparison. The app is user-friendly, but also offers a Command Line Interface for more power and versatility.",
    "tags": [
      "Documents",
      "E-Commerce"
    ]
  },
  {
    "slug": "changedetection",
    "logo": "logo.png",
    "name": "Change Detection",
    "description": "Changedetection.io is an intelligent tool designed to monitor changes on websites. It is perfect for smart shoppers, data journalists, research engineers, data scientists, security researchers, and more. The app allows you to watch up to 5,000 URLs and supports over 85 notification formats. It is capable of monitoring simple changes on a website, like price alterations or restock notifications, to deep inspections such as PDF text changes, JSON and XML monitoring, and extensive text triggers. The app also features intelligent product restock detection, making it easier for you to keep track of product availability. Additionally, it can perform interactive browser steps such as filling in text boxes, clicking buttons, and setting up your change detection scenario. With Changedetection.io, you can live your data life proactively, receiving notifications straight away when changes occur on your watched websites.",
    "tags": [
      "Monitoring",
      "Data",
      "Notifications"
    ]
  },
  {
    "slug": "chatpad",
    "logo": "logo.png",
    "name": "Chatpad",
    "description": "Chatpad AI is a premium quality user interface for ChatGPT, designed to provide the ultimate chatting experience. It's not just another ChatGPT interface, but a broader vision to revolutionize the way users interact with ChatGPT. The app is free and open-source, with its source code readily available on GitHub for anyone interested. Privacy is a top priority in Chatpad AI, with no tracking, no cookies, and all data being stored locally. The app is crafted with love and care, ensuring the best possible experience for its users. It's available as a web app and a desktop app, providing flexibility and convenience. Chatpad AI is also self-hostable using Docker, giving users full control over their data and usage.",
    "tags": [
      "Chat",
      "Privacy",
      "Productivity"
    ]
  },
  {
    "slug": "chatwoot",
    "logo": "logo.svg",
    "name": "Chatwoot",
    "description": "Chatwoot is a new age multi-channel customer experience platform designed for businesses of all sizes. It serves as an open-source customer engagement suite, providing an alternative to platforms like Intercom, Zendesk, and Salesforce Service Cloud. With Chatwoot, you can manage your agents' workload, track their performance through auto-updating reports, and work smarter with automations. The app allows you to perform key actions on multiple conversations at once and provides super quick responses to customer conversations, making your agents super productive. It also offers features to manage your email, Facebook, Instagram, Line, SMS, Telegram, and Twitter customer interactions directly from the platform. Additionally, Chatwoot provides detailed insights into your conversations and allows you to measure and track your CSAT score on autopilot.",
    "tags": [
      "Chat",
      "Customer Support"
    ]
  },
  {
    "slug": "chevereto",
    "logo": "logo.png",
    "name": "Chevereto",
    "description": "Chevereto is a powerful, self-hosted image hosting platform designed for individuals, communities, and businesses. It allows users to upload, organize, and share images effortlessly. With a clean interface and a wide range of customization options, Chevereto supports private albums, multi-language capabilities, and robust file management, making it the ultimate solution for image hosting.",
    "tags": [
      "Image Hosting",
      "File Management",
      "Open Source",
      "Multi-User",
      "Private Albums"
    ]
  },
  {
    "slug": "chromium",
    "logo": "logo.png",
    "name": "Chromium",
    "description": "Chromium is an open-source browser project that is designed to provide a safer, faster, and more stable way for all users to experience the web. This app is a Docker containerized version of Chromium, allowing you to deploy and run the Chromium browser in a Docker environment. The app supports multiple architectures, including x86-64 and arm64, and can be accessed via HTTP or HTTPS. It offers additional environment variables and run configurations to enable or disable specific functionality. The app also allows you to specify one or multiple Chromium CLI flags, which will be passed to the application in full. This containerized version of Chromium is designed to function efficiently with modern websites, and includes options for GPU acceleration and Docker in Docker (DinD) setup.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "clickhouse",
    "logo": "logo.png",
    "name": "Clickhouse",
    "description": "ClickHouse is an open-source database designed for real-time apps and analytics. It is renowned for its speed and resource efficiency, capable of querying billions of rows in mere milliseconds. ClickHouse supports a wide range of data sources, including databases, data warehouses, streams, logs, analytics, data lake formats, and local files. It is built on a column-oriented database structure, which is ideally suited to Online Analytical Processing (OLAP) scenarios, making it significantly faster in processing most queries. ClickHouse utilizes all available system resources to their full potential to process each analytical query as swiftly as possible. It can be deployed in any environment, whether on your machine or in the cloud, and offers the ability to run fast queries on local files without a server. ClickHouse is trusted by developers working with data at scale, including major companies like Disney+ and Uber.",
    "tags": [
      "Databases",
      "Analytics"
    ]
  },
  {
    "slug": "cloudcommander",
    "logo": "logo.png",
    "name": "Cloud Commander",
    "description": "Cloud Commander is a file manager for the web. It includes a command-line console and a text editor. Cloud Commander helps you manage your server and work with files, directories and programs in a web browser from any computer, mobile or tablet.",
    "tags": []
  },
  {
    "slug": "cockpit",
    "logo": "logo.png",
    "name": "Cockpit",
    "description": "Cockpit is a headless content platform designed to streamline the creation, connection, and delivery of content for creators, marketers, and developers. It is built with an API-first approach, enabling limitless digital solutions. Cockpit offers a range of features including a content hub, multichannel localization, roles & permissions, and revisions. It also comes with a set of ready-to-use addons to support your projects. These include flexible structured content models, an assets manager, SEO and menu routes, content migration, custom action triggers, component-based layouts, full-text search for your content, form submissions collection, and localization. Cockpit is designed to fit your favorite tech stack, making it a versatile tool for all your content needs.",
    "tags": [
      "CMS"
    ]
  },
  {
    "slug": "coder",
    "logo": "logo.png",
    "name": "Coder",
    "description": "Coder is an open source cloud development environment (CDE) that you download and host in your cloud. Deploy a single solution in seconds that provisions the infrastructure, IDE, language, and tools your developers desire. Upgrade to the Enterprise version and add security, governance, and observability capabilities for Platform teams.",
    "tags": []
  },
  {
    "slug": "codex-docs",
    "logo": "logo.svg",
    "name": "CodeX Docs",
    "description": "CodeX is a comprehensive platform that brings together passionate engineers, designers, students, graduates, and young specialists from around the globe. The app is dedicated to creating high-quality open-source projects and providing a valuable experience of developing full-fledged products for the global market. CodeX offers a range of products including Editor.js, a block-styled, API-oriented editor for media that generates useful JSON-output with clear data, Hawk.so, a fast and lightweight error tracking service, and CodeX Notes, a simple and fast cross-platform notes application based on Editor.js and Electron. The platform also offers Capella, a cloud service for image storage and delivery, and a platform for integration of services into messengers. With a focus on media, social networks, education, augmented reality, and medicine, CodeX is a one-stop solution for tech enthusiasts looking to make a mark in the global market.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "collabora-office",
    "logo": "logo.svg",
    "name": "Collabora Office",
    "description": "Collabora Online is a powerful, flexible, and secure online office suite designed to break free from vendor lock-in and put you in full control of your documents. It offers a private office suite in the cloud, compatible with trillions of existing documents, and can be integrated into your own infrastructure or accessed via one of our trusted hosting partners. It is excellent for enterprises that need a powerful office suite in the cloud, or on-premise, that protects their privacy and allows them to keep full control of their sensitive corporate data. Collabora Online offers a range of business benefits that support collaboration and productivity whilst maintaining your digital sovereignty and keeping your corporate documents secure. It includes a text document editor, a spreadsheet tool, a presentation creator, and a drawing tool, all designed to provide a true WYSIWYG editing experience and make visualising your document layout incredibly easy. You can open any document, add comments, track changes, format and style your pages, create spreadsheets with advanced formulas, design attractive presentations, and draw shapes and diagrams with ease. Collabora Online is fully open source, offering native integration in Android and iOS, and prioritizing privacy by default.",
    "tags": [
      "Documents",
      "Productivity",
      "Privacy"
    ]
  },
  {
    "slug": "commento",
    "logo": "logo.png",
    "name": "Commento",
    "description": "Commento is a comments widget designed to enhance the interaction on your website. It allows your readers to contribute to the discussion by upvoting comments that add value and downvoting those that don't. The widget supports markdown formatting, enabling bold, italics, external links, quotes, bullet points, code, and more. Commento also provides moderation tools to manage the conversation, allowing you to lock heated threads, remove off-topic comments, and enforce timeouts. It features a spam detection system, saving you the hassle of dealing with spammers. The widget supports nested replies, making discussions easier to follow. Importantly, Commento does not require your readers to sign up, reducing friction and encouraging more interaction. You can easily customize the look of the widget to match your website's aesthetics.",
    "tags": [
      "Comments",
      "Discussion",
      "Website"
    ]
  },
  {
    "slug": "commentoplusplus",
    "logo": "logo.png",
    "name": "Commento++",
    "description": "Commento++ is a free, open-source application designed to provide a fast, lightweight comments box that you can embed in your static website. It offers a range of features including Markdown support, Disqus import, voting, automated spam detection, moderation tools, sticky comments, thread locking, and OAuth login. It also supports hot-reloading of comments and email notifications. Commento++ is designed to respect your privacy, with no adverts, and offers a more attractive comments box compared to other free and open-source alternatives. It is significantly lighter and faster than alternatives and can be deployed with a single click to a free Heroku account. For maximum control, you can also choose to self-host the application.",
    "tags": [
      "Comments",
      "Website",
      "Open Source"
    ]
  },
  {
    "slug": "coralproject",
    "logo": "logo.png",
    "name": "Coral",
    "description": "Coral is a revolutionary app designed to enhance the commenting experience on your website. It employs smart technology and effective design to improve interactions, making it easier for commenters to engage in meaningful discussions. With Coral, commenters can easily identify journalists in the conversation, mute disruptive voices, share discussions, receive notifications, and see new comment alerts instantly. The app also provides a full suite of tools for moderators to easily identify disruptive comments and highlight the best submissions, all backed by smart AI technology. Coral is built for publishing, increasing loyalty and engagement on your website, giving you complete control of the interactions and data, without inserting any ads or trackers on your page. It's lightweight, secure, flexible, responsive, and fully customizable, allowing you to connect it to your existing registration system and customize the look and feel to match your brand. Coral is used across the globe in nearly 20 countries and 14 languages, in newsrooms large and small, trusted by more than 500 news sites in 28 countries, including The Washington Post, The Financial Times, Wired, USA Today, and Foreign Policy.",
    "tags": [
      "Communication",
      "Community",
      "Privacy"
    ]
  },
  {
    "slug": "corteza",
    "logo": "logo.png",
    "name": "Corteza",
    "description": "Corteza is a powerful, open-source low-code platform designed to streamline the process of app development, business process integration, and data harmonization. Built with a backend in Golang and a front end in Vue.js, Corteza allows you to easily build native web apps and expand your software ecosystem with complete control and flexibility. You can connect with any record data source, control everything you build, transform your data into a standardized JSON format, and build unlimited web applications and process workflows using block-based tools and Javascript automations. Corteza is cloud-native and deploys via Docker containers, providing a seamless and efficient app development experience. It is 100% free and open-source, ensuring that it will always be accessible to all.",
    "tags": [
      "Low-Code Platform",
      "App Development",
      "Business Process",
      "Integration",
      "Data Harmonization"
    ]
  },
  {
    "slug": "countly",
    "logo": "logo.png",
    "name": "Countly",
    "description": "Countly is an innovative, open-source analytics and engagement platform designed to help you understand and optimize customer journeys in web, mobile, and desktop applications. Built with a flexible architecture, Countly supports multiple integrations and can be deployed on-premises or in the cloud. This platform enables developers and product managers to gain real-time insights into user behavior, track important metrics, and enhance product experiences through push notifications, A/B testing, and other engagement features. Countly is cloud-native, deploys via Docker containers, and provides data control, security, and a streamlined experience for building and monitoring user engagement. Countly is 100% free and open-source, ensuring it is accessible to everyone.",
    "tags": [
      "Analytics",
      "User Engagement",
      "Real-Time Insights",
      "Open-Source",
      "A/B Testing"
    ]
  },
  {
    "slug": "cronicle",
    "logo": "logo.png",
    "name": "Cronicle",
    "description": "Cronicle is a powerful, multi-server task scheduler and runner, with an easy-to-use web-based interface. It allows you to schedule and run scripts, commands, or software programs on a recurring basis, similar to cron jobs but with the added capability of visual management and log tracking. Cronicle supports complex workflows including dependencies between tasks, and it can distribute tasks across multiple servers for load balancing. It's ideal for automating backups, updates, data processing tasks, and more in a distributed environment.",
    "tags": [
      "Automation",
      "Task Scheduler",
      "Distributed Computing"
    ]
  },
  {
    "slug": "cryptpad",
    "logo": "logo.svg",
    "name": "Cryptpad",
    "description": "CryptPad is an open-source collaborative office suite that offers end-to-end encryption, ensuring your data remains private and secure. It provides a full suite of applications, allowing you to work on various projects in real-time with your colleagues or friends. Whether you're planning a camping trip or setting up client briefs, CryptPad makes it easy to share files and collaborate without the need for account creation or app downloads. It's more than just a document editor; it's a secure platform for all your collaborative needs.",
    "tags": [
      "Collaboration",
      "Privacy",
      "Office Suite",
      "Encryption",
      "Open-source"
    ]
  },
  {
    "slug": "cubejs",
    "logo": "logo.png",
    "name": "CubeJS",
    "description": "Cube is a Semantic Layer for every data app that aims to connect data silos, drive consistent metrics, and power your AI and analytics with context. It allows you to define and manage metrics upstream to consolidate your workflow, centralize definitions, and create a single source of truth. The app also provides granular access controls to grant column- and role-based operational and viewing permissions upstream. Cube ensures your data is reliably performant with a powerful caching layer and advanced preaggregation capabilities. Furthermore, it allows you to connect your data to any front-end application to build beautiful custom visualizations with Cube’s GraphQL, REST, and SQL APIs. Cube is an API-first, four-part semantic layer that enables data engineers and developers to make their data consistent, secure, performant, and accessible across every application.",
    "tags": [
      "Analytics"
    ]
  },
  {
    "slug": "cusdis",
    "logo": "logo.png",
    "name": "Cusdis",
    "description": "Cusdis is a lightweight, open-source comment system designed with privacy as a priority. It serves as an alternative to Disqus, offering a simple and user-friendly way to integrate a comment system into your existing website. The app is incredibly lightweight, with the JS SDK embedded to your website being only around 5kb. It features built-in i18n and dark-mode for a seamless user experience. Cusdis ensures you stay updated with new comments through email notifications, and allows for quick approval of comments directly from the notification email or webhook. You can also set a webhook URL that triggers when your website receives a new comment, allowing you to integrate Cusdis with your favorite tools such as Telegram. The app offers flexibility with its pricing, providing a free self-hosting option, a free cloud option with limited features, and a Cloud Pro option for unlimited access.",
    "tags": [
      "Comments",
      "Privacy",
      "Open-source"
    ]
  },
  {
    "slug": "cyberchef",
    "logo": "logo.png",
    "name": "CyberChef",
    "description": "CyberChef, also known as the Cyber Swiss Army Knife, is a versatile web app designed to perform a wide array of 'cyber' operations within a web browser. It offers simple encoding methods like XOR and Base64, alongside more complex encryption techniques such as AES, DES, and Blowfish. CyberChef also provides tools for creating binary and hexdumps, compressing and decompressing data, calculating hashes and checksums, parsing IPv6 and X.509, changing character encodings, and much more. The app is designed to be user-friendly, enabling both technical and non-technical analysts to manipulate data in complex ways without the need for intricate tools or algorithms. CyberChef is still under active development, with ongoing testing, bug fixing, new feature additions, and documentation improvements.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "dashdot",
    "logo": "logo.png",
    "name": "Dashdot",
    "description": "Dash. (or dashdot) is a visually stunning, modern server dashboard designed with a glassmorphism aesthetic. It's built on the latest technology and is intended for use with smaller VPS and private servers. The dashboard is feature-rich, offering a dark/light mode, customizable widgets, beautiful animations and styles, and support for multiple architectures. It provides a high level of personalization options, allowing you to tailor the dashboard to your specific needs. Dash. is an open-source project, welcoming contributions from those interested in further developing the platform.",
    "tags": [
      "Dashboard"
    ]
  },
  {
    "slug": "dashy",
    "logo": "logo.png",
    "name": "Dashy",
    "description": "Dashy is the ultimate homepage for your homelab, designed to be your personal, privacy-respecting dashboard. It is highly customizable and easy to use, offering a unique user experience with its built-in themes and UI color palette editor. Dashy can auto-fetch icons from the favicon of each of your apps or services, and it provides an instant overview of the health of each of your apps with status indicators. It also features a simple authentication feature for protecting your dashboard, and supports multiple users with granular controls. Dashy comes with 50+ pre-built widgets for displaying dynamic content from any API-enabled service. It offers alternate views for a minimal view or a workspace view, and allows you to choose how to launch your apps. Dashy also includes a search and shortcuts feature for easy navigation, and an optional cloud backup and sync service for off-site config backup. The app supports multiple languages and is easily configurable through a simple YAML file or directly through the UI.",
    "tags": [
      "Dashboard"
    ]
  },
  {
    "slug": "deluge",
    "logo": "logo.png",
    "name": "Deluge",
    "description": "Deluge is a comprehensive BitTorrent client designed to cater to your torrenting needs. It operates on a daemon/client model and is equipped with various user interfaces, including GTK-UI, Web-UI, and Console-UI. At its core, Deluge uses libtorrent to efficiently manage the BitTorrent protocol. The app allows you to start various user-interfaces and the Deluge daemon with simple commands. It also provides a web UI that can be accessed at http://localhost:8112 with the default password 'deluge'. For advanced users, Deluge offers features like bandwidth tweaking, VPN, and reverse proxy.",
    "tags": [
      "File Management",
      "Networking Tools"
    ]
  },
  {
    "slug": "dify",
    "logo": null,
    "name": "Dify",
    "description": "Dify is an open-source platform designed to simplify the development and operation of AI applications using large language models (LLMs). It provides features like visual prompt orchestration, RAG pipeline, agent capabilities, model management, and LLMOps for efficient monitoring and analysis.",
    "tags": []
  },
  {
    "slug": "directus",
    "logo": "logo.png",
    "name": "Directus",
    "description": "Directus is a modern, open-source data platform that instantly transforms any SQL database into an API and a beautiful no-code app. It is designed to work with any SQL database, allowing you to maintain complete control over your new or existing database without the need for migration to a proprietary data model. The Directus API layers on top of your database, providing both REST and GraphQL APIs for your data. The Directus App enables your entire team to safely and intuitively browse, manage, and visualize data. It is a flexible platform that can be used as a Backend-as-a-Service, a Headless CMS, an Internal Tool Builder, and for Data Management & Analytics. With Directus, you can connect external digital experiences, design APIs, control data flows, build internal tools, and much more.",
    "tags": [
      "Developer Tools",
      "CMS",
      "Databases"
    ]
  },
  {
    "slug": "docker-registry",
    "logo": "logo.png",
    "name": "Docker Registry",
    "description": "Docker Registry 2.0 is a powerful application designed to store and distribute Docker images. This app is an implementation of the Docker Registry HTTP API V2, compatible with Docker 1.6 and later versions. It provides a secure and scalable base for building a large scale registry solution or running a simple private registry. Docker Registry 2.0 is a core library for many registry operators including Docker Hub, GitHub Container Registry, GitLab Container Registry, and DigitalOcean Container Registry. It is also used by the CNCF Harbor Project and VMware Harbor Registry. The app allows users to efficiently store, manage, package, and exchange content, providing a professional grade and extensible content distribution system.",
    "tags": [
      "Developer Tools",
      "Databases"
    ]
  },
  {
    "slug": "documize",
    "logo": "logo.png",
    "name": "Documize",
    "description": "Documize Zerabase is a powerful business tool designed to manage product delivery and insight discovery. It serves as a Product Engineering Hub, unifying product plans, assets, documents, app analytics, and customer conversations. This remarkable offline-first desktop software becomes your product headquarters, centralizing content and information for everyone to see and act upon, making it a game-changer for product teams. On the other hand, the Community feature of Documize offers a simple, delightful way to capture and share knowledge management. It covers processes, guidelines, manuals, and everything in-between, allowing you to document your business with ease. It's designed for both technical and non-technical users, organizing content through labels, spaces, and categories. The Community+ edition offers advanced capabilities such as content approval workflows, content organization, version management, lifecycle management, feedback capture, PDF export, analytics, reporting, and more.",
    "tags": [
      "Documentation"
    ]
  },
  {
    "slug": "docuseal",
    "logo": "logo.png",
    "name": "DocuSeal",
    "description": "DocuSeal is an open source platform that provides secure and efficient digital document signing and processing. Create PDF forms to have them filled and signed online on any device with an easy-to-use, mobile-optimized web tool.",
    "tags": [
      "PDF"
    ]
  },
  {
    "slug": "dokuwiki",
    "logo": "logo.png",
    "name": "Dokuwiki",
    "description": "DokuWiki is a highly versatile, open-source wiki software that is simple to use and doesn't require a database. It is known for its clean and readable syntax, making it a favorite among administrators due to its ease of maintenance, backup, and integration. DokuWiki is equipped with built-in access controls and authentication connectors, making it particularly useful in an enterprise context. It supports a wide range of use cases beyond a traditional wiki, thanks to the large number of plugins available. DokuWiki is designed for collaboration, allowing quick updates and easy addition of new pages while maintaining a history of every change. It can be used as a corporate knowledge base, private notebook, software manual, project workspace, CMS, intranet, and more. DokuWiki supports customization at all levels of expertise, from easy configuration via the admin interface to developing your own extensions.",
    "tags": [
      "Wiki"
    ]
  },
  {
    "slug": "domainmod",
    "logo": "logo.png",
    "name": "DomainMod",
    "description": "DomainMOD is a comprehensive open-source application designed to help you manage your domains and other internet assets in one central location. With DomainMOD, you can keep track of your domains, SSL certificates, registrar and SSL accounts, web hosting, DNS servers, IP addresses, and more. The application also offers a Bulk Domain Updater, allowing you to modify multiple domains at once, saving you time and effort. DomainMOD also includes a Data Warehouse feature, which lets you import data from your WHM web servers for analysis and reporting. The app is mobile-friendly, ensuring you can access your data anytime, anywhere. Furthermore, DomainMOD respects your privacy, ensuring only you have access to your data.",
    "tags": [
      "Domain Management",
      "Web Hosting",
      "Data Management"
    ]
  },
  {
    "slug": "dozzle",
    "logo": "logo.png",
    "name": "Dozzle",
    "description": "Dozzle is a lightweight, web-based Docker log viewer designed for real-time monitoring and easy troubleshooting. It allows you to view logs of other Docker containers in real-time, streaming new log entries to the web interface without the need for page refreshes. Despite its capabilities, Dozzle is a small application that consumes very little memory and CPU, ensuring it doesn't cause performance issues when run alongside other containers. It also supports connecting to multiple remote hosts, providing a simple drop-down menu to switch between different hosts. Dozzle doesn't store any log files and is solely for live monitoring of your container logs. It also features an intelligent fuzzy search for container names, regex log search, split screen for viewing multiple logs, and live stats with memory and CPU usage. It also provides authentication with a username and password for added security.",
    "tags": [
      "Monitoring",
      "Logging"
    ]
  },
  {
    "slug": "drone-runner",
    "logo": "logo.svg",
    "name": "Drone Runner",
    "description": "Drone.io is a self-service Continuous Integration platform designed for busy development teams. It automates software build and testing, making it easier for teams to manage their development process. The platform allows for configuration as a code, with pipelines configured through a simple, easy-to-read file committed to your git repository. Each pipeline step is executed inside an isolated Docker container that is automatically downloaded at runtime. Drone.io integrates seamlessly with multiple source code management systems, including GitHub, GitHubEnterprise, Bitbucket, and GitLab. It supports multiple operating systems and architectures, and works with any language, database, or service that runs inside a Docker container. The platform also allows for advanced customization, including custom access controls, approval workflows, secret management, and yaml syntax extensions. Drone.io ensures that every build runs in an isolated Docker container, providing full control and preventing conflicting builds on shared servers.",
    "tags": [
      "Developer Tools",
      "Continuous Integration",
      "Automation"
    ]
  },
  {
    "slug": "drone",
    "logo": "logo.svg",
    "name": "Drone",
    "description": "Drone.io is a self-service Continuous Integration platform designed for busy development teams. It automates software build and testing, making it an essential tool for efficient and effective software development. Drone.io is configured with a simple, easy-to-read file that you commit to your git repository, and each pipeline step is executed inside an isolated Docker container that is automatically downloaded at runtime. The platform integrates seamlessly with multiple source code management systems, including GitHub, GitHubEnterprise, Bitbucket, and GitLab, and supports multiple operating systems and architectures. Drone.io works with any language, database or service that runs inside a Docker container, and allows you to create and share plugins for pre-configured steps in your pipeline. Advanced customization is made easy with Drone.io, with features for implementing custom access controls, approval workflows, secret management, yaml syntax extensions and more. The platform also ensures isolated builds to avoid conflicts on shared servers, and offers effortless scaling.",
    "tags": [
      "Developer Tools",
      "Continuous Integration",
      "Automation"
    ]
  },
  {
    "slug": "duplicati",
    "logo": "logo.png",
    "name": "Duplicati",
    "description": "Duplicati is a free, open-source backup software designed to store encrypted backups online. It is compatible with Windows, macOS, and Linux. The software works with standard protocols like FTP, SSH, WebDAV, and popular services such as Backblaze B2, Tardigrade, Microsoft OneDrive, Amazon S3, Google Drive, box.com, Mega, hubiC, and many others. Duplicati allows you to backup files and folders with strong AES-256 encryption, saving space with incremental backups and data deduplication. It can run backups on any machine through a web-based interface or via command line interface. Duplicati has a built-in scheduler and auto-updater, ensuring your backups are always up-to-date. It is designed for online backups from scratch, handling network issues efficiently. For instance, interrupted backups can be resumed, and Duplicati regularly tests the content of backups, detecting broken backups on corrupt storage systems before it’s too late. The software is configured by a web interface that runs in any browser and can be accessed from anywhere.",
    "tags": [
      "Backup",
      "Data Security",
      "Cloud Storage"
    ]
  },
  {
    "slug": "easyshortener",
    "logo": "logo.png",
    "name": "Easyshortener",
    "description": "Easyshortener is a multi-user link shortening application designed for simplicity and security. It allows multiple users to manage their links from a built-in administration panel. The app is built with a focus on user experience, ensuring it is easy to use. It also features built-in two-factor authentication, providing an extra layer of security for your peace of mind. Easyshortener is built for Docker, making it easy to deploy with your favorite container engine. Additionally, the app allows for registration and redirect tracking for all links, and can be set to force HTTPS connection for enhanced security.",
    "tags": [
      "URL Shortener",
      "Link Management",
      "Security"
    ]
  },
  {
    "slug": "elasticsearch",
    "logo": "logo.svg",
    "name": "Elasticsearch",
    "description": "Elasticsearch is a dynamic search and analytics engine designed for seamless handling of extensive data across various formats. With a user-friendly interface and a robust query language, it enables effortless advanced searches and data analysis. Boasting high performance and scalability, Elasticsearch ensures rapid search responses and efficient data retrieval, making it suitable for diverse applications. The platform prioritizes security with features like role-based access control and encryption, while its real-time indexing and distributed architecture support resilience and reliability. Whether you're a developer or IT professional, Elasticsearch provides a centralized solution for managing and extracting valuable insights from your data, offering a powerful search and analytics experience.",
    "tags": [
      "Data Analytics",
      "Search Engine",
      "Security",
      "Scalability"
    ]
  },
  {
    "slug": "element",
    "logo": "logo.svg",
    "name": "Element",
    "description": "Element is a secure communications platform designed to protect and strengthen your business critical communications. It offers real-time trusted communication across organizations, giving you the freedom to communicate on your own terms. With Element, you can control your data through its open source and flexible hosting, enabling data sovereignty. The app allows you to structure discussion spaces, customize chat rooms, and share live data through widgets and integrations to boost your productivity. It also provides instant messaging, voice/video calls, location sharing, voting polls and more. Element ensures your data is secure by default, allowing you to focus on getting your work done. You have complete independence to own and control your entire communication platform, configure networks to suit organizational requirements, and strengthen cybersecurity and business continuity plans. Element is led by the creators of Matrix, the decentralized open standard for secure and sovereign real time communication.",
    "tags": [
      "Chat",
      "Communication",
      "Security"
    ]
  },
  {
    "slug": "elkarbackup",
    "logo": null,
    "name": "ElkarBackup",
    "description": "ElkarBackup is a robust open-source backup management system designed to streamline data protection and recovery for diverse environments. With an intuitive web-based interface and extensive automation capabilities, it simplifies backup scheduling and execution. ElkarBackup supports various storage backends and ensures reliable backup operations with robust monitoring and reporting features. Whether you're managing personal data or enterprise-scale systems, ElkarBackup offers an efficient and user-friendly solution for safeguarding your critical information.",
    "tags": [
      "Backup Management",
      "Automation",
      "Data Recovery",
      "Open Source"
    ]
  },
  {
    "slug": "emby",
    "logo": "logo.png",
    "name": "Emby",
    "description": "Emby is a personal media server that brings all of your home videos, music, and photos together into one place for easy access. It automatically converts and streams your media on-the-fly, allowing you to play it on any device. With Emby, you can enjoy your media while away from home without the need to fumble with IP addresses. It also offers live TV streaming to any device, DVR management, and a library of recordings. Emby organizes your personal media into rich, beautiful displays and notifies you of server activity based on events and actions that are important to you. It also offers parental controls to easily manage content access for your children. Emby apps are available for all of your favorite devices, including Android, iPhone, iPad, Windows Phone, and Windows Tablets, allowing you to take your home videos, music, and photos with you wherever you go.",
    "tags": [
      "Media"
    ]
  },
  {
    "slug": "espocrm",
    "logo": "logo.png",
    "name": "EspoCRM",
    "description": "EspoCRM is a powerful web application designed to streamline your company's relationships. This versatile tool allows you to manage and evaluate all types of relationships, including people, companies, projects, and opportunities, all within an easy-to-use and intuitive interface. EspoCRM is trusted by over 50,000 companies across 163 countries, and has been enhancing business operations for 9 years. It is widely used across various sectors such as wholesale and retail trade, e-commerce, banking, call-centers, manufacturing, education, travel & tourism, real estate, healthcare, and insurance. EspoCRM is designed to skyrocket your sales, transform your marketing strategy, and deliver an exceptional customer experience. It is a free self-hosted and cloud CRM software that can be used simultaneously by many people. Increase your company’s profitability and build customer loyalty with EspoCRM, your open source sales tool.",
    "tags": [
      "CRM"
    ]
  },
  {
    "slug": "etherpad",
    "logo": "logo.png",
    "name": "Etherpad",
    "description": "Etherpad is an open-source online editor that enables real-time collaborative editing directly in your browser. Users can simultaneously work on documents, such as articles, press releases, or to-do lists, with all changes visible to everyone in real time. It supports import/export to various data exchange formats and can be customized with plugins to suit specific needs, making it a versatile tool for a wide range of collaborative tasks.",
    "tags": [
      "Collaboration",
      "Communication",
      "Productivity"
    ]
  },
  {
    "slug": "evobot",
    "logo": "logo.png",
    "name": "EvoBot",
    "description": "EvoBot is a music bot designed for Discord, a popular communication platform. It's built with TypeScript and discord.js, and it uses a Command Handler from discordjs.guide. The bot allows users to play music directly from YouTube either by using a URL or a search query. It also supports playing YouTube playlists. In addition to playing music, EvoBot offers a variety of commands for managing the playback. Users can control the volume, pause and resume playback, skip songs, and even move songs within the queue. The bot also provides lyrics for songs and can show its uptime. EvoBot supports multiple languages, making it accessible to users around the world.",
    "tags": [
      "Chat",
      "Media",
      "Music",
      "Discord"
    ]
  },
  {
    "slug": "excalidraw",
    "logo": "logo.png",
    "name": "Excalidraw",
    "description": "Excalidraw is an open-source virtual whiteboard designed to bring your creativity to life. It allows you to create beautiful hand-drawn like diagrams, wireframes, or any other visuals you can imagine. The app is equipped with an infinite, canvas-based whiteboard that supports a hand-drawn like style. It offers a wide range of tools including rectangle, circle, diamond, arrow, line, free-draw, eraser, and more. You can customize your drawings with the help of image support and shape libraries. The app also supports localization and allows you to export your creations to PNG, SVG, and clipboard. It also features an open format that lets you export drawings as an .excalidraw json file. The app is also equipped with features like arrow-binding, labeled arrows, undo/redo, and zoom and panning support. Excalidraw also offers real-time collaboration and end-to-end encryption for secure and efficient teamwork.",
    "tags": [
      "Productivity",
      "Collaboration",
      "Visualization"
    ]
  },
  {
    "slug": "fider",
    "logo": "logo.png",
    "name": "Fider",
    "description": "Fider is a feature-rich solution designed to help you understand and prioritize your customers' needs. It allows your customers to share their ideas, vote, and discuss what they need the most. With Fider, you can keep everyone informed about the status of their suggestions, whether they are started, completed, or declined. The app offers a one-click sign-in feature, making it easy for visitors to contribute. You can customize Fider to match your brand's identity, and even control access to your site by making it private. The app also supports multiple languages, making it accessible to a global audience. Fider allows you to tag your content for easy organization and uses the popular Markdown language for text styling. It also provides a public API for integration into your process and can integrate with any system that supports Webhook. With Fider, you can collect valuable feedback, respond to suggestions, and keep your audience in the loop, all in one place.",
    "tags": [
      "Productivity",
      "Feedback",
      "Collaboration"
    ]
  },
  {
    "slug": "filebrowser",
    "logo": "logo.png",
    "name": "Filebrowser",
    "description": "File Browser is a versatile app designed to provide a file managing interface within a specified directory. It's a powerful tool that allows you to upload, delete, preview, rename, and edit your files with ease. The app supports the creation of multiple users, with each user having their own directory, making it an ideal solution for managing files in a multi-user environment. File Browser also offers a range of customization options, including the ability to change the way users authenticate with the server, execute shell commands before or after certain events, and personalize the installation with custom branding. It can be used as a standalone app, offering a comprehensive and user-friendly solution for all your file management needs.",
    "tags": [
      "File Management"
    ]
  },
  {
    "slug": "filerun",
    "logo": "logo.png",
    "name": "Filerun",
    "description": "FileRun is a private, fully controlled file management and sharing solution. It's like having your own personal Google Drive, but with complete control and privacy. FileRun allows you to instantly access your files on any server without the need for importing or scanning. It supports access via FTP, SMB, and WebDAV, reflecting any changes made to your files instantly. You can sync files using desktop apps and access your files on the go with compatible mobile apps. FileRun is also great for managing photos with fast thumbnail and preview generation, timeline browsing, and metadata support. It even allows you to group photos from various folders into virtual albums that you can share online. The new virtual drive feature lets you access files directly from your computer without using up all your disk space. FileRun also supports collaboration with guest users and file requests for easy file collection and submission. It also integrates with various plugins for file editing, viewing, and conversion. FileRun ensures your files are safe with automatic file versioning and a trash folder for deleted files. It also allows for full customization to match your branding. FileRun is secure, loaded with features, and offers a smooth and intuitive mobile experience.",
    "tags": [
      "File Management",
      "Storage",
      "Privacy"
    ]
  },
  {
    "slug": "filezilla",
    "logo": "logo.png",
    "name": "Filezilla Client",
    "description": "FileZilla Client is a fast and reliable cross-platform FTP, FTPS and SFTP client. It is designed with a lot of useful features and an intuitive graphical user interface. The app is capable of delivering a true lossless image at a high framerate to your web browser. It supports multiple architectures and can be accessed via HTTP or HTTPS. The app also allows you to specify the user PUID and group PGID to avoid permission issues between the host OS and the container. It also provides the ability to override the default umask settings for services started within the containers.",
    "tags": [
      "File Management"
    ]
  },
  {
    "slug": "firefox",
    "logo": "logo.svg",
    "name": "Firefox",
    "description": "Firefox Browser, also known as Mozilla Firefox or simply Firefox, is a free and open-source web browser developed by the Mozilla Foundation and its subsidiary, the Mozilla Corporation. This app allows you to deploy and run Firefox in a containerized environment, providing a secure and isolated space for your browsing activities. Firefox uses the Gecko layout engine to render web pages, implementing current and anticipated web standards. The app supports multiple architectures and can be accessed via HTTP or HTTPS. It also offers additional environment variables and run configurations to enable or disable specific functionalities. This containerized version of Firefox is capable of delivering a true lossless image at a high framerate to your web browser, providing an optimal browsing experience.",
    "tags": [
      "Web Browsers",
      "Internet"
    ]
  },
  {
    "slug": "fireshare",
    "logo": "logo.png",
    "name": "Fireshare",
    "description": "Fireshare is a simple, user-friendly app designed to make sharing your game clips, videos, or other media a breeze. With Fireshare, you no longer have to go through the hassle of uploading your short clips to YouTube and waiting for them to process. Instead, you can easily self-host your clips and share them with your friends through unique links generated by the app. All you need to do is put your videos in a folder and Fireshare will handle the rest. The app also allows you to view all your videos, edit their details, and decide whether you want them to show up on the public feed. Fireshare also supports foldered sorting, allowing you to organize your videos into categories of your choosing. The app is mobile-friendly and supports open graph data, allowing websites and messaging apps to display the title, description, and video thumbnails in your posts.",
    "tags": [
      "Media",
      "File Management"
    ]
  },
  {
    "slug": "flame",
    "logo": "logo.png",
    "name": "Flame",
    "description": "Flame is a self-hosted startpage for your server, designed to be your very own application hub. Inspired by SUI, its sleek design is not only visually appealing but also incredibly easy to use. With Flame, you can create, update, and delete your applications and bookmarks directly from the app using built-in GUI editors. It also allows you to pin your favorite items to the homescreen for quick and easy access. The app features an integrated search bar with local filtering and 11 web search providers, and even gives you the ability to add your own. Flame also includes an authentication system to protect your settings, apps, and bookmarks. The interface is highly customizable, with dozens of options including support for custom CSS, 15 built-in color themes, and a custom theme builder. Additionally, Flame features a weather widget with current temperature, cloud coverage, and animated weather status. It also integrates with Docker to automatically pick and add apps based on their labels.",
    "tags": [
      "Dashboard",
      "Bookmarks",
      "Productivity"
    ]
  },
  {
    "slug": "flaresolverr",
    "logo": null,
    "name": "FlareSolverr",
    "description": "FlareSolverr is a proxy server designed to help bots and scripts bypass web protections like Cloudflare's anti-bot page. It acts as an intermediary that can execute JavaScript and handle cookies and sessions, making it appear as if requests are coming from a real web browser. This tool is particularly useful for web scraping and automated data collection tasks where access to JavaScript-heavy websites is required. FlareSolverr supports multiple platforms and can be integrated into existing scraping setups to solve CAPTCHAs and manage browser sessions efficiently.",
    "tags": [
      "Web Scraping",
      "Proxy Server",
      "Anti-bot Bypass",
      "CAPTCHA Solving",
      "Cloudflare Bypass"
    ]
  },
  {
    "slug": "flarum",
    "logo": "logo.png",
    "name": "Flarum",
    "description": "Experience a modern, fast, and free forum experience with our app. Designed with an elegant UI, our app is mobile-first, easily stylable, and lightweight, ensuring a seamless experience on any device. It prioritizes security and trust, providing a safe environment for users. The app is also localised into many languages, with 41 translation packs available, making it accessible to users worldwide. Whether you're a leading telephone network serving millions of customers, an avid adventurer sharing your experiences, or a provider of communication and entertainment, our app is the perfect platform for you. It's not just a forum, it's a revolution in community engagement.",
    "tags": [
      "Forums",
      "Communication",
      "Social Networking"
    ]
  },
  {
    "slug": "flowise",
    "logo": "logo.png",
    "name": "Flowise",
    "description": "Flowise is an open-source UI visual tool that allows you to build your own customized LLM (Language Learning Model) flow with ease. It is built on top of LangChainJS and is written in Node Typescript/Javascript. With Flowise, you can see your LLM apps running live, making the process of building and testing faster and more efficient. The app is extensible, allowing for custom component integrations. It offers a variety of features such as QnA retrieval chain, language translation chain, and a conversational agent with memory for chat models. Flowise is designed to make the process of visualizing and building LLM apps simple and accessible.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "focalboard",
    "logo": "logo.svg",
    "name": "Focalboard",
    "description": "Mattermost Boards is an open-source project management tool designed for technical teams. It centralizes, plans, and tracks all your work in one place, helping your organization maintain a single source of truth. This ensures your teams stay aligned to complete tasks, reach milestones, and achieve their goals. The app allows you to manage all your tasks on a Kanban, table, gallery, and calendar view, focusing on the highest priority items with board filters. It also offers real-time collaboration features, including card comments, @mention teammates, and board permissions to share your board with the entire team or specific individuals. Mattermost Boards comes with pre-built templates for quick setup or the option to create a fully custom board from scratch. It also includes features like unlimited boards, file sharing, customizable templates, project cards & tasks, archiving & back-up snapshots, and more. Mattermost Boards is an open-source alternative to tools like Asana, Trello, and Notion.",
    "tags": [
      "Project Management",
      "Collaboration",
      "Task Management"
    ]
  },
  {
    "slug": "formbricks",
    "logo": "logo.svg",
    "name": "Formbricks",
    "description": "Formbricks provides a free and open source surveying platform. Gather feedback at every point in the user journey with beautiful in-app, website, link and email surveys. Build on top of Formbricks or leverage prebuilt data analysis capabilities.",
    "tags": [
      "Survey",
      "Forms",
      "Experience Management"
    ]
  },
  {
    "slug": "freescout",
    "logo": "logo.png",
    "name": "Freescout",
    "description": "FreeScout is a powerful, open-source help desk and shared inbox application. It's a self-hosted alternative to Zendesk & Help Scout, offering you complete control over your customer support without compromising on privacy. FreeScout is designed to be lightweight yet robust, capable of handling unlimited support agents, tickets, and mailboxes. It offers seamless email integration, automatic replies, internal notes, conversation forwarding, merging, and moving, among other features. The application is mobile-friendly and supports multiple languages. It also includes features like push notifications, starred conversations, collision detection, and flexible notifications for user agents. FreeScout also offers a range of integrations, including Slack, WhatsApp, Facebook, and Telegram, and supports translating tickets, live chat, time tracking, custom fields, and more. It's the perfect solution for those who need professional customer support but can't afford to pay for Zendesk or Help Scout.",
    "tags": [
      "Customer Support"
    ]
  },
  {
    "slug": "freshrss",
    "logo": "logo.svg",
    "name": "Freshrss",
    "description": "FreshRSS is a free, self-hostable aggregator for RSS feeds. It allows you to gather and read your favorite news sources in one place, providing a streamlined and efficient way to stay informed. The app supports multiple platforms and can be easily accessed through a web user interface. FreshRSS also offers the ability to use external databases, enabling users to create a user and database in their MySQL/MariaDB server. Additional extensions can be added to enhance the functionality of the app. FreshRSS is designed to be simple to use, yet powerful, providing a comprehensive solution for RSS feed aggregation.",
    "tags": [
      "RSS"
    ]
  },
  {
    "slug": "ghost-file-sharing",
    "logo": "logo.png",
    "name": "Ghost File Sharing",
    "description": "Our app is a powerful tool designed to streamline your workflow and enhance productivity. It allows you to easily find code, projects, and people on GitHub, making it simpler than ever to collaborate and contribute to open-source projects. With this app, you can stay updated with product updates, company news, and more by subscribing to our newsletter. It also offers a range of features designed to ensure the security of your work, making it a reliable choice for enterprises. Whether you're a developer looking for a robust platform or a company seeking to leverage the power of open-source, our app is the perfect solution for you.",
    "tags": [
      "Code Hosting",
      "Developer Tools"
    ]
  },
  {
    "slug": "ghost",
    "logo": "logo.png",
    "name": "Ghost",
    "description": "Ghost is a robust application designed for new-media creators looking to turn their audience into a business. It provides a suite of modern tools to build a website, publish engaging content, send newsletters, and offer paid subscriptions to members. Ghost allows you to launch your website with a selection of beautiful free themes and design settings that can be tweaked to match your brand and style. It also offers an editor built for professionals, with advanced workflows and a user-friendly interface. With Ghost, you can expand your story beyond words, incorporating image galleries, gifs, video, audio, and more into your content. The app also includes built-in newsletters, allowing you to deliver posts by email to your audience. Ghost simplifies the process of building an indie publication with memberships and subscriptions, with native signup forms that convert anonymous views into logged-in members. It also provides detailed engagement analytics to understand what content is getting the most attention and who your biggest fans are. Ghost also supports offers and promotions to entice new subscribers and grow your business.",
    "tags": [
      "CMS",
      "Blog",
      "Business Apps"
    ]
  },
  {
    "slug": "gitea",
    "logo": "logo.png",
    "name": "Gitea",
    "description": "Gitea is a lightweight DevOps platform designed to streamline operations from planning to production. It enables the creation and management of repositories, exploration of commit history and code files, review and merging of code commits, and more. Gitea also supports standard Git features, including tags, cherry-picking, hooks, and integrated collaboration tools. It features an integrated CI/CD system, Gitea Actions, that is compatible with GitHub Actions. With Gitea, you can efficiently manage a project's requirements, features, and bugs through issue tasks, labeling, and kanban project boards. It supports more than 20 different kinds of public or private package management. Gitea is an open-source project that accelerates development and collaboration, offering universal compatibility and flexible deployment options. It also provides a powerful built-in CI/CD system and is developed with a focus on security. Gitea can be tailored to your requirements and is integrated with your favorite tools to boost your workflow.",
    "tags": [
      "Code Hosting",
      "Developer Tools",
      "Documentation",
      "Project Management"
    ]
  },
  {
    "slug": "github-desktop",
    "logo": "logo.png",
    "name": "Github Desktop",
    "description": "Github Desktop is an open-source, Electron-based application that simplifies the way you interact with GitHub. Written in TypeScript and using React, this app provides a user-friendly interface for managing your GitHub repositories. It allows you to access your GitHub account, manage your repositories, make changes, and track updates, all from the convenience of your desktop. The app is accessible via http://yourhost:3000/ or https://yourhost:3001/. It supports multiple architectures and can be easily deployed using Docker. Please note that this app requires specific environment variables and run configurations for optimal functionality.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "glitchtip",
    "logo": "logo.png",
    "name": "GlitchTip",
    "description": "GlitchTip is a simple, open-source error tracking application designed to collect, organize, and alert you about every error from your project in real time. It allows you to monitor your software's performance, track errors, and check your site's uptime all in one place. GlitchTip is compatible with Sentry client SDKs, offering a more straightforward operation. It provides a comprehensive error tracking system, reporting your website or application's exceptions, log messages, Content Security Policy violations, and more. With GlitchTip, you can also monitor your application's performance, identifying slow web requests, database calls, and other transactions. Additionally, it offers uptime monitoring, pinging your site and alerting you when it's not responding. GlitchTip is the perfect choice for those who value simplicity, affordability, and the freedom provided by open source.",
    "tags": [
      "Monitoring",
      "Developer Tools",
      "Logging"
    ]
  },
  {
    "slug": "gogs",
    "logo": "logo.png",
    "name": "Gogs",
    "description": "Gogs is a self-hosted Git service designed to be simple, stable, and extensible. It allows you to set up your own Git service in the most painless way possible. The app is built with Go, enabling it to run on all platforms that Go supports, including Linux, macOS, Windows, and ARM-based systems. Gogs is lightweight and has low minimal requirements, making it possible to run even on an inexpensive Raspberry Pi. It offers a range of features including user dashboard, access to repositories via SSH, HTTP and HTTPS protocols, repository and organization management, and more. Gogs is 100% open source and free of charge, with all source code available under the MIT License.",
    "tags": [
      "Code Hosting"
    ]
  },
  {
    "slug": "gotenberg",
    "logo": "logo.png",
    "name": "Gotenberg",
    "description": "Gotenberg is a Docker-powered stateless API designed to handle PDF files. It offers a developer-friendly interface to interact with robust tools like Chromium and LibreOffice, enabling the conversion of various document formats such as HTML, Markdown, Word, Excel, and more into PDF files. The app also supports an asynchronous workflow with a webhook feature, allowing you to upload the output file to your preferred destination. Gotenberg is a modular platform, meaning you can customize each module according to your needs. Additionally, it provides the option to build your own Docker image by adding new tools and creating modules that offer new routes to the API.",
    "tags": [
      "Developer Tools",
      "Documents",
      "Productivity"
    ]
  },
  {
    "slug": "gotify",
    "logo": "logo.png",
    "name": "Gotify",
    "description": "Gotify is a simple, self-hosted server for sending and receiving messages. It is designed with a user-friendly interface and a straightforward API, making it easy to use across different platforms. The core of Gotify is the server, which features a WebUI and functionality for sending messages via a REST-API, subscribing/receiving messages via a web socket connection, and managing users, clients, and applications. Gotify also includes an Android client for subscribing to the message stream of the server, creating push notifications for newly received messages. Additionally, there is a command line client for pushing messages to the server. All these features make Gotify a versatile tool for managing and exchanging messages while maintaining control over your data.",
    "tags": [
      "Communication",
      "Push Notifications",
      "Self-Hosted"
    ]
  },
  {
    "slug": "gotosocial",
    "logo": "logo.png",
    "name": "GoToSocial",
    "description": "GoToSocial is a lightweight, customizable, and safety-focused social network server that provides a fun and fast entryway into the Fediverse. It is written in Golang and allows you to keep in touch with friends, post, read, and share images and articles without being tracked or advertised to. If you've used platforms like Twitter or Tumblr, GoToSocial will feel familiar. You can follow people, have followers, make posts that others can favorite, reply to, and share, and scroll through posts from people you follow using a timeline. You can write long or short posts, post images, and even block people or limit unwanted interactions by posting just to your friends. GoToSocial is not designed for influencers with tens of thousands of followers, nor is it designed to be addictive. Your timeline and experience are shaped by who you follow and how you interact with people, not by engagement metrics. GoToSocial is ideal for small or single-user instances running on low-powered devices, like single-board computers or old laptops repurposed as home servers. It is simple to install and maintain, and prioritizes good security and sensible defaults.",
    "tags": [
      "Social Networking"
    ]
  },
  {
    "slug": "grafana",
    "logo": "logo.png",
    "name": "Grafana",
    "description": "Grafana is a powerful, open-source platform designed to provide comprehensive metrics, logs, and trace data visualization. It allows users to query, visualize, and alert on their data, offering high-scale distributed tracing and scalable, performant metrics. The app also includes features for incident response and management, performance testing, and on-call management. Grafana can connect to various data sources and applications, providing operational dashboards for your data anywhere. It also offers a free forever plan, allowing users to monitor their data with 10,000 series metrics, 50 GB of logs, 50 GB of traces, and 500 VUh of k6 testing. Grafana is a versatile tool for anyone looking to gain insights from their data.",
    "tags": [
      "Monitoring",
      "Logs",
      "Metrics",
      "Traces"
    ]
  },
  {
    "slug": "grav",
    "logo": "logo.png",
    "name": "Grav",
    "description": "Grav is an award-winning, open-source, flat-file content management system (CMS) designed to help you build faster websites. It's been voted 'Best Open Source CMS' in 2016 and 'Best Flat File CMS' in 2017, 2019, 2020, and 2021. Grav is known for its fast performance, extensibility, and user-friendly interface. With Grav, you can easily modify flexible configuration settings, edit content with a powerful markdown editor, and install a wide range of modern themes with one click. It also offers a built-in package manager for easy plugin installation. Grav is packed with features and tools that make content creation enjoyable. It supports one-click installs, powerful content filtering, dynamic content types, multi-language support, simple backups and restores, image media processing, and easy theme customization. Whether you're creating landing pages, portfolios, product sites, personal resumes, e-commerce sites, blogs, business sites, or documentation, Grav provides the flexibility and power you need.",
    "tags": [
      "CMS"
    ]
  },
  {
    "slug": "grayduckmail",
    "logo": "logo.png",
    "name": "Gray Duck Mail",
    "description": "Gray Duck Mail is a user-friendly email discussion list application that offers an alternative to traditional email discussion group software. It is designed to be simple to set up and manage, making the process of running an email discussion list effortless. Gray Duck Mail is perfect for managing mailing lists between small to medium size groups, such as neighborhoods, schools, workplaces, and families. With Gray Duck Mail, you can send one email and automatically keep everyone in the loop. The application monitors a remote mail server for messages and processes them by relaying the message to all list members. It also automatically handles user subscriptions, unsubscription requests, and email bounces. Gray Duck Mail works with any external email host that allows for POP3/SMTP connections and message forwarding or aliasing. It relies totally on an external mail provider, allowing you to use an existing web host or email account.",
    "tags": [
      "Email"
    ]
  },
  {
    "slug": "grist",
    "logo": "logo.png",
    "name": "Grist",
    "description": "Grist is an open-source, customizable data management platform that combines the power of a spreadsheet with the structure of a database. Designed for teams and individuals who need to organize, analyze, and share information, Grist offers a flexible and collaborative environment for data management. It supports relational data linking, allowing users to create complex, connected data tables, and provides tools for custom views, formulas, and dashboards. Grist’s user-friendly interface empowers users to build powerful applications without requiring extensive coding knowledge.",
    "tags": [
      "Data Management",
      "Spreadsheet",
      "Database",
      "Collaboration",
      "No-Code",
      "Customizable Dashboards",
      "Data Security",
      "API Integration",
      "Templates",
      "Data Import/Export"
    ]
  },
  {
    "slug": "hackmdio",
    "logo": "logo.png",
    "name": "HackMD",
    "description": "HackMD is a simple and powerful note-taking app that allows you to create notes, write and organize your thoughts, and collaborate with others in real time. It's a great tool for anyone who wants to stay organized and productive while working remotely or on the go.",
    "tags": [
      "No-Code",
      "Collaboration",
      "Note Taking"
    ]
  },
  {
    "slug": "hammond",
    "logo": "logo.png",
    "name": "Hammond",
    "description": "Hammond is a self-hosted vehicle management system designed to track fuel and other expenses related to your vehicles. It supports multiple users sharing multiple vehicles, making it an ideal solution for families, businesses, or any group with shared vehicles. With Hammond, you can manage multiple vehicles, track fuel and other expenses, and even save attachments against vehicles. The app also features quick entries, allowing you to take a photo of a receipt or pump screen for later entry. It provides vehicle-level and overall reporting, helping you keep a close eye on your vehicle expenses. Furthermore, Hammond allows you to import data from Clarkson or Fuelly, making the transition to this system seamless and straightforward.",
    "tags": [
      "Finance",
      "Productivity"
    ]
  },
  {
    "slug": "hastebin",
    "logo": "logo.png",
    "name": "Hastebin",
    "description": "Haste is an open-source software that allows you to quickly and easily share text snippets. It's designed to be simple, pretty, and easy to use. With Haste, you can create a 'paste' of your text and it will generate a unique URL that you can share. This is particularly useful for sharing code snippets or other information that you want to quickly share with others. Haste is written in node.js and can be backed by either a file system or redis, providing flexibility in how it's set up. It also includes a utility called haste-client that allows you to create pastes directly from your command line. Haste is designed to work well with a variety of browsers, including Firefox, Chrome, and Safari.",
    "tags": [
      "Code Hosting",
      "Documents"
    ]
  },
  {
    "slug": "hastypaste",
    "logo": "logo.png",
    "name": "Hasty Paste",
    "description": "Hasty Paste is a fast and minimalistic app designed for quickly pasting and sharing text. It is primarily used for sharing debug logs and similar content to aid developers in providing tech support. The app is publicly accessible with no authentication required. It generates random IDs for each paste, with an optional 'long' ID to reduce the chances of brute force attacks. Users can also add expiring pastes. The app features a dark theme and optional syntax highlighting. It is designed to use minimal resources and does not require JavaScript. Hasty Paste also allows users to choose their file system and offers a custom flat-file system. The app is named 'Hasty Paste' to reflect its speed and ease of use.",
    "tags": [
      "Documents"
    ]
  },
  {
    "slug": "hasura",
    "logo": "logo.svg",
    "name": "Hasura",
    "description": "Hasura is a powerful Data API Platform that automates the process of building, securing, optimizing, and deploying GraphQL and REST APIs. It eliminates the need for manual API creation, enabling developers to generate APIs effortlessly by connecting to existing databases. This results in rapid, scalable application development. Hasura is compatible with a variety of popular databases, including PostgreSQL, MySQL, and MongoDB, allowing you to build GraphQL APIs on top of your existing databases. It also provides comprehensive tools to secure APIs beyond authentication and authorization. With Hasura, you can accelerate the development of new applications or add new features to an existing application in days instead of weeks. It also helps in fast-tracking cloud migration, frontend and backend modernization, and application re-architecture projects by automating 80% of your API development work.",
    "tags": [
      "Developer Tools",
      "Databases",
      "API Development"
    ]
  },
  {
    "slug": "hedgedoc",
    "logo": "logo.png",
    "name": "HedgeDoc",
    "description": "HedgeDoc, previously known as CodiMD, is an open-source, web-based, self-hosted, collaborative markdown editor. It allows you to collaborate on notes, graphs, and presentations in real-time. Simply share your note-link with your co-workers and they can join in the collaboration. The editor runs directly in your browser, allowing you to stay in control of your data by keeping it on your server. HedgeDoc also offers a presentation mode for building and presenting slides in markdown, and supports a variety of graphs, diagrams, and embedded content. It features an easy-to-use permission system for managing note permissions, and keeps track of changes to your notes through revisions, even allowing you to revert to older versions. Despite its extensive features, HedgeDoc has low system requirements and can run smoothly even on a Raspberry Pi.",
    "tags": [
      "Documents",
      "Collaboration",
      "Note-taking"
    ]
  },
  {
    "slug": "heimdall",
    "logo": "logo.png",
    "name": "Heimdall",
    "description": "Heimdall Application Dashboard is a versatile and visually pleasing dashboard for all your web applications. It provides a simple and elegant interface where you can add links to any web application or site you frequently use. The app is designed with simplicity in mind, avoiding the trap of over-complication that many projects fall into. With Heimdall, you can add a link to anything, whether it's intrinsically supported or not, by simply filling in the name, background color, and the link URL. The app also supports Foundation and Enhanced apps. Foundation apps are those supported by Heimdall, and Enhanced apps are like Foundation apps but with the added feature of displaying extra information automatically by entering API credentials. Heimdall is all about making your web application experience smooth, simple, and enjoyable.",
    "tags": [
      "Dashboard"
    ]
  },
  {
    "slug": "hiccup",
    "logo": "logo.png",
    "name": "Hiccup",
    "description": "Hiccup is a static start page application designed to help you access your most important links quickly and efficiently. It allows you to categorize your links, add them via drag and drop, and even search for them using various search providers. The app also supports multiple profiles, enabling you to switch between different sets of links based on your needs. Hiccup also features a built-in config manager for easy management of your link configurations. The app is designed to be used anywhere you can serve a static webpage from, such as your home server or a new browser tab. It also supports full keyboard navigation for quick and easy access to your links.",
    "tags": [
      "Productivity",
      "Bookmarks"
    ]
  },
  {
    "slug": "homarr",
    "logo": "logo.svg",
    "name": "Homarr",
    "description": "Homarr is a powerful dashboard designed to simplify the management of your server. It provides a sleek, modern interface that brings all your apps and services together in one place, allowing you to access and control everything with ease. Homarr seamlessly integrates with the apps you've added, offering valuable insights and complete control. You can add your self-hosted applications or favorite websites to your dashboard and organize them as you like. Homarr supports integration with many popular applications to enhance your user experience. It is customizable, accessible, and supports 23 languages. With Homarr, you can control and monitor your network directly, use integrations to display data and control apps, and even create your own dashboard using a comprehensible and easy-to-use visual editor. Homarr is open-source and allows commercial usage. It features a quick search function to easily navigate through your apps and supported integrations.",
    "tags": [
      "Dashboard"
    ]
  },
  {
    "slug": "homeassistant",
    "logo": "logo.png",
    "name": "Home Assistant",
    "description": "Home Assistant is an open-source home automation app that prioritizes local control and privacy. It allows you to manage and automate a wide range of devices and services in your home, from electricity grids and solar panels to voice-controlled devices. With its advanced configuration options, you can customize your home automation to suit your needs. It also offers features like multi-factor authentication for added security. Home Assistant is perfect to run on a Raspberry Pi or a local server, providing a comprehensive solution for your home automation needs.",
    "tags": [
      "Home Automation",
      "Open Source",
      "Privacy"
    ]
  },
  {
    "slug": "homer",
    "logo": "logo.png",
    "name": "Homer",
    "description": "Homer is a straightforward, static homepage for your server, designed to keep all your services easily accessible. It operates based on a simple yaml configuration file. This app serves as a full static HTML/JS dashboard, providing a centralized platform where you can manage and access all your services. It features a search function, grouping, theme customization, and offline health checks. It also supports keyboard shortcuts for quick navigation. Homer is designed to be served by an HTTP server and is perfect for those who want to keep their services organized and within reach.",
    "tags": [
      "Dashboard"
    ]
  },
  {
    "slug": "humhub",
    "logo": "logo.png",
    "name": "HumHub",
    "description": "HumHub is a flexible open-source social network kit designed to facilitate communication and collaboration. It allows you to create your own customized social network, social intranet, or large social enterprise application tailored to your specific needs. Whether you're looking to boost your business, support your customers, educate your students, or organize your football club, HumHub provides the tools to make it happen. It features an intuitive user interface and a powerful module system that can be extended with third-party tools, your own creations, or existing software. With HumHub, you have full control over your server and data. The app also offers features like posts and updates, file sharing, liking and commenting, and 'Spaces' for group communication. You can extend your profile, create a portfolio, connect with others, and find people with specific skills. With its module system, you can modify anything on HumHub according to your requirements. The app also supports live updates, notifications, activity streams, dashboards, user profiles, groups, directories, file sharing, public access, search functionality, and mobile readiness.",
    "tags": [
      "Social Networking"
    ]
  },
  {
    "slug": "icecoder",
    "logo": "logo.png",
    "name": "ICEcoder",
    "description": "ICEcoder is a revolutionary browser-based code editor designed to streamline and modernize the process of website development. It allows you to code directly within your web browser, either online or offline, eliminating the need for multiple programs. With ICEcoder, you can test your sites on actual web servers and maintain them with ease after development, making for a fast and intelligent development process. It's not just limited to online use - you can also use it as a desktop code editor, provided you have PHP 7.0+. It comes packed with a multitude of features and plugins to enhance your coding experience, including multiple cursors, 80+ highlighting themes, a find & replace builder, login security, coding assistance, visual code difference display, and database management with the Adminer plugin. The latest version, ICEcoder 8.1, introduces regex search on find and replace, double click tab to collapse file manager, active line number highlighting, and many more improvements and bug fixes.",
    "tags": [
      "Code Hosting",
      "Developer Tools",
      "Web Hosting"
    ]
  },
  {
    "slug": "imgproxy",
    "logo": "logo.svg",
    "name": "imgproxy",
    "description": "imgproxy is a powerful app designed to optimize images for web use, making websites and apps run faster while saving storage and SaaS costs. It works by resizing and processing images on the fly, eliminating the need for disk space and reducing the cost of conforming all saved images to specific formats. imgproxy offers a wide range of features for editing images, including resizing, cropping, contrast adjustment, pixelization, saturation, rotating, and more. It also provides security features to protect against common attack vectors in image processing. With imgproxy, you can upload images directly to the cloud or your cluster and request images by specifying parameters in the request URL. The app uses the world’s fastest image processing library, libvips, ensuring quick processing and a small memory footprint. imgproxy Pro plans offer advanced features and vary by capacity and types of support.",
    "tags": [
      "Image Processing",
      "Optimization",
      "Web Development"
    ]
  },
  {
    "slug": "influxdb",
    "logo": "logo.png",
    "name": "InfluxDB",
    "description": "InfluxDB is a time-series database designed to handle high write and query loads commonly required for real-time analytics. It’s optimized for storing timestamped data, making it ideal for monitoring metrics, tracking events, and handling sensor data. With its efficient storage engine, InfluxDB offers built-in support for data compression and compaction, allowing for efficient data retention and storage. This database supports SQL-like queries through InfluxQL, integrates seamlessly with popular data visualization tools like Grafana, and can handle data from IoT devices, DevOps monitoring, finance, and more.",
    "tags": [
      "Time-Series",
      "Monitoring",
      "Analytics",
      "IoT",
      "Database"
    ]
  },
  {
    "slug": "invoiceshelf",
    "logo": "logo.png",
    "name": "InvoiceShelf",
    "description": "InvoiceShelf is an open-source web & mobile app that helps you track expenses, payments & create professional invoices & estimates. Web Application is made using Laravel & VueJS while the Mobile Apps are built using React Native.",
    "tags": [
      "Finance",
      "Invoice Management",
      "Payment Tracking",
      "Accounting"
    ]
  },
  {
    "slug": "isso",
    "logo": "logo.svg",
    "name": "Isso",
    "description": "Isso is a lightweight commenting server designed to be a seamless alternative to Disqus. It is written in Python and JavaScript, and it allows users to leave comments on your website in a simple and straightforward manner. The app supports anonymous comments, preserving the identity of your users, and is easy to manage. Users can write comments in Markdown, and they also have the ability to edit or delete their own comments within a default time frame of 15 minutes. The app uses a SQLite backend, ensuring that your comments are not treated as Big Data. Additionally, it offers Disqus and WordPress import features, allowing you to migrate your existing comments without any hassle. The app is easily integrated into your website by embedding a single JavaScript file.",
    "tags": [
      "Documentation"
    ]
  },
  {
    "slug": "ittools",
    "logo": "logo.png",
    "name": "It Tools",
    "description": "IT-Tools is a comprehensive suite of handy tools designed to assist developers in their day-to-day tasks. It includes a wide range of features such as Crypto Token generator, Hash text Bcrypt, UUIDs v4 generator, Encrypt/Decrypt text, BIP39 passphrase generator, and many more. The app also offers various converters like Date-time converter, Integer base converter, Roman numeral converter, and Base64 string encoder/decoder among others. It provides a platform for developers to generate QR codes, SVG placeholders, and even record videos from their camera. With additional features like Git cheatsheet, Random port generator, Crontab generator, and JSON prettify and format, IT-Tools is a one-stop solution for all developer needs.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "jellyfin",
    "logo": "logo.png",
    "name": "Jellyfin",
    "description": "Jellyfin is a free software media system that allows you to take full control of your media. It enables you to collect, manage, and stream your media from your own server to any device. With Jellyfin, you can enjoy your entire movie collection, watch your favorite shows, listen to your music, and even read your books and comics. It also offers features for live TV and DVR, allowing you to watch TV and set automatic recordings to expand your library. Jellyfin also provides a SyncPlay feature, making remote movie nights easier than ever. The app is available on most popular platforms, ensuring your media is ready to follow you wherever you go. Jellyfin is licensed under the GNU GPL, meaning you can use, study, modify, build, and distribute it for free. It is a privacy-focused solution with no tracking or central servers collecting your data.",
    "tags": [
      "Media"
    ]
  },
  {
    "slug": "jellyseerr",
    "logo": "logo.png",
    "name": "Jellyseerr",
    "description": "Overseerr is a powerful application designed to streamline the process of managing your media library. It offers full Plex integration, allowing you to log in and manage user access with Plex, and syncs with your Plex library to show what titles you already have. The app also integrates with Sonarr and Radarr, with plans for more services in the future. Overseerr features an easy-to-use request system, letting users request individual seasons or movies through a clean, user-friendly interface. The app also boasts a simple request management UI, making it easy to approve recent requests without having to navigate through the app. It also offers a granular permission system and localization into other languages. The mobile-friendly design ensures you can approve requests on the go. Jellyseerr, a fork of Overseerr, extends these features to Jellyfin and Emby media servers, offering full integration with these platforms. It also supports movies, shows, mixed libraries, and allows for easy integration with your existing services. Jellyseerr also offers a customizable request system, a simple request management UI, a granular permission system, and support for various notification agents.",
    "tags": [
      "Media",
      "Request Management",
      "Integration"
    ]
  },
  {
    "slug": "jenkins",
    "logo": "logo.png",
    "name": "Jenkins",
    "description": "Jenkins is an open source automation server. It helps automate the parts of software development related to building, testing, and deploying, facilitating continuous integration, and continuous delivery. It is a server-based system that runs in servlet containers such as Apache Tomcat.",
    "tags": [
      "Automation",
      "CI/CD",
      "DevOps",
      "Jenkins"
    ]
  },
  {
    "slug": "jirafeau",
    "logo": "logo.svg",
    "name": "Jirafeau",
    "description": "Jirafeau is an open-source software designed for simple and efficient file sharing. It operates on a 'one-click-filesharing' principle, where you select your file, upload it, and share a link. The app allows you to send large files without any size limit, thanks to the HTML5 file API. It also provides a real-time progress report, showing speed, percentage, and remaining upload time. Jirafeau offers optional password protection for both uploading and downloading, and you can set an expiration time for downloads. The app also has a self-destruct feature, which deletes the file after the first download. It uses base 64 encoding to shorten URLs and allows for maximal upload size configuration. Jirafeau also features optional data encryption and a small administration interface.",
    "tags": [
      "File Management",
      "Data Science"
    ]
  },
  {
    "slug": "joplin",
    "logo": "logo.svg",
    "name": "Joplin",
    "description": "Joplin is an open-source note-taking application that allows you to capture your thoughts and access them securely from any device. It supports multimedia notes, including images, videos, PDFs, and audio files, and even allows the creation of math expressions and diagrams. With Joplin Cloud, you can share your notes and collaborate with others. The app also features a web clipper extension for saving web pages or screenshots as notes. Joplin can be customized with plugins, themes, and multiple text editors, and it synchronizes with various services, including Joplin Cloud, Dropbox, and OneDrive. All notes are saved in an open format and secured with end-to-end encryption.",
    "tags": [
      "Notes",
      "Productivity",
      "Developer Tools",
      "Documentation"
    ]
  },
  {
    "slug": "kanboard",
    "logo": "logo.png",
    "name": "Kanboard",
    "description": "Kanboard is a free and open-source project management software that utilizes the Kanban methodology. It provides a visual and clear overview of your tasks, allowing you to easily manage your projects by dragging and dropping tasks between columns. The app is designed with simplicity and minimalism in mind, limiting the number of features to maintain focus on your work. It also includes a search and filter function, enabling you to quickly find tasks using a simple query language. Tasks can be broken down into sub-tasks, with the ability to add comments, documents, and change various aspects such as color, category, assignee, and due date. Kanboard also offers automated actions to streamline your workflow, eliminating the need for repetitive manual tasks. It supports multiple authentication backends and is translated in over 30 languages.",
    "tags": [
      "Project Management"
    ]
  },
  {
    "slug": "kavita",
    "logo": "logo.svg",
    "name": "Kavita",
    "description": "Kavita is a high-speed, sleekly designed, self-hosted digital library that supports a wide range of file formats. It allows you to quickly resume your reading from your homepage, browse your Manga, Comics, and Books, and search for your favorite manga with ease. Kavita also provides full support for all fields from ComicInfo.xml (and EPUB) for metadata filtering. It features built-in ratings and reviews for each Manga, integrated chapters and volumes, and user & library management. Kavita also includes a responsive Manga/Comic/Image Reader with impressive caching for a seamless reading experience, and a customizable Book reader. It also provides server and user stats, and premium features with a Kavita+ Subscription. Kavita supports a wide array of file formats for Manga/Comics, Books, and Raw Images. It also offers user management and sharing features, allowing you to create users and share your libraries with them. Kavita is fast, efficient, and responsive, offering full text search, grouping and organizing features, full metadata support and filtering ability, and cool stats for individual user accounts and your server.",
    "tags": [
      "Media",
      "File Management"
    ]
  },
  {
    "slug": "keila",
    "logo": "logo.png",
    "name": "Keila",
    "description": "Keila is a reliable and easy-to-use email newsletter tool that helps you grow your contact lists and send data-driven campaigns effortlessly. With Keila, you can import your existing contacts simply by uploading a CSV file. The app offers complete freedom to add custom data and tags to your contacts, which can be used to filter contacts and as merge fields in campaigns. Keila also features powerful segmentation, allowing you to create smart subsets of your contact lists. The app respects the privacy of your contacts and ensures that your data remains yours. Keila provides live statistics for your newsletters, including open and click rates, and allows you to integrate your email newsletter with other applications using its powerful API. Keila is proudly Open Source, made in Germany, and hosted in the EU, ensuring strict European privacy standards.",
    "tags": [
      "Email"
    ]
  },
  {
    "slug": "keycloak",
    "logo": "logo.png",
    "name": "Keycloak",
    "description": "Keycloak is an open-source Identity and Access Management tool that adds authentication to applications and secures services with minimal effort. It eliminates the need for storing or authenticating users, providing user federation, robust authentication, user management, and fine-grained authorization. Keycloak offers a Single-Sign On feature, allowing users to authenticate with Keycloak rather than individual applications, ensuring a seamless login experience across multiple applications. It also supports social login and can authenticate users with existing OpenID Connect or SAML 2.0 Identity Providers. Keycloak has built-in support to connect to existing LDAP or Active Directory servers and provides a centralized admin console for managing all aspects of the server. It also offers an account management console for users to manage their own accounts. Based on standard protocols, Keycloak supports OpenID Connect, OAuth 2.0, and SAML, and provides fine-grained authorization services for advanced permission management.",
    "tags": [
      "Identity and Access Management",
      "Authentication",
      "Authorization",
      "Single Sign-On",
      "User Federation",
      "Social Login",
      "Admin Console",
      "Account Management",
      "Standard Protocols",
      "Fine-Grained Authorization"
    ]
  },
  {
    "slug": "kimai",
    "logo": "logo.png",
    "name": "Kimai",
    "description": "Kimai is an open-source time-tracking solution designed for freelancers, small businesses, and enterprises to manage time-tracking needs efficiently. It enables users to track work hours, manage projects, and create accurate reports and invoices based on time entries. With a focus on simplicity and flexibility, Kimai is ideal for organizations looking to improve productivity, manage employee timesheets, and handle client billing without the complexity of traditional ERP systems. Kimai offers a modular architecture, allowing for easy customization to meet unique requirements, and it supports multi-user environments with permissions to manage data access.",
    "tags": [
      "Time Tracking",
      "Project Management",
      "Invoicing",
      "Reporting",
      "Multi-User",
      "Multi-Currency",
      "Plugins",
      "Analytics",
      "Multi-Language",
      "Secure Data Management"
    ]
  },
  {
    "slug": "komga",
    "logo": "logo.svg",
    "name": "Komga",
    "description": "Komga is a free and open source comics/mangas server that provides an intuitive platform for comic and manga enthusiasts. It allows you to browse libraries, series, and books via a responsive web UI that is compatible with desktops, tablets, and phones. With Komga, you can easily organize your library with collections and read lists, and edit metadata for your series and books. The app also has the ability to import embedded metadata automatically. It features a web reader with multiple reading modes and allows you to manage multiple users with per-library access control, age restrictions, and labels restrictions. Additionally, Komga offers a REST API for interaction with other tools and scripts, and provides features for downloading book files, whole series, or read lists. It also has a duplicate files detection system and can import books from outside your libraries directly into your series folder. Komga also supports the import of ComicRack cbl read lists.",
    "tags": [
      "Media"
    ]
  },
  {
    "slug": "kopia",
    "logo": "logo.svg",
    "name": "Kopia",
    "description": "Kopia is a robust open-source backup and restore tool designed to provide fast and secure backups of your important data. It allows you to create encrypted snapshots of your files and directories, which can be stored on the cloud storage of your choice, network-attached storage, server, or locally on your machine. Kopia supports a wide range of storage locations including Amazon S3, Azure Blob Storage, Backblaze B2, Google Cloud Storage, and many more. It also supports both CLI and GUI versions, making it accessible for both advanced and regular users. Kopia's unique features include compression, deduplication, end-to-end 'zero knowledge' encryption, and error correction, ensuring your data is safe, secure, and easily retrievable.",
    "tags": [
      "Backup",
      "Data Management",
      "Security"
    ]
  },
  {
    "slug": "kutt",
    "logo": "logo.png",
    "name": "Kutt",
    "description": "Kutt is a free and open-source app designed to make your links shorter and more manageable. With Kutt, you can create, protect, and delete your links, and monitor them with detailed statistics. You can also set custom domains for your links, adding a personal touch to your URLs. The app also provides an API, allowing you to create, delete, and get URLs from anywhere. Kutt also offers browser extensions for Chrome and Firefox for easy access and use. The app is completely open source and free, giving you the freedom to host it on your own server if you wish.",
    "tags": [
      "URL Shortener",
      "Link Management",
      "Analytics"
    ]
  },
  {
    "slug": "langflow",
    "logo": "logo.png",
    "name": "Langflow",
    "description": "Langflow is an innovative application designed to facilitate the experimentation and prototyping of LangChain pipelines. It provides a user-friendly interface for creating flows by simply dragging and connecting LangChain components such as LLMs, prompt serializers, agents, and chains. You can easily modify prompt parameters, link chains and agents, track an agent's thought process, and export your flow. Once your flow is ready, you can export it as a JSON file for use with LangChain. Langflow also integrates with langchain-serve for one-command deployment to Jina AI Cloud. With Langflow, building and deploying LangChain pipelines has never been easier.",
    "tags": [
      "Data Science",
      "Developer Tools"
    ]
  },
  {
    "slug": "languagetool",
    "logo": "logo.svg",
    "name": "Languagetool",
    "description": "LanguageTool is your personal writing assistant, designed to enhance your writing skills and ensure error-free communication. This multilingual app offers a comprehensive spelling, style, and grammar checker, capable of correcting or paraphrasing texts in a variety of languages. It integrates seamlessly with various platforms including browsers like Chrome, Edge, Firefox, Safari, Opera, and email platforms like Gmail and Outlook. It also works with office plugins such as Google Docs, Word, OpenOffice, and LibreOffice. LanguageTool is equipped with an AI-based style and grammar checker trusted by renowned organizations worldwide. It offers a distraction-free writing experience, a personal dictionary, and quality scoring for evaluating style and grammar. The app also features a 'Picky Mode' for advanced punctuation, style, and typography suggestions. LanguageTool is not just about correcting mistakes, it also helps improve your writing style by detecting overused phrases, foreign terms, redundant words, and improper word choice. It even assists in paraphrasing sentences to make them more formal, fluent, simple or concise. LanguageTool is the perfect tool for anyone who wants to deliver clear, precise, and stylistically correct writing.",
    "tags": [
      "Productivity",
      "Writing",
      "Grammar Checker"
    ]
  },
  {
    "slug": "lavalink",
    "logo": "logo.png",
    "name": "Lavalink",
    "description": "Lavalink is a standalone audio sending node designed to facilitate the process of sending audio without it ever reaching any of your shards. It is powered by Lavaplayer and Koe, and is currently being used in production by several popular bots. The app offers a range of features including Twitch/YouTube stream support, an event system, seeking, volume control, and a REST API for resolving Lavaplayer tracks and controlling players. It also provides statistics which are useful for load balancing. Lavalink is designed to have a minimal CPU/memory footprint, and it supports plugins. It is compatible with Java 17 LTS or newer, and it follows Semantic Versioning.",
    "tags": [
      "Developer Tools",
      "Media",
      "Music"
    ]
  },
  {
    "slug": "lenpaste",
    "logo": null,
    "name": "Lenpaste",
    "description": "Lenpaste is a web service that allows you to share notes anonymously. It is an open-source alternative to pastebin.com. The app supports multiple languages and uses cookies only to store settings. It can work without JavaScript and has its own API. Lenpaste allows you to set maximum length for the paste title and body, maximum lifetime of the paste, and rate limits for viewing and creating pastes. It also provides options to prohibit search engine crawlers from indexing the site and to set information about the server admin. Lenpaste is self-hosted and provides a list of public servers managed by various contributors.",
    "tags": [
      "Code Hosting",
      "Documents",
      "Notes"
    ]
  },
  {
    "slug": "libreoffice",
    "logo": "logo.png",
    "name": "LibreOffice",
    "description": "LibreOffice is a free and powerful office suite app that serves as a successor to OpenOffice.org. It features a clean interface and feature-rich tools that help you unleash your creativity and enhance your productivity. The app can be accessed at http://yourhost:3000/ or https://yourhost:3001/. It is designed to deliver a true lossless image at a high framerate to your web browser. The app also supports multiple architectures, ensuring that it can be used on a variety of platforms. This app is perfect for those who need a comprehensive office suite for their daily tasks.",
    "tags": [
      "Productivity",
      "Documents",
      "Office Suite"
    ]
  },
  {
    "slug": "libretranslate",
    "logo": "logo.png",
    "name": "LibreTranslate",
    "description": "LibreTranslate is a free and open-source machine translation app that is entirely self-hosted. Unlike other translation apps, it does not rely on proprietary providers such as Google or Azure to perform translations. Instead, its translation engine is powered by the open-source Argos Translate library. LibreTranslate can translate text between different languages, auto-detect the language of the input text, and even handle HTML content. It provides a simple and intuitive interface for users to input the text they want to translate, select the source and target languages, and get the translated text. With LibreTranslate, you can enjoy a reliable, accurate, and privacy-friendly translation service right at your fingertips.",
    "tags": [
      "Translation",
      "API",
      "Open Source"
    ]
  },
  {
    "slug": "lidarr",
    "logo": "logo.png",
    "name": "Lidarr",
    "description": "Lidarr is an audio collection manager designed for Usenet and BitTorrent users. It monitors multiple RSS feeds for new music and interfaces with clients and indexers to grab, sort, and rename albums and songs. Lidarr also has the capability to automatically upgrade the quality of existing tracks in your library when a better quality format becomes available. The app features a calendar to see all your upcoming releases in one place, manual search to find all the releases and choose the ones you want, and automatic handling of failed downloads. Lidarr ensures you get the right release every time with its custom formats feature, which allows fine control over release prioritization and selection. It also supports major platforms like Windows, Linux, macOS, and others.",
    "tags": [
      "Media",
      "Download Manager",
      "Music"
    ]
  },
  {
    "slug": "limesurvey",
    "logo": "logo.png",
    "name": "Limesurvey",
    "description": "Welcome to LimeSurvey, the world's #1 survey platform designed to provide you with the best online survey tool that's fresh, quick, and anonymous. Whether you're a student, professional, or enterprise, LimeSurvey allows you to design a survey and gather insightful data, all for free. With LimeSurvey, you can create a simple questionnaire or poll, or even a sophisticated survey with complex validation rules, conditional logic, and quota management. It's the perfect alternative to Google Forms or Doodle. LimeSurvey is also the optimal online survey tool for research institutes, universities, and other educational establishments, offering free surveys, polls, and other open-source possibilities. With easy-to-use templates and an on-hand customer service team, LimeSurvey is your go-to solution for all your survey needs.",
    "tags": [
      "Analytics",
      "Business Apps",
      "Educational"
    ]
  },
  {
    "slug": "linkding",
    "logo": "logo.png",
    "name": "linkding",
    "description": "Linkding is a self-hosted bookmark manager that allows you to efficiently manage and organize your bookmarks. With a clean and optimized user interface, you can easily add, share, and edit bookmarks. The app also allows you to add notes to your bookmarks using Markdown and provides a 'read it later' functionality. It automatically generates titles, descriptions, and icons for your bookmarked websites and creates snapshots of them on the Internet Archive Wayback Machine. You can also import and export bookmarks in Netscape HTML format. The app offers light and dark themes for your convenience. It also provides a REST API for developing third-party apps and an admin panel for user self-service and raw data access.",
    "tags": [
      "Bookmarks",
      "Productivity"
    ]
  },
  {
    "slug": "linkstack",
    "logo": "logo.svg",
    "name": "LinkStack",
    "description": "LinkStack is a powerful open-source alternative to Linktree, designed to provide an efficient solution for managing and sharing links online. It offers a highly customizable link sharing platform with an intuitive, user-friendly interface. Unlike other link management platforms, LinkStack allows users to host their links on their own web server or web hosting provider, giving them complete control over their online presence. This makes LinkStack an ideal solution for businesses and organizations looking to manage multiple links. With LinkStack, users can easily link to their own custom page and provide their followers with access to all the links they need in one convenient location. LinkStack also offers a self-hosted option for users who want complete control over their data without having it sold to third-party companies. The platform can be easily implemented through a simple drag and drop process, eliminating the need for complex terminal commands or source code manipulation. LinkStack is committed to providing a free, privacy-focused solution for managing and sharing links online, without sacrificing user privacy and control over their data.",
    "tags": [
      "Link Management",
      "Customizable",
      "Privacy-Focused"
    ]
  },
  {
    "slug": "listmonk",
    "logo": "logo.png",
    "name": "Listmonk",
    "description": "Listmonk is a self-hosted, high-performance mailing list and newsletter manager. It is designed to manage millions of subscribers across various single and double opt-in lists, with custom JSON attributes for each subscriber. The app allows you to query and segment subscribers with SQL expressions and offers a fast bulk importer for easy integration with external CRMs and subscriber databases. Listmonk also provides a simple API for sending transactional messages to subscribers using pre-defined templates. These messages can be sent via email, SMS, Whatsapp, or any medium via Messenger interfaces. The app also includes simple analytics and visualization tools, a powerful templating system for creating dynamic email templates, and a media manager for uploading images for email campaigns. Listmonk is free, open-source, and designed for high performance, with a single binary application that runs everywhere with a minimal CPU and memory footprint.",
    "tags": [
      "Email",
      "Analytics",
      "Privacy"
    ]
  },
  {
    "slug": "logseq",
    "logo": "logo.png",
    "name": "Logseq",
    "description": "Logseq is a powerful tool designed to enhance your note-taking and task management experience. It allows you to connect your notes, increasing your understanding and productivity. With features like PDF Annotations, Flashcards, and Whiteboards, it caters to a wide range of users including students, academics, writers, project managers, and developers. Logseq helps you capture, structure, and review your class notes with ease using the Linked References, Queries, and Search features. It also aids in memorizing facts and insights using the Flashcards feature. You can organize your thoughts and ideas, and quickly turn them into outlines using Block References. The app also offers tips and tricks to improve your note-taking skills, whether you're a beginner, intermediate, or expert. With Logseq, you can create your own processes, generate tables of relevant information, and always find what you're looking for. It also helps you stay on top of your relationships, conversations, and meetings, making it a safe space for your thoughts. Logseq is designed to store your interests, questions, ideas, favorite quotes, reminders, reading and meeting notes easily and future-proof. It also offers real-time, encrypted file syncing so you'll always have your notes backed up and securely available on any device. The Whiteboards feature provides a new canvas for your thoughts, allowing you to connect, associate and understand in new ways.",
    "tags": [
      "Notes",
      "Productivity"
    ]
  },
  {
    "slug": "logto",
    "logo": "logo.png",
    "name": "Logto",
    "description": "Logto is an Auth0 alternative designed for modern apps and SaaS products. It offers a seamless developer experience and is well-suited for individuals and growing companies.",
    "tags": [
      "Identity Management"
    ]
  },
  {
    "slug": "lychee",
    "logo": null,
    "name": "Lychee",
    "description": "Lychee is a free, self-hosted photo-management tool designed to make managing your photos a breeze. It allows you to upload, move, rename, describe, delete, and search your photos all in one place, right from your browser. With Lychee, you can easily share your photos and albums with just one click, and even protect them with passwords for added security. The app also allows you to view your images in full-screen mode, navigate using your keyboard, and make your photos public for others to enjoy. Lychee supports batch editing with desktop-like multi-select and displays your EXIF and IPTC Metadata. You can import your photos from various sources, tag them, or mark them as important. Lychee is designed with a beautiful, intuitive interface and is perfect for photographers as it offers unlimited storage, no compression, and no loss in data.",
    "tags": [
      "Gallery",
      "Photo Management",
      "Self-hosted"
    ]
  },
  {
    "slug": "lynx",
    "logo": "logo.png",
    "name": "Lynx",
    "description": "Lynx is a robust URL shortener application designed to simplify and streamline your web browsing experience. Built using the MEVN stack, Lynx offers a user-friendly interface and the ability to redirect the root path for a more personalized touch. The app also features a unique admin interface, providing you with full control over your shortened URLs. With Lynx, you can easily manage and customize your links, each of which includes a slug, destination, and id. The app also supports multiple users, integrates with ShareX, and offers two-factor authentication for enhanced security. Lynx is the sleek, powerful URL shortener you've been looking for.",
    "tags": [
      "URL Shortener",
      "Web Tools"
    ]
  },
  {
    "slug": "mailcrab",
    "logo": "logo.svg",
    "name": "MailCrab",
    "description": "MailCrab is an email test server designed for development purposes. It is an accept-all SMTP server that provides a web interface for viewing and inspecting all incoming emails. You can view formatted mail, download attachments, view headers, or view the complete raw mail contents. The app runs on all amd64 and arm64 platforms using docker. The backend server and the frontend of the app are both written in Rust. The backend receives email over an unencrypted connection on a configurable port, and all email is stored in memory while the application is running. The frontend initially performs a call to receive all existing email metadata and then subscribes for new messages using the websocket connection. When opening a message, the endpoint is used to retrieve the complete message body and raw email. The backend also accepts a few commands over the websocket, to mark a message as opened, to delete a single message or delete all messages.",
    "tags": [
      "Email"
    ]
  },
  {
    "slug": "mailhog",
    "logo": "logo.png",
    "name": "Mailhog",
    "description": "MailHog is an intuitive email testing tool designed for developers. It allows you to configure your application to use MailHog for SMTP delivery, enabling you to view your outgoing emails in a user-friendly web UI. The app also offers the option to release messages to real SMTP servers for delivery. With MailHog, you can view messages in the web UI or retrieve them using the JSON API. It supports SMTP AUTH and PIPELINING, and provides real-time updates using EventSource. MailHog also includes a Chaos Monkey for failure testing and HTTP basic authentication for its UI and API. It's lightweight, portable, and requires no installation.",
    "tags": [
      "Email"
    ]
  },
  {
    "slug": "mastodon",
    "logo": "logo.svg",
    "name": "Mastodon",
    "description": "Mastodon is a unique social networking app that puts control back in your hands. It allows you to curate your own home feed, free from algorithms or ads, ensuring you see only what matters most to you. The app supports a wide range of content types, including audio, video, and picture posts, polls, content warnings, and more, enabling you to express yourself freely online. Mastodon is decentralized and open-source, meaning each server is a completely independent entity, yet able to interoperate with others to form a global social network. The app respects your agency, never serving ads or pushing profiles, and is built on open web protocols, allowing it to interact with any other platform that implements ActivityPub. With Mastodon, you have the power to manage your audience, moderate content, and create a social media experience that truly reflects you.",
    "tags": [
      "Social Networking"
    ]
  },
  {
    "slug": "matomo",
    "logo": "logo.png",
    "name": "Matomo",
    "description": "Matomo is a powerful web analytics platform that allows you to take full control of your data. As a leading global web analytics solution, it is trusted on over 1 million websites across more than 190 countries. Matomo provides an ethical alternative to other analytics platforms, ensuring the protection of your data and your customers' privacy. With Matomo, you have 100% data ownership, meaning you know exactly where your data is stored and what's happening to it. The platform offers a comprehensive range of features that provide actionable insights and a complete picture of your customers. It allows you to securely track personal data in accordance with privacy laws, and offers 100% accurate reporting for impactful decision-making. Matomo can be customised and extended to meet your every need, and it comes with no data limitations, allowing for an unlimited number of websites, users, and segments.",
    "tags": [
      "Analytics"
    ]
  },
  {
    "slug": "matrix-synapse",
    "logo": "logo.svg",
    "name": "Matrix Synapse",
    "description": "Matrix is an open network designed for secure, decentralised communication. This app allows you to chat with friends, family, communities, and co-workers, providing a cozy, safe, and supercharged environment for your conversations. You can reclaim your space and build advanced, rich communication applications on top of Matrix. The app is part of a rich ecosystem that includes clients, servers, bots, and application services. It's an open-source project, generously hosted by UpCloud. With Matrix, you can start a conversation, build apps, and explore the vast possibilities of a decentralised communication network.",
    "tags": [
      "Chat",
      "Communication",
      "Social Networking"
    ]
  },
  {
    "slug": "mattermost",
    "logo": "logo.png",
    "name": "Mattermost",
    "description": "Mattermost is a secure collaboration platform designed to enhance the efficiency and productivity of technical and operational teams. It offers a range of features including team messaging, custom integrations, audio and screen sharing, and workflow automation. Mattermost is designed to improve time to response by 90%, decrease incident resolution time, and increase information availability by executing complex workflows faster and at a higher quality. It also helps in avoiding costly outages and downtime by decreasing the frequency and severity of system failures. The platform is built for enterprise scalability and can be deployed in air gapped networks and BYOD environments. It is also cloud neutral and offers self-host deployment options. Mattermost is open source and can be customized to fit your workflow with robust integrations or by building your own with its App Framework, Plugins, and open APIs.",
    "tags": [
      "Chat",
      "Collaboration",
      "Security"
    ]
  },
  {
    "slug": "mautic",
    "logo": "logo.svg",
    "name": "Mautic",
    "description": "Mautic is a powerful marketing automation platform designed to revolutionize the way businesses engage with their audience. Offering a comprehensive suite of features, Mautic enables marketers to automate and optimize their marketing strategies. The platform excels in open-source flexibility, allowing users to customize and extend its capabilities according to their unique needs. With a focus on lead tracking and nurturing, Mautic provides valuable insights into user behavior, enabling personalized and targeted campaigns for effective customer acquisition and retention. Its multi-channel marketing support ensures seamless engagement across various platforms, from email campaigns to social media interactions. Mautic's robust campaign management tools, email marketing module, analytics, and reporting features contribute to a data-driven approach, empowering marketers to refine their strategies and achieve optimal return on investment. Integration capabilities further enhance its functionality, ensuring a connected marketing ecosystem. Whether you're a marketing professional or a business owner, Mautic serves as a centralized solution to elevate and streamline your marketing efforts, fostering innovation and success.",
    "tags": [
      "Marketing Automation",
      "Open Source",
      "Lead Nurturing",
      "Multi-Channel Marketing"
    ]
  },
  {
    "slug": "mautic5",
    "logo": "logo.png",
    "name": "Mautic 5",
    "description": "Mautic 5 is an open-source, comprehensive marketing automation platform that empowers businesses to manage and optimize customer engagement strategies. It enables marketers to streamline their workflows by automating marketing tasks such as email campaigns, SMS messaging, social media outreach, and lead generation. Mautic 5 offers detailed analytics, campaign tracking, and personalized communication, ensuring an efficient marketing strategy for businesses of all sizes. With its intuitive interface and powerful features, Mautic 5 helps businesses maximize customer engagement while reducing manual effort.",
    "tags": [
      "Marketing",
      "Automation",
      "Open-Source"
    ]
  },
  {
    "slug": "maybe-finance",
    "logo": "logo.png",
    "name": "Maybe Finance",
    "description": "Maybe Finance is a modern, self-hosted finance management tool designed for tracking personal or business finances efficiently. It provides a clean and user-friendly interface, supports integrations for extended functionality, and offers detailed analytics for insights into your financial data. With Maybe Finance, you can take control of your finances, track expenses, and make informed decisions.",
    "tags": [
      "Finance Management",
      "Self-Hosted",
      "Analytics",
      "Budgeting"
    ]
  },
  {
    "slug": "mcaptcha",
    "logo": "logo.png",
    "name": "mCaptcha",
    "description": "mCaptcha is a proof-of-work based captcha system that prioritizes user privacy and offers a fully automated experience. Unlike traditional captcha systems, mCaptcha does not track or profile users, ensuring a privacy-focused user experience. It is designed to be robust and accurate, not relying on IP addresses for rate-limiting, making it suitable for users behind NATs. The user experience is silent and seamless, eliminating the need for annoying image-based captchas. mCaptcha uses a proof-of-work solution to fiercely defend your site, making it more expensive for attackers to target your site than for you to respond to their requests. It is a libre software, with client libraries licensed under proprietary-friendly free software licenses. mCaptcha is also compatible with reCAPTCHA and hCaptcha, making it a convenient drop-in replacement. The core functionality of mCaptcha is to use a SHA256 based proof-of-work system to rate limit users, providing a token upon successful validation that users can then submit with their request or form submission to the target website.",
    "tags": [
      "Privacy",
      "Security",
      "CAPTCHA"
    ]
  },
  {
    "slug": "mealie",
    "logo": "logo.png",
    "name": "Mealie",
    "description": "Mealie is a self-hosted recipe manager and meal planner designed to provide a pleasant user experience for the whole family. It features a RestAPI backend and a reactive frontend application built in Vue. With Mealie, you can quickly and easily import recipes from various websites using the built-in recipe scraper. The app ensures the safety of your data with automatic backups in any format supported by Jinja2 templates. It offers a rich and intuitive user interface that allows you to create, edit, and delete recipes with ease. The recipe editor supports markdown syntax for added convenience. Mealie also enables you to create meal plans for the week, month, or year. You can add new users, sort them into groups to share recipes and meal plans, and schedule webhooks to send notifications to 3rd party services with today's meal plan data. The open API gives you full control of the backend server with interactive documentation.",
    "tags": [
      "Food & Drink",
      "Recipe Manager",
      "Meal Planner"
    ]
  },
  {
    "slug": "mediawiki",
    "logo": "logo.png",
    "name": "MediaWiki",
    "description": "MediaWiki is a powerful, open-source wiki platform that powers some of the largest collaborative projects, including Wikipedia. It offers a flexible and extensible framework for creating and managing content, supporting features like user management, version control, and powerful extensions. MediaWiki provides multilingual support, ensuring global accessibility, and includes built-in tools for content organization, search, and collaboration. It is an ideal solution for knowledge bases, documentation sites, and community-driven content platforms. With a vibrant ecosystem of plugins and themes, MediaWiki can be customized to suit diverse use cases.",
    "tags": [
      "Wiki",
      "Collaboration",
      "Content Management",
      "CMS"
    ]
  },
  {
    "slug": "meilisearch",
    "logo": "logo.svg",
    "name": "Meilisearch",
    "description": "Meilisearch Cloud is a next-generation, open-source search engine designed to enhance your search experience. This powerful tool can be effortlessly integrated into any website or application, providing lightning-fast, hyper-relevant search results in less than 50 milliseconds. With Meilisearch, you can deploy a user-focused search experience in just a few minutes, thanks to its smart presets that require zero configuration. It offers the most advanced full-text search engine with great relevancy that fits every use case. Meilisearch supports all languages and automatically detects them, allowing for a truly global search experience. It also allows for custom relevancy, enabling you to create your own ranking rules. Meilisearch ensures secure searches with API keys and tenant tokens, and even allows for real-world geo searches. With Meilisearch Cloud, you can enhance your user's search experience with custom filters and build a faceted search interface in just a few lines of code.",
    "tags": [
      "Developer Tools",
      "Search Engine"
    ]
  },
  {
    "slug": "memos",
    "logo": "logo.png",
    "name": "Memos",
    "description": "Memos is a privacy-first, lightweight note-taking service designed to easily capture and share your great thoughts. With its focus on privacy, all data generated is saved in the SQLite database file, ensuring that you keep your own data by yourself. The app supports plain text with markdown, allowing you to save all content as plain text, not HTML, while also supporting a variety of useful markdown syntax. Despite being lightweight, Memos is powerful, utilizing a Go + React.js + SQLite architecture. The app is customizable, allowing you to modify the server name, icon, description, system style, and execution script. Memos is open source and free forever, embodying the belief that open source is the future. It offers a RESTful API for third-party services, enabling integration and new possibilities. With Memos, you can embrace a future where creativity knows no boundaries.",
    "tags": [
      "Notes",
      "Privacy"
    ]
  },
  {
    "slug": "metabase",
    "logo": "logo.svg",
    "name": "Metabase",
    "description": "Metabase is a powerful, user-friendly application designed to enable your company to explore data independently. It offers fast analytics with integrated tooling and a friendly user interface. With Metabase, you can go from zero to dashboard in just 2 minutes, allowing you to connect directly to over 20+ data sources, from your startup’s production database to massive data warehouses, and query immediately without extracts. The application is trusted by over 50,000 companies and is accessible to all, with a range of plans from free open-source to pay-as-you-go Pro and Enterprise. Metabase allows you to create and share interactive dashboards, craft metadata-rich models, and free your data from the confines of SQL with a Visual Query Builder. It is designed to make self-service analytics a reality, providing a simple yet powerful tool for data exploration and dashboarding.",
    "tags": [
      "Analytics",
      "Business Apps"
    ]
  },
  {
    "slug": "metube",
    "logo": "logo.svg",
    "name": "MeTube",
    "description": "MeTube is a web-based application that provides a user-friendly interface for the popular command-line tool, youtube-dl. It allows you to easily download videos from YouTube and dozens of other sites, right from your browser. The app supports playlist downloads, making it easy to grab an entire series of videos at once. It also offers a range of configuration options, allowing you to customize the download process to suit your needs. For instance, you can choose to save your downloads to a specific directory, separate audio-only downloads from video downloads, and even specify the filename template for your downloaded videos. MeTube also supports dark mode for a more comfortable viewing experience. The app runs in a Docker container, making it easy to deploy on any system that supports Docker.",
    "tags": [
      "Media",
      "Video Downloader",
      "Web GUI"
    ]
  },
  {
    "slug": "minecraft-server-bedrock",
    "logo": "logo.svg",
    "name": "Minecraft Bedrock Server",
    "description": "The itzg/minecraft-bedrock-server app is designed to provide a seamless Minecraft Server experience for the Bedrock Edition. It automatically downloads the latest stable version of the Minecraft server at startup, ensuring you're always up-to-date with the game's latest features and improvements. The app also allows you to run or upgrade to any specific version or the latest snapshot, giving you full control over your gaming experience. If you're using Minecraft clients on consoles, mobile, or native Windows, the app offers a dedicated Bedrock Server for optimal performance. The standard server port, 19132, will be exposed on your host machine for easy access and gameplay.",
    "tags": [
      "Gaming",
      "Developer Tools"
    ]
  },
  {
    "slug": "minecraft-server",
    "logo": "logo.svg",
    "name": "Minecraft Server",
    "description": "The itzg/minecraft-server app is designed to provide a seamless Minecraft Server experience. It automatically downloads the latest stable version of the Minecraft server at startup, ensuring you're always up-to-date with the game's latest features and improvements. The app also allows you to run or upgrade to any specific version or the latest snapshot, giving you full control over your gaming experience. If you're using Minecraft clients on consoles, mobile, or native Windows, the app offers a dedicated Bedrock Server for optimal performance. The standard server port, 25565, will be exposed on your host machine for easy access and gameplay.",
    "tags": [
      "Gaming",
      "Developer Tools"
    ]
  },
  {
    "slug": "miniflux",
    "logo": "logo.png",
    "name": "Miniflux",
    "description": "Miniflux is a minimalist and opinionated feed reader designed to prioritize content and readability. It optimizes the page layout, fonts, and colors to ensure that they are screen-friendly. If you have feeds that display only a summary, Miniflux fetches the original article automatically. The app is designed with simplicity in mind, focusing on essential features and avoiding bloated software. It is fast and efficient, allowing you to navigate through the application using keyboard shortcuts and quickly scan your unread items with a lightweight user interface. Miniflux also respects your privacy, ensuring that no one resells your private data or tracks your usage. It automatically removes pixel trackers and does not feature any advertising or user tracking. Miniflux is a free, open-source project distributed under the permissive Apache 2.0 License.",
    "tags": [
      "RSS",
      "Privacy"
    ]
  },
  {
    "slug": "minio",
    "logo": "logo.png",
    "name": "Minio",
    "description": "Minio is an open-source, self-hosted object storage solution designed to empower users with efficient data storage and management capabilities. Prioritizing control and privacy, Minio enables individuals and organizations to build their private cloud infrastructure. With its user-friendly interface and robust features, Minio allows seamless storage and retrieval of large amounts of data while offering secure access controls.",
    "tags": []
  },
  {
    "slug": "mongo-express",
    "logo": "logo.png",
    "name": "Mongo Express",
    "description": "mongo-express is a web-based MongoDB admin interface designed with Node.js, Express, and Bootstrap3. It allows you to connect to multiple databases, view, add, delete databases, and manage collections. You can also view, add, update, and delete documents within these collections. The app supports previewing audio, video, and image assets inline in the collection view. Large or nested objects are collapsible for easy overview, and big document properties are loaded on-demand to keep the collection view fast. The app also supports GridFS, enabling you to add, get, and delete incredibly large files. It uses BSON data types in documents and is mobile responsive, thanks to Bootstrap 3. The app also supports connection and authentication to individual databases, as well as admin authentication to view all databases. It includes features for database blacklist/whitelist, custom CA, and CA validation disabling, and supports replica sets.",
    "tags": [
      "Databases",
      "Developer Tools"
    ]
  },
  {
    "slug": "monica",
    "logo": "logo.png",
    "name": "Monica",
    "description": "OfficeLife is an all-in-one tool designed to manage a company efficiently. It serves as your personal CRM, helping you organize and follow-up on your social interactions, thereby strengthening your relationships. With Monica, you can easily log and remember important details about your friends, family, and colleagues. It allows you to store everything you know about your loved ones in one place, from their work information, family details, activities you've done together, to reminders about important dates. Monica is designed for busy individuals striving to maintain a good work-life balance. It's a private space, free from ads or malicious software, where you can safely document what you know about who you love. Monica is open source, ensuring transparency and security.",
    "tags": [
      "CRM",
      "Productivity"
    ]
  },
  {
    "slug": "mstream",
    "logo": "logo.svg",
    "name": "Mstream",
    "description": "mStream is a personal music streaming server that allows you to access your music collection from anywhere. It's like having your private cloud for music. With mStream, you can sync your collection between your devices for offline access. It offers high-quality streaming for audiophiles and FLAC enthusiasts, allowing you to stream your music uncompressed. mStream respects your privacy, it does not collect statistics on your listening habits. It's also beneficial for artists as buying music directly means your money goes directly to them. The server setup is quick and it runs on any operating system. It also has mobile apps for iOS & Android and allows you to stream your music in any browser. Other features include gapless playback, Milkdrop visualizer, playlist sharing, and drag and drop file uploading. All the code for mStream is open source.",
    "tags": [
      "Media",
      "Music Streaming"
    ]
  },
  {
    "slug": "muse",
    "logo": "logo.png",
    "name": "Muse",
    "description": "Muse is a self-hosted Discord music bot designed to enhance your music experience on Discord. It's perfect for small to medium-sized groups, such as you and your friends. With Muse, you can livestream music, seek within a song or video, and even cache music locally for better performance. It also allows users to convert playlists, artists, albums, and songs from Spotify automatically. You can add custom shortcuts, and the bot supports multiple guilds. It normalizes volume across tracks for a consistent listening experience. Muse is written in TypeScript and is easily extendable. It's a loyal Packers fan and doesn't vote to skip - this is anarchy, not a democracy!",
    "tags": [
      "Music",
      "Discord",
      "Bot"
    ]
  },
  {
    "slug": "mysql-backup",
    "logo": null,
    "name": "MySQL Backup",
    "description": "The mysql-backup-s3 app is a powerful tool designed to backup your MySQL databases to your AWS S3 bucket. It supports periodic backups, allowing you to schedule backup times in cron format, ensuring your data is always safe and up-to-date. The app also supports multi-files, meaning you can have one file per database if you choose to. The app requires your AWS access key, AWS secret key, and AWS S3 bucket path. It also requires your MySQL host, user, and password. You can customize the path prefix in your bucket, the AWS S3 bucket region, and the AWS Endpoint URL. The app also allows you to add extra mysqldump options without overriding the default ones. With the mysql-backup-s3 app, you can ensure your MySQL databases are always backed up and secure in your AWS S3 bucket.",
    "tags": [
      "Databases",
      "Backup"
    ]
  },
  {
    "slug": "n8n",
    "logo": "logo.png",
    "name": "n8n",
    "description": "n8n is a powerful workflow automation tool designed for technical people. It allows you to build complex automations 10x faster, without the need to fight with APIs. The app enables you to create flexible workflows focused on deep data integration. You can use JavaScript for complex tasks that require flexibility and the user-friendly UI for everything else. n8n provides the ability to connect APIs with no code for automating basic tasks, or write vanilla Javascript for manipulating complex data. It supports integration with any app and allows for the creation of custom scenarios at speed. With n8n, you can pump data around your entire tech stack with 350+ native integrations or use custom code to create your own. It also offers features like bulk operations, painless debugging, and the ability to host on your own infrastructure. n8n is not just a helpful tool, it's the heart of your business, helping you optimize engineering resources, boost efficiency, and focus on your KPIs, not your APIs.",
    "tags": [
      "Automation",
      "Workflow",
      "Integration"
    ]
  },
  {
    "slug": "nango",
    "logo": "logo.png",
    "name": "Nango",
    "description": "Nango is a powerful app designed to simplify and accelerate the process of building integrations. It provides a unified API, allowing you to drastically simplify your integration code and avoid dealing with each external API's schema and quirks. With Nango, you can authorize any integration using our drop-in UI, and securely manage your users' credentials. The app also enables continuous data synchronization with external APIs, using one of 100+ pre-built integrations, or you can customize them or build your own. Nango also supports 2-way syncs, write-backs, and real-time webhooks. It's designed for engineering teams that want full control without the hassle, allowing you to build exactly the integration your customers need, in code. With Nango, you can leave the maintenance, scaling, and API specific quirks to us, and focus on what you do best.",
    "tags": [
      "Developer Tools",
      "Integration",
      "API"
    ]
  },
  {
    "slug": "navidrome",
    "logo": "logo.png",
    "name": "Navidrome",
    "description": "Welcome to Navidrome, your personal streaming service! This open-source software allows you to access and enjoy your music collection from anywhere, through a modern web UI and a wide range of third-party compatible mobile apps for both iOS and Android devices. Navidrome is lightweight, fast, and self-contained, capable of running well even on resource-limited platforms. It can handle large music libraries, and even transcodes your music files on the fly to prevent excessive data usage. Built with new technologies like GoLang, ReactJS, and Material-UI, Navidrome ensures modern features and compatibility. It is also compatible with the de facto standard Music API, supporting all its clients and ecosystem. With new releases on a regular basis, Navidrome continually adds features and bug fixes to enhance your music streaming experience.",
    "tags": [
      "Media",
      "Music",
      "Streaming"
    ]
  },
  {
    "slug": "netbox",
    "logo": "logo.svg",
    "name": "Netbox",
    "description": "NetBox is a comprehensive solution designed to be the single source of truth for everything on your network. It provides a detailed overview of both physical and virtual assets, including power systems, cabling, IP addresses, and VLANs. The app is designed to facilitate network automation and monitoring, drawing from an authoritative plan to push out configurations and monitor changes across the enterprise. It offers a complete DCIM solution, providing visibility and control across the entire enterprise. NetBox also features efficient IP Address Management, ensuring the safe and efficient management of IP assets across the enterprise, thereby minimizing the risk of data entry errors. The app is customizable and can be integrated to extend its functionality to fit your specific needs.",
    "tags": [
      "Network Tools",
      "Documentation"
    ]
  },
  {
    "slug": "nextcloud",
    "logo": "logo.png",
    "name": "Nextcloud",
    "description": "Nextcloud Hub 5 is a comprehensive platform that integrates the four key Nextcloud products: Files, Talk, Groupware, and Office. It is designed to optimize the flow of collaboration, providing a seamless experience for users. Nextcloud Files offers an on-premise Universal File Access and sync platform with powerful collaboration capabilities and interfaces for desktop, mobile, and web. The platform ensures no data leaks to third parties, providing you with full control over your data. It is customizable, scalable, and can be deployed on-premises or in the cloud. Nextcloud is committed to providing technology that fits perfectly with your organization, whether it's a government entity, enterprise, service provider, or educational institution. It is the most popular self-hosted collaboration solution, used by tens of millions of users at thousands of organizations across the globe.",
    "tags": [
      "File Management",
      "Collaboration",
      "Data Control"
    ]
  },
  {
    "slug": "nocobase",
    "logo": "logo.png",
    "name": "Nocobase",
    "description": "NocoBase is an open-source, no-code development platform designed with scalability in mind. It allows you to build your own collaboration platform or management system without any programming required. With NocoBase, you can create independent data models using a variety of field types and association relationships. The platform also provides a free combination of block types for displaying and manipulating data within a page. It supports various operations to process data, including filtering, exporting, adding, deleting, modifying, and viewing. NocoBase also features role-based control of user's system configuration rights, data action rights, and menu access rights. It replaces repetitive tasks with automation to increase efficiency and requires manual approval for important matters. NocoBase is built for extended development with a microkernel architecture that is flexible and easy to extend. It is Node.js-based and uses popular frameworks and technologies.",
    "tags": [
      "No-Code",
      "Business Apps",
      "Data Management"
    ]
  },
  {
    "slug": "nocodb",
    "logo": "logo.png",
    "name": "NocoDB",
    "description": "NocoDB is an innovative open-source platform that transforms any database into a smart spreadsheet. It's a powerful alternative to Airtable, designed to be flexible and user-friendly. With NocoDB, you can create unlimited grid views, gallery views, and form views from your own data. It offers ultra-ease in searching, sorting, and filtering columns and rows. You can invite your team with fine-grained access control, share views publicly or with password protection. NocoDB also allows you to build automations with your favourite apps like Microsoft Teams, Slack, Discord, Whatsapp, Twilio, Email & SMS. It provides instant REST APIs with Swagger. NocoDB is trusted by over 2000 organizations worldwide and is the fastest growing open source project. It's free and self-hostable, offering endless solutions for your business workflows.",
    "tags": [
      "No-Code",
      "Databases"
    ]
  },
  {
    "slug": "nodebb",
    "logo": "logo.png",
    "name": "NodeBB",
    "description": "NodeBB is a next-generation forum software that is powerful, mobile-ready, and easy to use. It is designed to provide a modern platform for your audience, fostering engagement and retaining customers. With NodeBB, you can enjoy a perfect experience on every device and screen, thanks to its mobile-first software. It offers built-in localization support with over 50 languages actively translated, making it a truly global platform. NodeBB is also search optimized with human-readable URLs, semantic HTML with embedded microdata, and more. It allows for social media integration, bringing more visitors to your community by sharing content to Facebook, Google, and Twitter. NodeBB also offers real-time interaction with instant notifications, streaming posts, and real-time chats. It comes with a native analytics dashboard so you can know what content your users enjoy most. Whether you're a self-starter, a growing business, or a large corporation, NodeBB has a plan that works best for you.",
    "tags": [
      "Forums",
      "Communication",
      "Mobile-first",
      "Real-time",
      "Analytics"
    ]
  },
  {
    "slug": "nodered",
    "logo": "logo.png",
    "name": "Node-RED",
    "description": "Node-RED is a unique programming tool designed for creating event-driven applications in a low-code environment. It allows you to connect hardware devices, APIs, and online services in innovative ways. The app features a browser-based editor that simplifies the process of creating flows using a wide array of nodes available in the palette. These flows can be deployed to its runtime with just a single click. Node-RED also allows you to create JavaScript functions within the editor using a rich text editor and save useful functions, templates, or flows for future use. Built on Node.js, Node-RED is lightweight and can run on low-cost hardware like Raspberry Pi or in the cloud. It also supports the import and export of flows in JSON format for easy sharing.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "ntfy",
    "logo": "logo.png",
    "name": "Ntfy",
    "description": "ntfy, pronounced as 'notify', is a simple, HTTP-based pub-sub notification service that allows you to send push notifications to your phone or desktop from any computer. It operates via scripts using simple HTTP PUT or POST requests. This makes it a handy tool for notifying yourself when scripts fail or when long-running commands complete. To use ntfy, you simply need to install the app on your phone, subscribe to a topic of your choice, and start sending messages to your topic. The app is available on Google Play, F-Droid, and the App Store. ntfy is open-source and free to use, but also offers paid plans for those who wish to support its development.",
    "tags": [
      "Notifications",
      "Push Notifications",
      "Mobile Notifications",
      "Desktop Notifications"
    ]
  },
  {
    "slug": "nzbget",
    "logo": "logo.png",
    "name": "Nzbget",
    "description": "NZBGet is an efficient Usenet downloader that is open source and hosted on GitHub. This powerful tool is designed to download files from Usenet based on information provided in nzb-files. Known for its performance and efficiency, NZBGet is written in C++ and can run on almost any device, including classic PCs, NAS, media players, SAT-receivers, WLAN-routers, and more. It provides precompiled binaries for Windows, macOS, Linux, FreeBSD, and Android. The app also offers features like RSS and duplicate check for automating your downloads, VideoSort for sorting downloaded video files, and various scripts for enhancing functionality. With NZBGet, you can maximize your device's performance and improve your downloading experience.",
    "tags": [
      "Download",
      "Usenet",
      "Downloader"
    ]
  },
  {
    "slug": "octobox",
    "logo": "logo.png",
    "name": "Octobox",
    "description": "Octobox is an innovative app designed to help you manage your GitHub notifications more efficiently. With Octobox, you no longer have to worry about losing track of important issues or waking up to hundreds of notifications. The app adds an extra 'archived' state to each notification, allowing you to mark it as 'done'. If there's any activity on an archived thread, issue or PR, Octobox will move it back into your inbox. You can also search and filter notifications by repository, organization, type, action, state, CI status, and reason. Octobox keeps your notifications up to date with issue/pull-request status, CI status, labels, and more. The app is free for open source projects and offers enhanced notifications for private projects at a cost. Octobox is the perfect tool for developers who want to stay organized and focused.",
    "tags": [
      "Developer Tools",
      "Code Hosting"
    ]
  },
  {
    "slug": "octoprint",
    "logo": "logo.svg",
    "name": "OctoPrint",
    "description": "OctoPrint is a comprehensive web interface designed to provide full remote control and monitoring of your 3D printer. It allows you to manage every aspect of your 3D printing jobs directly from your browser. With OctoPrint, you can access the embedded webcam feed to watch your printer in action, receive constant feedback on the progress of your print job, and even view a rendition of the GCODE you are currently printing. The app also enables you to monitor and adjust the temperatures of your hotends and print bed on the fly, move the print head along all axes, and start, stop, or pause your print job at any time. OctoPrint is compatible with most consumer 3D printers and its powerful plugin system allows for functionality extension. It is 100% open source, allowing everyone to modify it to their own needs. Additional features include creating timelapse recordings of your prints, slicing your STL files directly within the app, built-in access controls, and the ability to add system commands to the menu for easy shutdown or reboot of your OctoPrint server or printer.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "odoo",
    "logo": "logo.png",
    "name": "Odoo",
    "description": "Odoo is a comprehensive, integrated software platform designed to streamline and automate your business operations. It offers a suite of open-source business applications that cover all your company needs, from sales and services integration to operations management, website building, financial management, and marketing. Odoo's unique value proposition lies in its ease of use and full integration. The apps are designed to work seamlessly together, allowing you to automate and track everything you do in a centralized, online platform accessible from anywhere with any device. With Odoo, you can replace multiple applications with a single, cost-effective, and modular solution, eliminating the need for painful integrations and providing a comprehensive overview of your business. The platform evolves much faster than other solutions, with regular annual releases leveraging the expertise of thousands of developers and business experts. Whether you need a CRM, eCommerce, accounting, inventory, project management, or any other business application, Odoo has got you covered.",
    "tags": [
      "ERP"
    ]
  },
  {
    "slug": "ollama",
    "logo": "logo.png",
    "name": "Ollama",
    "description": "Ollama is a powerful tool designed to simplify the deployment and interaction with advanced AI models. It provides a streamlined solution for managing and hosting large language models (LLMs) with an intuitive interface. Ollama allows users to run queries and interact with models like OpenAI GPT and others in a secure and efficient manner. The tool includes a web-based interface that makes managing and testing models straightforward. Ollama is designed to support diverse use cases, from research and development to deploying AI capabilities in production systems. It offers flexible deployment options, powerful API integrations, and role-based access control to ensure secure and scalable AI solutions.",
    "tags": [
      "AI",
      "LLM",
      "Machine Learning",
      "Custom Applications"
    ]
  },
  {
    "slug": "ombi",
    "logo": "logo.png",
    "name": "Ombi",
    "description": "Ombi allows you to host your own Plex Request and user management system. If you are sharing your Plex server with other users, allow them to request new content using an easy to manage interface! Manage all your requests for Movies and TV with ease, leave notes for the user and get notification when a user requests something. Allow your users to post issues against their requests so you know there is a problem with the audio etc. Even automatically send them weekly newsletters of new content that has been added to your Plex server!",
    "tags": []
  },
  {
    "slug": "onedev",
    "logo": "logo.svg",
    "name": "OneDev",
    "description": "OneDev is a versatile app designed to streamline your project management and development processes. It offers a comprehensive suite of features including pull requests, issue tracking, and build management. With OneDev, you can easily manage your projects, track commits, and handle branches and tags. The app also provides a platform for managing pull requests, merging them, and discarding when necessary. It allows you to keep track of open and closed issues, as well as those that have been released. OneDev also offers a robust build management system, enabling you to monitor successful builds across various projects. The app is designed to support multiple projects, each with its own set of files, commits, branches, tags, pull requests, and builds. With OneDev, you can streamline your workflow, enhance collaboration, and improve productivity in your development projects.",
    "tags": [
      "Code Hosting",
      "Developer Tools",
      "CI/CD",
      "Issue Tracking"
    ]
  },
  {
    "slug": "openblocks",
    "logo": "logo.png",
    "name": "Openblocks",
    "description": "Openblocks is an open-source low code platform designed to help you build internal apps quickly and efficiently. With Openblocks, you can create admin panels, dashboards, approval queues, and client support apps with ease and speed. The platform offers over 50 built-in UI components, allowing you to build beautiful, functional, and user-friendly apps. You can also customize new components and embed them seamlessly into your apps. Openblocks connects to most databases and any REST API platform within clicks, enabling full integration of heterogeneous data from anywhere. It's a developer-first platform, allowing you to extend built-in components using JavaScript and leverage external JavaScript libraries. Openblocks also ensures security and reliability with role-based access control and audit logs. It's loved by developers for its super-polished interface and mind-blowing functionality.",
    "tags": [
      "Admin Panels",
      "Dashboards",
      "Approval Queues",
      "Client Support Apps",
      "Opportunities",
      "Possibilities"
    ]
  },
  {
    "slug": "openproject",
    "logo": "logo.svg",
    "name": "OpenProject",
    "description": "OpenProject is an open-source project management software designed to facilitate efficient project management in a secure environment. It caters to various project management styles including classic, agile, or hybrid. The software allows you to take control of your data with the highest standards in data security and privacy. OpenProject can be installed on-premises in your own infrastructure, ensuring full control and 100% data ownership. It offers a variety of security features such as https encryption of your data, password security, two-factor authentication, and more. OpenProject supports agile project management and methodologies such as Scrum and Kanban, allowing teams to deliver better and faster. It also features a team planner to visually assign tasks to team members, helping to plan activities and gain perspective on the team's workload. OpenProject is also a powerful tool for project planning and scheduling, enabling teams to collaboratively create and visualize project plans, analyze required activities, and create a detailed plan for project deliverables.",
    "tags": [
      "Project Management",
      "Open Source",
      "Data Security"
    ]
  },
  {
    "slug": "openspeedtest",
    "logo": "logo.png",
    "name": "OpenSpeedTest",
    "description": "OpenSpeedTest is a powerful and accurate online bandwidth test application that works on any web browser without the need for Flash or Java. It is designed to replicate your real-world connection speed and is capable of testing any connection, from 1 Kbps to 1 Gbps+. The application uses the latest technology to automatically detect your stable download and upload speed from our servers. It also provides a guide on how to increase your internet speed and get more out of your connection. You can create your own network speed test without any client-side software or plugin. The application can also be embedded to your website or application, allowing your users to test their internet speed without leaving your page. It is also available as a standalone application for home or small office LAN and can be used for large-scale deployments as a self-hosted/on-premise network speed test.",
    "tags": [
      "Network Tools"
    ]
  },
  {
    "slug": "opera",
    "logo": "logo.svg",
    "name": "Opera",
    "description": "Opera is a multi-platform web browser developed by Opera. This app is based on Chromium, but sets itself apart from other Chromium-based browsers through its unique user interface and additional features. The app can be accessed at http://yourhost:3000/ or https://yourhost:3001/. It provides a true lossless image at a high frame rate to your web browser by changing the Stream Quality preset to 'Lossless'. The app also allows you to specify one or multiple Chromium CLI flags, which will be passed to the application in full. This app is designed to avoid permission issues that can arise between the host OS and the container by allowing you to specify the user PUID and group PGID.",
    "tags": [
      "Web Browsers",
      "Internet",
      "Productivity"
    ]
  },
  {
    "slug": "outline",
    "logo": "logo.png",
    "name": "Outline Wiki",
    "description": "Outline is a team knowledge base and wiki that helps organize your team's information in a structured and searchable manner. It offers an intuitive editing experience with markdown support, slash commands, and rich embeds. You can collaborate on documents in real-time, with comments and threads keeping conversations organized. The platform integrates seamlessly with Slack, allowing you to search and share documents without leaving the chat. Outline also supports public sharing of documents with your own brand colors, logos, and domain. It's designed to be fast, collaborative, and easy to use, with a focus on security and permissions. It also supports multiple languages and offers integrations with tools like Figma, Loom, and more.",
    "tags": [
      "Documentation",
      "Productivity",
      "Business Apps",
      "Collaboration"
    ]
  },
  {
    "slug": "owncast",
    "logo": "logo.png",
    "name": "Owncast",
    "description": "Owncast is a free and open-source live video and web chat server that works seamlessly with your existing broadcasting software. It gives you complete control and ownership over your stream, allowing you to create the content you want. The app comes with a frictionless built-in chat feature that enables your viewers to engage and be a part of the action. You can include custom emotes and build chat bots to encourage viewer engagement. Owncast also allows your live stream to reach a wider audience on The Fediverse, including platforms like Mastodon and other Fediverse services. It's a self-hosted and independent solution for live streaming, offering a high level of performance comparable to proprietary platforms.",
    "tags": [
      "Chat",
      "Media",
      "Self-hosted"
    ]
  },
  {
    "slug": "owncloud",
    "logo": "logo.png",
    "name": "Owncloud",
    "description": "ownCloud Infinite Scale 3.0 is a secure cloud platform designed for real-time content collaboration. It is trusted by over 200 million users worldwide and offers a revolutionary project folder concept, Spaces, to boost seamless digital collaboration for remote teams of all sizes. The platform also provides a suite of powerful integrations through Web Office, including OnlyOffice, Microsoft 365, Collabora Online, and Microsoft Office Online, enabling users to collaborate seamlessly and securely from any location and device. ownCloud Infinite Scale 3.0 is designed with state-of-the-art security standards and best practices, ensuring superior data protection and privacy. It allows organizations to control their data at all times, anywhere, and can be deployed on-premises, in a data center of choice, or in a hybrid setup. The platform also supports multi-factor authentication, encryption, and elaborate file lifecycle management for enhanced security. ownCloud Infinite Scale 3.0 is designed to increase productivity by enabling modern teams to store, share, and work on their data and documents through a single point of access.",
    "tags": [
      "File Management",
      "Collaboration",
      "Data Security"
    ]
  },
  {
    "slug": "oxigen",
    "logo": "logo.svg",
    "name": "Oxigen",
    "description": "Oxigen is a dynamic social media image generator designed to streamline the process of creating and customizing og images. With a user-friendly interface and API, Oxigen allows you to effortlessly generate images tailored to your specific needs. Whether you're looking to create unique images for your social media posts or need a reliable tool for generating og images, Oxigen offers a flexible and efficient solution.",
    "tags": [
      "Social Networking",
      "Image Generator"
    ]
  },
  {
    "slug": "pairdrop",
    "logo": "logo.png",
    "name": "PairDrop",
    "description": "PairDrop is an open-source peer-to-peer file sharing application designed for seamless and secure data transfer between devices on the same network. With its minimalist design and cross-platform compatibility, PairDrop ensures a user-friendly and efficient file sharing experience. It eliminates the need for third-party cloud services, offering a direct and private solution for sharing files, links, and other data securely.",
    "tags": [
      "File Sharing",
      "Peer-to-Peer",
      "Cross-Platform",
      "Open Source"
    ]
  },
  {
    "slug": "papercups",
    "logo": "logo.svg",
    "name": "Papercups",
    "description": "Papercups is a privacy-focused, open-source app designed to streamline communication with your customers. It provides a powerful dashboard to coordinate and reply to messages over various platforms including chat, email, Slack, and SMS. The app offers a customizable widget that you can tailor to your brand's aesthetics, without the need for any coding. Papercups also integrates seamlessly with your existing work environment, eliminating the need to log in to another dashboard. It supports HTML, React, React Native, and Flutter integrations. The app is built with Elixir on top of BEAM for incredible scalability, making it a suitable choice for businesses of all sizes. It also offers personalized support, managing your deployment on your infrastructure while providing the benefits of self-hosting with the reliability and scalability of the cloud.",
    "tags": [
      "Customer Support",
      "Communication",
      "Privacy"
    ]
  },
  {
    "slug": "paperlessngx",
    "logo": "logo.png",
    "name": "Paperless-ngx",
    "description": "Paperless-ngx is a modern document management system designed to convert your physical documents into a searchable online archive, helping you maintain a clutter-free, paperless environment. It uses advanced OCR technology to add selectable text to image-only documents, and allows you to organize and index your scanned documents with tags, correspondents, types, and more. The app supports a variety of file formats including PDFs, images, plain text files, and Office documents. It also features a single-page application front end with a dashboard that displays basic statistics and allows document upload. With its full-text search functionality, you can easily find the documents you need, with results sorted by relevance to your search query. The app also includes email processing, enabling it to add documents from your email accounts. Moreover, Paperless-ngx is powered by machine learning, enabling it to learn from your documents and automatically assign tags, correspondents, and types to documents once you've stored a few documents in it. It is optimized for multi-core systems, allowing it to process multiple documents in parallel.",
    "tags": [
      "Documents",
      "Productivity"
    ]
  },
  {
    "slug": "passbolt",
    "logo": "logo.png",
    "name": "Passbolt",
    "description": "Passbolt is a security-first, open source password manager designed for teams and businesses. It is trusted by thousands of organizations worldwide, including Fortune 500 companies, defense industry, universities, startups, and many others. The app puts security first, with top penetration testers regularly assessing its software. It supports user-owned secret keys and end-to-end encryption even in complex scenarios. Passbolt is also built for collaboration, allowing organizations and teams to securely share credentials with powerful auditing tools. It offers unparalleled granularity for both access controls and encrypted data. The app is headquartered in the EU, ensuring that privacy is not only a top priority but also guaranteed by law. Passbolt can be used from your browser or mobile phone, with real-time sharing. It also supports programmatic password retrieval, storage, and sharing with its JSON API.",
    "tags": [
      "Security",
      "Password Manager",
      "Collaboration"
    ]
  },
  {
    "slug": "peertube",
    "logo": "logo.svg",
    "name": "PeerTube",
    "description": "PeerTube is a revolutionary video sharing tool developed by Framasoft, a French non-profit organization. It offers an alternative to mainstream video platforms, allowing you to establish your own video platform with complete independence. Unlike other platforms, PeerTube doesn't rely on opaque algorithms or obscure moderation policies. The platforms you visit are built, managed, and moderated by their owners. PeerTube also enables platforms to connect with each other, forming a large network of autonomous yet interconnected platforms. Importantly, PeerTube doesn't depend on advertising and doesn't track your activities. It hosts a wide variety of content, with over 600,000 videos across 1,000 platforms in the PeerTube network. PeerTube is free, open-source, and created for non-commercial purposes, ensuring that you are treated as a person, not a product. It is a tool that truly belongs to you and respects your fundamental freedoms as a user.",
    "tags": [
      "Media",
      "Video",
      "Social Networking"
    ]
  },
  {
    "slug": "penpot",
    "logo": "logo.png",
    "name": "Penpot",
    "description": "Penpot is an open-source, design and prototyping platform that empowers teams to collaborate and bring creative ideas to life. Unlike other design tools, Penpot is entirely web-based and runs on open standards, allowing teams to access it from anywhere and on any platform. Trusted by designers and developers worldwide, Penpot is known for its flexibility and integration within diverse workflows. It offers real-time collaboration, making it easy for team members to co-create, review, and provide feedback instantly. The app supports complex design requirements, from vector editing to responsive design, and prioritizes user control over projects with extensive customization options. Penpot is built by a team dedicated to privacy and security, with a strong commitment to open-source principles. It ensures that designers and developers alike have the freedom to innovate without restrictions, providing a transparent, community-driven alternative to proprietary tools.",
    "tags": [
      "Design",
      "Prototyping",
      "Collaboration",
      "Open Source"
    ]
  },
  {
    "slug": "pgvector",
    "logo": null,
    "name": "pgvector",
    "description": "pgvector is an open-source app designed to facilitate vector similarity search for Postgres. It allows you to store all your application data in one place, supporting both exact and approximate nearest neighbor search. The app is capable of handling L2 distance, inner product, and cosine distance, making it versatile for various data analysis needs. It is compatible with any language that has a Postgres client. The app also boasts of ACID compliance, point-in-time recovery, JOINs, and all the other great features of Postgres. With pgvector, you can create a new table with a vector column or add a vector column to an existing table, insert vectors, upsert vectors, update vectors, and delete vectors. It also allows you to get the nearest neighbors to a vector or a row, and get rows within a certain distance. The app also supports indexing for improved search performance. It is a powerful tool for managing and analyzing your data in a Postgres environment.",
    "tags": [
      "Databases",
      "Data Science"
    ]
  },
  {
    "slug": "pgweb",
    "logo": "logo.png",
    "name": "pgweb",
    "description": "Pgweb is a simple, web-based, cross-platform PostgreSQL database explorer. It is designed to work seamlessly on Mac, Linux, and Windows machines. The app is distributed as a single binary with zero dependencies, making it incredibly easy to use. It supports PostgreSQL 9.1 and later versions, and allows for multiple database sessions. With Pgweb, you can execute and analyze custom SQL queries, export table and query data to CSV/JSON/XML, and keep track of your query history. The app also supports native SSH tunnels and server bookmarks for easy navigation.",
    "tags": [
      "Databases"
    ]
  },
  {
    "slug": "photoprism",
    "logo": "logo.svg",
    "name": "PhotoPrism",
    "description": "PhotoPrism is an AI-powered photos app designed for the decentralized web. It uses the latest technologies to automatically tag and find pictures without interrupting your workflow. You can run it at home, on a private server, or in the cloud. PhotoPrism allows you to browse all your photos and videos without worrying about RAW conversion, duplicates, or video formats. It offers powerful search filters to easily find specific pictures and includes high-resolution world maps to relive your favorite trips. The app supports playing Live Photos by hovering over them in albums and search results, recognizes the faces of your family and friends, and automatically classifies pictures based on their content and location. PhotoPrism is committed to user and privacy-friendly solutions, ensuring your data is never shared without your consent.",
    "tags": [
      "Media",
      "Gallery",
      "Productivity"
    ]
  },
  {
    "slug": "photoview",
    "logo": "logo.svg",
    "name": "Photoview",
    "description": "Photoview is a user-friendly photo gallery designed for photographers. It allows you to easily navigate through directories filled with high-resolution photos and videos. The app syncs with your file system, automatically organizing your media based on the file structure. Directories become albums filled with the photos and videos found within them. Photoview also automatically rescans for new media, keeping your gallery updated. Multiple users can be configured, each with their own directory of photos and videos, and each user's media is kept private with a username and password. Albums and individual photos or videos can be shared through public or password-protected links. Photoview also analyzes photos for EXIF metadata, displaying this information next to the photo and using it to present photos on a map. The app also has a mobile version for iOS, allowing you to quickly access your media library from your phone. Photoview supports RAW images, automatically extracts metadata from images and videos, and optimizes videos for the web. It also generates thumbnails automatically and ensures that your media is secure and private.",
    "tags": [
      "Gallery",
      "Media",
      "Photography"
    ]
  },
  {
    "slug": "phpmyadmin",
    "logo": "logo.png",
    "name": "phpMyAdmin",
    "description": "phpMyAdmin is a free software tool designed to manage MySQL over the web. This powerful tool supports a broad spectrum of operations on MySQL and MariaDB. It allows you to perform frequently used operations such as managing databases, tables, columns, relations, indexes, users, permissions, and more through its user-friendly interface. Additionally, it provides the flexibility to directly execute any SQL statement. phpMyAdmin also features an intuitive web interface and supports most MySQL features. You can browse and drop databases, tables, views, fields, and indexes; create, copy, drop, rename, and alter databases, tables, fields, and indexes; manage MySQL user accounts and privileges; and much more. It also allows you to import data from CSV and SQL, export data to various formats, administer multiple servers, create graphics of your database layout in various formats, and create complex queries using Query-by-example (QBE).",
    "tags": [
      "Databases",
      "Developer Tools"
    ]
  },
  {
    "slug": "pidgin",
    "logo": "logo.png",
    "name": "Pidgin",
    "description": "Pidgin is a versatile chat application that allows you to log into multiple chat networks simultaneously. This means you can chat with friends on XMPP while also participating in an IRC channel. The application supports a wide range of chat networks, including but not limited to Bonjour, Discord, Facebook, Google Talk, Hangouts, ICQ, Instagram, IRC, Skype, Slack, Telegram, and XMPP. This Pidgin installation comes with default chat plugins and a series of third-party ones. The application also includes Firefox to help you fill out captchas or pre-auth before loading your credentials into the program. Pidgin can be accessed at http://yourhost:3000/ or https://yourhost:3001/. The app is designed to provide a seamless and integrated chat experience across multiple platforms.",
    "tags": [
      "Chat"
    ]
  },
  {
    "slug": "plane",
    "logo": "logo.svg",
    "name": "Plane",
    "description": "Plane is an open-source project management tool designed to help teams manage tasks, sprints, and product roadmaps efficiently. It offers features like issue tracking, cycles, modules, custom views, pages, and real-time analytics.",
    "tags": []
  },
  {
    "slug": "planka",
    "logo": "logo.png",
    "name": "Planka",
    "description": "Planka is a free, open-source Kanban board designed to streamline project management for workgroups. With Planka, you can create projects, boards, lists, cards, labels, and tasks, all in one place. It allows you to add card members, track time, set due dates, add attachments, and write comments. It also supports markdown in card descriptions and comments. The app provides real-time updates, ensuring all changes in cards or boards are instantly visible to your colleagues. You can customize your project background and filter tasks by members and labels. User notifications keep everyone in the loop about project updates. The app also supports multiple languages, making it a versatile tool for international teams.",
    "tags": [
      "Project Management"
    ]
  },
  {
    "slug": "plausible",
    "logo": "logo.png",
    "name": "Plausible",
    "description": "Plausible is a simple, lightweight, and open-source web analytics tool that serves as a privacy-friendly alternative to Google Analytics. It is designed to be intuitive and easy to use, providing essential insights about your website's traffic on a single page, without the need for complex menus or custom reports. The Plausible script is 45 times smaller than Google Analytics, ensuring your site loads faster and contributes to a greener web. It respects user privacy by not using cookies or collecting personal data, and all data processing is carried out anonymously within the EU. Plausible also allows you to track goal conversions, revenue, and campaigns, segment your audience, and analyze referral sources. You can share your stats publicly or privately, invite team members, and even import your historical stats from Google Analytics. It's a powerful tool for understanding your website's performance while respecting user privacy.",
    "tags": [
      "Analytics",
      "Privacy"
    ]
  },
  {
    "slug": "plex",
    "logo": "logo.svg",
    "name": "Plex",
    "description": "Plex Media Server is a powerful app that makes it easy to manage and stream your media collection to all your devices, anytime, anywhere. With Plex, you can stream your video, music, and photo collections from your phone, tablet, gaming console, smart TV, or any other favorite streaming device. The app is designed to work with three types of networking: bridge, host, and macvlan, each offering a unique way to connect your media server to your devices. Plex also offers advanced features like hardware transcoding support for Intel Quick Sync, making it a versatile choice for all your media streaming needs.",
    "tags": [
      "Media",
      "Streaming",
      "Video",
      "Music",
      "Photos"
    ]
  },
  {
    "slug": "ploi-roadmap",
    "logo": "logo.png",
    "name": "Ploi Roadmap",
    "description": "Roadmap is an open-source software designed to streamline your roadmapping process. It offers a completely customizable platform where you can mention users in comments, upvote items to prioritize them, and generate automatic slugs. The software also features a Filament admin panel and a simplified role system that includes administrator, employee, and user roles. Roadmap supports OAuth 2 single sign-on with your own application and automatically generates OG images, including the branding color you've set up. It also integrates with GitHub, allowing you to assign a repository to each project and manage issues directly from the roadmap admin. The software is built with PHP and requires a database to function.",
    "tags": [
      "Project Management"
    ]
  },
  {
    "slug": "pocketbase",
    "logo": "logo.svg",
    "name": "PocketBase",
    "description": "PocketBase is a powerful backend solution for your next SaaS or Mobile app. It is designed to be ready to use out of the box, providing a realtime database, user authentication, file storage, and an admin dashboard all in one file. The realtime database is embedded and performant, featuring a schema builder, data validations, realtime subscriptions, and an easy-to-use REST API. The authentication feature allows you to manage your app users and handle email/password and OAuth2 sign ups from various platforms like Google, Facebook, GitHub, GitLab without any hassle. The file storage feature allows you to store files locally or in an S3 storage, attach media to your database records, and generate thumbnails on the fly. PocketBase is extendable and can be used as a standalone app or as a Go framework, which you can extend via hooks to create your own custom portable backend. It also provides official client SDKs for seamless integration.",
    "tags": [
      "Databases",
      "Developer Tools"
    ]
  },
  {
    "slug": "portainer",
    "logo": "logo.svg",
    "name": "Portainer",
    "description": "Portainer is a powerful container management platform trusted by over a million users worldwide. It simplifies the deployment, configuration, troubleshooting, and securing of containers on Kubernetes, Docker, and Swarm across any data center, cloud, network edge, or IIOT device. Portainer is designed to accelerate container adoption and reduce deployment times, making it easier for teams with little to no knowledge of Kubernetes to work autonomously. It also aids in managing and updating deployments, setting up, maintaining, and troubleshooting container infrastructure, and ensuring security and compliance. Portainer supports hybrid and multi-cloud, multi-cluster, multi-device container management, making it a versatile tool for managing complex container ecosystems.",
    "tags": [
      "Container Management",
      "Deployment",
      "Troubleshooting",
      "Lifecycle Management",
      "Platform Management",
      "Security & Compliance"
    ]
  },
  {
    "slug": "postfixadmin",
    "logo": "logo.png",
    "name": "PostfixAdmin",
    "description": "PostfixAdmin is a robust, web-based administration interface for managing mail servers using Postfix. It allows you to easily manage virtual domains, mailboxes, and aliases through an intuitive and flexible interface. PostfixAdmin supports advanced features like quota management, domain statistics, and DKIM integration, making it an ideal tool for administrators of self-hosted email solutions.",
    "tags": [
      "Email Administration",
      "Self-Hosted",
      "Mail Server",
      "Postfix"
    ]
  },
  {
    "slug": "postgres-backup",
    "logo": null,
    "name": "Postgres Backup",
    "description": "The postgres-backup-s3 app is a powerful tool designed to backup your PostgreSQL databases to Amazon S3. It supports periodic backups, allowing you to schedule automatic backups at your convenience. This ensures that your data is always safe and can be restored whenever needed. The app also offers the option to backup all available databases at once, creating a single archive with a timestamp for easy identification. For added security, the app provides an encryption feature. By setting an encryption password, your backup can be encrypted and only decrypted with the correct password. This app is perfect for those who want to ensure their PostgreSQL databases are securely backed up in a reliable and efficient manner.",
    "tags": [
      "Databases",
      "Backup"
    ]
  },
  {
    "slug": "powerdns-admin",
    "logo": "logo.png",
    "name": "PowerDNS-Admin",
    "description": "PowerDNS-Admin is a comprehensive web interface for PowerDNS with a plethora of advanced features. It offers forward and reverse zone management, zone templating, and user management with role-based access control. The app also provides zone-specific access control and activity logging. It supports various authentication methods including Local User, SAML, LDAP, and OAuth with Google, GitHub, Azure, and OpenID. It also supports two-factor authentication (TOTP). PowerDNS-Admin is equipped with PDNS Service Configuration & Statistics Monitoring and supports the DynDNS 2 protocol. It makes IPv6 PTR record editing easy and provides an API for zone and record management. The app also fully supports IDN/Punycode. PowerDNS-Admin can be run in several ways, with Docker being the quickest.",
    "tags": [
      "DNS Management",
      "Web Interface",
      "User Management",
      "API"
    ]
  },
  {
    "slug": "prestashop",
    "logo": "logo.png",
    "name": "Prestashop",
    "description": "Prestashop is an open-source e-commerce platform that empowers businesses to build and manage their online stores. It provides a user-friendly interface, a robust product catalog system, order management, and customizable themes, making it an ideal choice for merchants of all sizes. Prestashop supports multiple payment gateways, multilingual and multi-currency features, and SEO optimization to ensure a global reach and enhanced online visibility. Additionally, it offers a vibrant marketplace for modules and themes, enabling seamless customization and integration with third-party services.",
    "tags": [
      "E-commerce",
      "Web Development",
      "Online Store",
      "CMS"
    ]
  },
  {
    "slug": "promethus",
    "logo": "logo.png",
    "name": "Prometheus",
    "description": "Prometheus is an open-source monitoring and alerting toolkit designed for reliability and scalability. It collects metrics from configured targets at specified intervals, evaluates rule expressions, and triggers alerts when specified conditions are observed. Prometheus stores all data as time-series, making it ideal for monitoring application and system performance over time. Its powerful query language, PromQL, allows for real-time data analysis, and its flexible integrations support various exporters and service discovery mechanisms. Prometheus can also integrate with alerting tools like Alertmanager to send notifications via email, Slack, or other channels. With native support for Docker, Kubernetes, and other container platforms, Prometheus provides deep visibility into modern infrastructure and services.",
    "tags": [
      "Monitoring",
      "Time-Series",
      "Alerting",
      "PromQL",
      "Cloud-Native"
    ]
  },
  {
    "slug": "prowlarr",
    "logo": "logo.png",
    "name": "Prowlarr",
    "description": "Prowlarr is a powerful indexer manager and proxy designed to integrate with various PVR applications. It is built on the popular arr .net/reactjs base stack, offering a seamless experience for users. Prowlarr supports the management of both Torrent Trackers and Usenet Indexers, eliminating the need for per app Indexer setup. It works in harmony with LazyLibrarian, Lidarr, Mylar3, Radarr, Readarr, and Sonarr, providing comprehensive management of your indexers. The app includes features such as Usenet support for 24 indexers natively, Torrent support for over 500 trackers, support for custom YML definitions, Indexer Sync to various apps, manual searching of Trackers & Indexers, and much more. Prowlarr also provides Indexer health and status notifications and supports multiple releases pushing directly to your download clients.",
    "tags": [
      "Indexer Manager",
      "Proxy",
      "PVR Apps"
    ]
  },
  {
    "slug": "psitransfer",
    "logo": "logo.png",
    "name": "PsiTransfer",
    "description": "PsiTransfer is a simple, open-source, self-hosted file sharing solution designed to provide an alternative to paid services like Dropbox and WeTransfer. The app allows for the sharing of many and very large files with ease, thanks to its support for streams. It also offers resumable uploads and downloads, ensuring you never lose progress. With PsiTransfer, you can set an expiry time for your upload bucket, and even offer one-time downloads. The app also supports downloading all files as a zip or tar.gz archive, and provides a modal-style file preview. For added security, PsiTransfer offers a password-protected download list. The app is lightweight and mobile-friendly, making it easy to use on any device. It also allows for explicit named bucket IDs with a query param sid=<myBucketID>.",
    "tags": [
      "File Management"
    ]
  },
  {
    "slug": "pterodactyl-panel",
    "logo": "logo.svg",
    "name": "Pterodactyl Panel",
    "description": "Pterodactyl® is a free, open-source game server management panel that allows you to manage your game servers with ease and efficiency. It is built with PHP, React, and Go, and designed with a focus on security. Pterodactyl runs all game servers in isolated Docker containers, providing a secure environment for each game. It also offers a beautiful and intuitive user interface, making it easy for anyone to use. The platform supports a wide variety of games, including Minecraft, Rust, Terraria, Teamspeak, Mumble, Team Fortress 2, Counter Strike Global Offensive, Garry's Mod, ARK Survival Evolved, and many more. With Pterodactyl, you can host your games across the world without having to bloat each physical machine with additional dependencies. It's time to make game servers a first-class citizen on your platform with Pterodactyl.",
    "tags": [
      "Gaming",
      "Developer Tools"
    ]
  },
  {
    "slug": "pufferpanel",
    "logo": "logo.png",
    "name": "Pufferpanel",
    "description": "PufferPanel is a free, open-source game server management panel that simplifies the management of your game servers. It supports a wide variety of games including Minecraft, Forge, Spigot, Sponge, Source Dedicated Servers, BungeeCord, PocketMine, and many more. With PufferPanel, you can easily manage multiple game servers from one central location, providing a streamlined and efficient way to control your gaming environment. Whether you're an individual user or a large network, PufferPanel's user-friendly interface makes game server management a breeze.",
    "tags": [
      "Game Server Management",
      "Open Source",
      "Easy to Use"
    ]
  },
  {
    "slug": "qdrant",
    "logo": "logo.svg",
    "name": "Qdrant",
    "description": "Qdrant is a powerful vector database and vector similarity search engine designed to power the next generation of AI applications. It deploys as an API service, providing search for the nearest high-dimensional vectors. This allows embeddings or neural network encoders to be turned into full-fledged applications for matching, searching, recommending, and much more. Qdrant supports a large variety of data types and query conditions, including string matching, numerical ranges, geo-locations, and more. It is cloud-native and scales horizontally, ensuring efficient utilization of resources. With Qdrant, you can build and deploy semantic neural search on your data in minutes, understand user behavior in real time, and find similar images or detect duplicates with ease.",
    "tags": [
      "Data Science",
      "Databases",
      "Developer Tools"
    ]
  },
  {
    "slug": "rabbitmq",
    "logo": "logo.svg",
    "name": "RabbitMQ",
    "description": "RabbitMQ is a highly popular open source message broker used by businesses of all sizes, from startups to large enterprises. It is lightweight, easy to deploy, and supports multiple messaging protocols and streaming. RabbitMQ can be deployed in distributed and federated configurations, making it ideal for high-scale, high-availability requirements. It runs on various operating systems and cloud environments, and offers a wide range of developer tools for most popular languages. RabbitMQ supports asynchronous messaging, message queuing, delivery acknowledgement, and flexible routing to queues. It also offers a diverse array of tools and plugins for continuous integration, operational metrics, and integration with other enterprise systems. RabbitMQ is enterprise and cloud ready, with pluggable authentication, authorisation, and support for TLS and LDAP. It also provides an HTTP-API, command line tool, and UI for managing and monitoring the system.",
    "tags": [
      "Developer Tools",
      "Messaging"
    ]
  },
  {
    "slug": "radarr",
    "logo": "logo.png",
    "name": "Radarr",
    "description": "Radarr is a movie collection manager designed for Usenet and BitTorrent users. It monitors multiple RSS feeds for new movies and interfaces with clients and indexers to grab, sort, and rename them. Radarr also has the ability to automatically upgrade the quality of existing files in your library when a better quality format becomes available. The app features a calendar to see all your upcoming movies in one place, manual search to find all the releases and choose the one you want, and automatic handling of failed downloads. Radarr ensures you get the right release every time with its custom formats feature, which allows fine control over release prioritization and selection. It also supports major platforms like Windows, Linux, macOS, and others.",
    "tags": [
      "Media",
      "Download Manager"
    ]
  },
  {
    "slug": "radicale",
    "logo": "logo.png",
    "name": "Radicale",
    "description": "Radicale is a small but powerful CalDAV (calendars, to-do lists) and CardDAV (contacts) server. It allows you to share calendars and contact lists through CalDAV, CardDAV, and HTTP. Radicale supports events, todos, journal entries, and business cards. It works out-of-the-box, requiring no complicated setup or configuration. Radicale can limit access by authentication and secure connections with TLS. It works with many CalDAV and CardDAV clients, stores all data on the file system in a simple folder structure, and can be extended with plugins. Radicale is GPLv3-licensed free software.",
    "tags": [
      "Calendars",
      "Productivity",
      "Business Apps"
    ]
  },
  {
    "slug": "rallly",
    "logo": "logo.png",
    "name": "Rallly",
    "description": "Rallly is a free, open-source tool designed to simplify your scheduling process. It allows you to create meeting polls in seconds, helping you find a time that works for everyone. With Rallly, you can ditch the back-and-forth emails and streamline your scheduling tasks for a more organized and less stressful workday. The app supports multiple languages and has been used to create over 100k+ polls by 45k+ registered users. Whether you're an executive assistant at a large organization or simply trying to coordinate a group event, Rallly is the perfect tool to keep your RSVPs simple and your scheduling process efficient.",
    "tags": [
      "Calendars",
      "Productivity"
    ]
  },
  {
    "slug": "raneto",
    "logo": "logo.png",
    "name": "Raneto",
    "description": "Raneto is an open source Knowledgebase platform that uses static Markdown files to power your Knowledgebase.",
    "tags": []
  },
  {
    "slug": "readarr",
    "logo": "logo.png",
    "name": "Readarr",
    "description": "Readarr is an ebook and audiobook collection manager designed for Usenet and BitTorrent users. It monitors multiple RSS feeds for new ebooks and audiobooks and interfaces with clients and indexers to grab, sort, and rename them. Readarr also has the ability to automatically upgrade the quality of existing files in your library when a better quality format becomes available. The app features a calendar to see all your upcoming releases in one place, manual search to find all the releases and choose the ones you want, and automatic handling of failed downloads. Readarr ensures you get the right release every time with its custom formats feature, which allows fine control over release prioritization and selection. It also supports major platforms like Windows, Linux, macOS, and others.",
    "tags": [
      "Media",
      "Download Manager",
      "Books",
      "Ebooks",
      "Audiobooks"
    ]
  },
  {
    "slug": "redlib",
    "logo": "logo.png",
    "name": "Redlib",
    "description": "Redlib is a privacy-focused and lightweight alternative frontend for Reddit, designed to enhance user experience by removing ads, tracking, and unnecessary JavaScript. Built using Rust, Redlib delivers a fast and efficient browsing experience while ensuring user privacy by proxying all requests, including media, through its server. It provides an ad-free, clutter-free interface inspired by Reddit's modern design, making it an ideal choice for users seeking a secure and streamlined way to browse Reddit content.",
    "tags": [
      "Privacy",
      "Reddit",
      "Alternative Frontend",
      "Lightweight",
      "Open Source"
    ]
  },
  {
    "slug": "redmine",
    "logo": "logo.png",
    "name": "Redmine",
    "description": "Redmine is an open-source project management and issue-tracking tool. It provides a flexible framework for managing multiple projects and teams, offering features such as Gantt charts, calendar views, and time tracking to keep your projects organized. Redmine supports multiple databases and can be extended through plugins for additional functionality, making it a highly customizable solution for managing tasks, bugs, and collaboration among teams. The tool also includes role-based access control, allowing administrators to assign different permissions to users based on their responsibilities. Redmine integrates with version control systems like Git, Subversion, and Mercurial, enabling developers to track code changes directly from the platform. It supports major platforms including Windows, Linux, and macOS, and can be accessed via a web browser.",
    "tags": [
      "Project Management",
      "Issue Tracking",
      "Collaboration",
      "Time Tracking",
      "Open Source"
    ]
  },
  {
    "slug": "remmina",
    "logo": "logo.png",
    "name": "Remmina",
    "description": "Remmina is a remote desktop client designed to be useful for system administrators and travellers who need to work with multiple remote computers. It supports a variety of network protocols, including RDP, VNC, SPICE, NX, XDMCP, SSH and EXEC, all within an integrated and consistent user interface. The app is written in GTK and is designed to be functional on both large and tiny screens. It can be accessed via http://yourhost:3000/ or https://yourhost:3001/. The app is based on Docker Baseimage KasmVNC, which provides additional environment variables and run configurations to enable or disable specific functionality.",
    "tags": [
      "Remote Desktop",
      "System Administration",
      "Network Protocols"
    ]
  },
  {
    "slug": "restreamer",
    "logo": "logo.png",
    "name": "Restreamer",
    "description": "datarhei Restreamer is a powerful video streaming platform designed to provide real-time live video streaming on websites and social media platforms. It eliminates the need for additional streaming provider costs for video hosting or software licensing. The app allows teams to live stream and restream everything from webcams to broadcasting, making streaming more efficient and user-friendly. It offers live streaming on websites without additional service providers or video hosting providers, and it's instantly available, free of charge, and without advertising. Users can share live videos publicly or privately with anyone, or use a secret link to give their audience access to private content. The app also provides a simple streaming server with self-installation on your server or Raspberry Pi. The fully documented API makes datarhei Restreamer easy to adapt to any project.",
    "tags": [
      "Media",
      "Video Streaming",
      "Live Streaming"
    ]
  },
  {
    "slug": "rocketchat",
    "logo": "logo.svg",
    "name": "Rocket.Chat",
    "description": "Rocket.Chat SIX is a secure and scalable collaboration platform designed to enhance team productivity and customer service experiences. It allows you to own your data and offers extensive customization and integration options. The platform brings together messages, projects, and tasks into one place, enabling teams to work more efficiently. It also provides an omnichannel customer service experience, allowing businesses to engage in contextual interactions with customers, fostering long-term relationships and improved business outcomes. Additionally, Rocket.Chat SIX features a chat engine to drive higher user engagement within your app or website. The platform is built for teams that need more control, offering end-to-end encryption, compliance with various data protection regulations, and a wide range of deployment options to meet your security needs.",
    "tags": [
      "Chat",
      "Communication",
      "Collaboration"
    ]
  },
  {
    "slug": "rotki",
    "logo": "logo.png",
    "name": "Rotki",
    "description": "Rotki is a comprehensive asset management and accounting application, specifically designed for crypto assets. The app is designed to help with tax reporting by importing, displaying, storing, and generating reports and statistics from cryptocurrency transaction data and other assets. It integrates with multiple exchanges, providing a centralized platform for managing your crypto assets. Rotki also offers the ability to generate profit/loss reports, making it easier to understand your financial standing. It's important to note that while Rotki aids in tax reporting, it does not provide tax or legal advice, and it's the user's responsibility to ensure the accuracy of the data provided to the service. The app is not intended for continuous monitoring of transaction data or for automatic transmission of your transaction data to any tax authority.",
    "tags": [
      "Finance",
      "Analytics"
    ]
  },
  {
    "slug": "roundcube",
    "logo": "logo.svg",
    "name": "Roundcube",
    "description": "Roundcube webmail is a browser-based, multilingual IMAP client that offers an application-like user interface. It is designed to provide all the functionalities you would expect from an email client. This includes MIME support, an address book, folder manipulation, message searching, and spell checking. The app also supports drag-and-drop message management, multiple sender identities, and a full-featured address book with groups and LDAP connectors. It offers a threaded message listing, IDNA and SMTPUTF8 support, and a responsive skin for multi-device support. Roundcube webmail also features built-in caching for fast mailbox access, unlimited users and messages, import/export functions, and support for PGP encryption.",
    "tags": [
      "Email"
    ]
  },
  {
    "slug": "rsshub",
    "logo": "logo.png",
    "name": "RSSHub",
    "description": "RSSHub is an open-source, user-friendly, and extensible RSS feed generator. It is designed to create RSS feeds from virtually any content. With the ability to aggregate millions of contents from various sources, RSSHub ensures the delivery of new routes, features, and bug fixes. The app is compatible with the browser extension RSSHub Radar and mobile auxiliary apps RSSBud (iOS) and RSSAid (Android). It has adapted to hundreds of websites and thousands of content types, making it a versatile tool for generating RSS feeds.",
    "tags": [
      "RSS"
    ]
  },
  {
    "slug": "searxng",
    "logo": "logo.svg",
    "name": "SearXNG",
    "description": "SearXNG is a powerful, privacy-focused metasearch engine that aggregates results from over 70 search services, ensuring your searches remain private and untracked. It offers secure, encrypted connections and the option to use it over Tor for enhanced online anonymity. With about 130 integrated search engines and 60 translations, SearXNG provides a comprehensive and versatile search experience. The app also offers easy integration of search engines and maintains high standards of professional development, including continuous integration, quality assurance, and automated UI testing. SearXNG was launched in 2021 as a fork of the searx project, and it continues to evolve with user-friendly features and improvements.",
    "tags": [
      "Privacy",
      "Search"
    ]
  },
  {
    "slug": "serpbear",
    "logo": "logo.png",
    "name": "SerpBear",
    "description": "SerpBear is an open-source search engine position tracking app designed to help you monitor your website's keyword positions in Google. With SerpBear, you can add unlimited domains and keywords to track their Search Engine Results Page (SERP) positions. The app provides email notifications to keep you updated on your keyword position changes on a daily, weekly, or monthly basis. It also features a built-in SERP API for integration with your marketing and data reporting tools. SerpBear integrates with Google Search Console, allowing you to get actual visit counts, impressions, and more for each keyword. You can discover new keywords, identify the most performing ones, and find the most visited pages and countries. The app also allows you to export your domain keywords and their data in CSV files. For a better mobile experience, you can add the PWA app to your mobile. SerpBear is free to run on platforms like mogenius.com or Fly.io. The app uses third-party website scrapers like ScrapingAnt, ScrapingRobot, or your given Proxy IPs to scrape Google search results to see if your domain appears in the search result for the given keyword.",
    "tags": [
      "Analytics",
      "SEO"
    ]
  },
  {
    "slug": "servas",
    "logo": "logo.svg",
    "name": "Servas",
    "description": "Servas is a self-hosted bookmark management tool that allows you to organize and access your bookmarks in a more efficient and streamlined manner. With Servas, you can categorize your bookmarks using tags and groups, which can also be nested for better organization. The app also features a 'Later List' where you can add bookmarks that you wish to access at a later time. Servas also comes with a Chrome browser extension, allowing you to add sites to your bookmark list directly from your browser. The app supports multiple user accounts and boasts a responsive design that ensures it looks good on all your devices. For added security, Servas also offers Two Factor Authentication.",
    "tags": [
      "Bookmarks",
      "Productivity"
    ]
  },
  {
    "slug": "shaarli",
    "logo": "logo.png",
    "name": "Shaarli",
    "description": "Shaarli is a personal, minimalist, super-fast, and database-free bookmarking service. It allows you to manage and share the links you discover, making it an ideal tool for those who frequently come across interesting content on the web. With Shaarli, you can share, comment, and save links, use it as a minimal blog or writing platform, or even as a read-it-later/todo list. It also serves as a notepad for drafting and saving articles, posts, or ideas, and a knowledge base for keeping notes, documentation, and code snippets. You can edit, view, and search your links, organize them with tags, and even generate ATOM and RSS feeds. Shaarli is self-hosted, meaning you install it on your own server, ensuring your data remains yours. It's an excellent alternative to commercial services, and it's free and open-source.",
    "tags": [
      "Bookmarks",
      "Documentation"
    ]
  },
  {
    "slug": "shiori",
    "logo": "logo.png",
    "name": "Shiori",
    "description": "Shiori is a straightforward bookmarks manager, designed as a simple alternative to Pocket. It is written in the Go language and can be used as either a command line application or a web application. Shiori allows for basic bookmark management, including adding, editing, deleting, and searching bookmarks. It also supports importing and exporting bookmarks from and to Netscape Bookmark file and importing bookmarks from Pocket. The application features a clean command line interface and a user-friendly web interface. It is portable and supports sqlite3, PostgreSQL, and MySQL as its database. Shiori also creates an offline archive of the webpage where possible. The Shiori Web Extension is a simple extension for managing bookmarks using Shiori, intended to integrate Shiori with your favorite web browser, allowing you to save and remove bookmarks in Shiori without leaving your current page.",
    "tags": [
      "Bookmarks",
      "Productivity"
    ]
  },
  {
    "slug": "shynet",
    "logo": "logo.png",
    "name": "Shynet",
    "description": "Shynet is a powerful, open-source analytics tool designed to provide you with clear, comprehensive insights about your website's traffic and user behavior. Unlike traditional analytics platforms, Shynet respects user privacy and does not track individual users across websites. Instead, it focuses on providing aggregate data and trends, helping you understand how users interact with your website as a whole. Shynet offers a range of features including real-time analytics, session tracking, and primary key integration. It also supports single-page applications, ensuring you get accurate data even when users navigate between pages within your application. With Shynet, you can easily create and manage multiple services, each with its own unique tracking script. The app also offers an API, allowing you to access all the information displayed on the dashboard programmatically. Whether you're a small business owner, a web developer, or a data analyst, Shynet provides you with the tools you need to make informed decisions about your website.",
    "tags": [
      "Analytics"
    ]
  },
  {
    "slug": "silicon-notes",
    "logo": "logo.png",
    "name": "Silicon Notes",
    "description": "Silicon Notes is a lightweight, low-friction personal knowledge base designed to streamline your note-taking and information organization. The app allows you to edit your notes in plaintext using Markdown, with the added benefit of language syntax highlighting in the rendered HTML. It offers powerful full-text and page title search capabilities, making it easier than ever to find the information you need. The app also features bi-directional page relationships, allowing you to create a complex web of interconnected information. Silicon Notes also includes a table of contents in the left sidebar for easy navigation, and a mobile layout that makes it accessible on any device. The app's no-frills UI ensures a smooth and distraction-free user experience. Silicon Notes is built with a minimal tech stack, relying on a few smallish dependencies, making it a lightweight and efficient tool for your personal knowledge management.",
    "tags": [
      "Notes",
      "Documentation"
    ]
  },
  {
    "slug": "simpletorrent",
    "logo": "logo.png",
    "name": "SimpleTorrent",
    "description": "SimpleTorrent is a self-hosted remote torrent client that allows you to manage your torrents remotely. Written in Go (golang), it enables you to start torrents remotely and download sets of files on the local disk of the server. These files are then retrievable or streamable via HTTP. The app offers individual file download control, the ability to run an external program on task completion, and a seeding ratio to stop tasks when reached. It also provides a download/upload speed limiter and detailed transfer stats in the web UI. SimpleTorrent supports real-time updates, is mobile-friendly, and offers a fast content server. It also supports IPv6 out of the box and has an updated torrent engine from anacrolix/torrent. Additional features include a torrent watcher, K8s/docker health-check endpoint, extra trackers from an external source, and a protocol handler to magnet.",
    "tags": [
      "File Management",
      "Media",
      "Productivity"
    ]
  },
  {
    "slug": "soketi",
    "logo": "logo.png",
    "name": "Soketi",
    "description": "Soketi Serverless is an open-source WebSockets server that offers a cost-effective, fast, and resilient solution for real-time deployment to Cloudflare. It is designed to be cheaper than any competitor, as you only pay for your infrastructure. It guarantees core message delivery in less than 100ms, thanks to its construction on top of C and porting to Node.js. Soketi is compatible with Pusher Protocol v7, meaning you can connect to the server without needing to replace your existing code. It is ready for production and can scale to hundreds of servers with Redis or NATS without losing performance. Soketi also offers built-in app management, allowing you to define your own app credentials and read from any database. Additionally, it features HTTP Webhooks that trigger HTTP requests whenever a channel gets occupied. Soketi can be deployed to Cloudflare Workers, bringing it closer to your users worldwide. It is also compatible with most popular databases, like MySQL or DynamoDB.",
    "tags": [
      "Developer Tools",
      "Communication"
    ]
  },
  {
    "slug": "sonarqube",
    "logo": "logo.png",
    "name": "SonarQube Community",
    "description": "SonarQube Community is an open-source platform for continuous inspection of code quality, designed to detect bugs, vulnerabilities, and code smells across multiple programming languages. It integrates with various CI/CD pipelines, providing valuable insights into code health and maintainability. SonarQube helps teams ensure that their code meets quality standards and aligns with security requirements, promoting efficient software development practices. The Community version is feature-rich and free to use, making it an ideal choice for developers and organizations focused on improving code quality without incurring costs.",
    "tags": [
      "Developer Tools",
      "Code Quality",
      "Security",
      "Continuous Integration"
    ]
  },
  {
    "slug": "sonarr",
    "logo": "logo.png",
    "name": "Sonarr",
    "description": "Sonarr is a Personal Video Recorder (PVR) designed for Usenet and BitTorrent users. It monitors multiple RSS feeds for new episodes of your favorite shows and automatically grabs, sorts, and renames them. Sonarr can also be configured to automatically upgrade the quality of files already downloaded when a better quality format becomes available. It features a calendar to see all your upcoming episodes in one convenient location, and a manual search to find all the releases and choose the one you want. Sonarr also handles failed downloads, automatically blocking the release and trying another one until it finds one that works. It is fully integrated with SABnzbd, NZBGet, Kodi, and Plex, and supports major platforms including Windows, Linux, macOS, and Raspberry Pi.",
    "tags": [
      "Media",
      "Calendars",
      "Download"
    ]
  },
  {
    "slug": "sshwifty",
    "logo": "logo.svg",
    "name": "Sshwifty",
    "description": "Sshwifty is a web-based SSH and Telnet client that allows you to access these services directly from any standard web browser. It can be deployed on your computer or server, providing a convenient and accessible interface for SSH and Telnet connections. Sshwifty is designed to be highly configurable, allowing you to set up multiple servers, define presets for known remotes, and even restrict connections to preset remotes only. It also supports secure connections through TLS, and can be configured to connect through a Socks5 proxy. Whether you need to connect to a remote server or a local machine, Sshwifty provides a flexible and user-friendly solution.",
    "tags": [
      "Developer Tools",
      "SSH",
      "Telnet"
    ]
  },
  {
    "slug": "statping-ng",
    "logo": "logo.png",
    "name": "Statping-ng",
    "description": "Statping is a web and app status monitoring tool designed for any type of project. It automatically fetches your application and generates a beautiful, feature-rich status page. This status page generator supports MySQL, Postgres, or SQLite on multiple operating systems, ensuring future-proof and resilient monitoring. If your server crashes, your Statping service will remain online to notify your users of downtime. Lightweight and fast, Statping is available for Linux, Mac, and Windows, and even on a Raspberry Pi. The mobile app, available on the App Store and Google Play, allows you to view services, receive notifications when a service is offline, and manage groups, users, services, and messages. Statping can run on any server, from Docker to AWS EC2, and offers custom SASS styling for complete customization of your status page. It includes email notification via SMTP and Slack integration, and allows you to create your own plugins to interact with every element of your status page. With its easy-to-use dashboard, you can monitor your websites and applications with a basic HTTP GET request or a POST request with your own JSON.",
    "tags": [
      "Monitoring",
      "Status Page",
      "Notifications"
    ]
  },
  {
    "slug": "stirlingpdf",
    "logo": "logo.png",
    "name": "StirlingPDF",
    "description": "StirlingPDF is an open-source PDF management tool designed to streamline PDF handling tasks for both individual users and businesses. It enables users to create, merge, split, compress, and convert PDF documents with ease. Built to support a wide range of platforms, including Linux, Windows, and macOS, StirlingPDF ensures flexibility and resilience for everyday PDF management. Its user-friendly interface and powerful backend make it suitable for both simple and complex PDF workflows. StirlingPDF can run on personal computers or be deployed on servers, offering seamless API access for integration into larger systems. Lightweight and efficient, StirlingPDF is ideal for individual users, small businesses, and large enterprises alike, ensuring reliable PDF manipulation without the need for costly subscriptions. It supports MySQL, PostgreSQL, or SQLite databases, providing robust data handling across various infrastructures.",
    "tags": [
      "PDF",
      "Document Management",
      "Open Source",
      "API Integration",
      "PDF Conversion"
    ]
  },
  {
    "slug": "strapi",
    "logo": "logo.png",
    "name": "Strapi",
    "description": "Strapi is a leading open-source headless CMS that is fully customizable and built with 100% JavaScript. It allows you to manage any content, anywhere, providing you with the freedom to use your favorite tools and frameworks. With Strapi, you can build apps quickly, getting your backend done in minutes instead of weeks. You can easily build customizable content APIs and use them with a modern tech stack. Strapi also allows you to effortlessly create content structures that flex to your needs, write, edit, and manage any content types, and build apps and digital experiences without the distraction of CMS complexities. You can consume Strapi API from any client using REST or GraphQL, and deploy on Strapi Cloud or on any cloud platforms.",
    "tags": [
      "CMS"
    ]
  },
  {
    "slug": "streampanel",
    "logo": null,
    "name": "StreamPanel",
    "description": "StreamPanel simplifies app deployment and management, streamlining your workflow and boosting productivity.",
    "tags": [
      "Cloud Computing",
      "App Deployment"
    ]
  },
  {
    "slug": "substreamer",
    "logo": "logo.png",
    "name": "Substreamer",
    "description": "Substreamer is a free client app designed to provide you with a seamless and personalized music experience. It works in conjunction with the Subsonic music server, allowing you to organize and access your music library in a way that suits you best. Substreamer is compatible with Subsonic forks such as Airsonic, Madsonic, and others that implement the Subsonic API v1.13 or higher, including Navidrome and Ampache. This app is packed with features that enhance your music listening experience. With Substreamer, your music is always at your fingertips, just the way you like it.",
    "tags": [
      "Music",
      "Streaming",
      "Server"
    ]
  },
  {
    "slug": "suitecrm",
    "logo": "logo.png",
    "name": "SuiteCRM",
    "description": "SuiteCRM is the world's leading Open Source CRM, designed to help you sell, market, and service smarter. This feature-rich, enterprise-ready alternative to Salesforce offers all the benefits of CRM at a significantly lower cost, with the freedom and flexibility of Open Source. With SuiteCRM, you can gain a 360-degree view of your customers by creating a central repository for all your customer data, enabling you to gain key insights to enhance and nurture your business relationships. The platform is highly customizable and easy to use, with hundreds of extensions and integrations. SuiteCRM 8, our most advanced upgrade to date, promises to give you better control of your data and business solutions. The platform also allows for seamless integration with core business systems using our open REST API, enhancing productivity across your organization. With SuiteCRM, you can automate key actions, improve efficiency, understand your customers' needs, convert more leads, and engage your customers more effectively with personalized experiences and consistent messaging. It also empowers your customer service team to service smarter, faster, and more professionally.",
    "tags": [
      "CRM"
    ]
  },
  {
    "slug": "supabase",
    "logo": "logo.svg",
    "name": "Supabase",
    "description": "Supabase is an open source Firebase alternative. Supabase is built on top of Postgres, and it's easy to set up and use. Supabase is also completely free to use, and it's completely open source.",
    "tags": []
  },
  {
    "slug": "supertokens-core",
    "logo": "logo.svg",
    "name": "Supertokens Core",
    "description": "SuperTokens is an advanced user authentication solution designed to streamline your app's security. It offers a range of features including user roles, two-factor authentication (2FA), Single Sign-On (SSO) with platforms like AD and Okta, session management, user management, account linking, and machine authentication. The app is trusted by startups and enterprises alike for its ease of setup and use. With SuperTokens, you can host your login page on your own domain, eliminating the need for redirects. It also provides prebuilt UIs and frontend SDKs to help you build your own login page quickly. SuperTokens is also capable of handling multitenant SSO, allowing each customer to have their own user pool. Loved by the world's best teams, SuperTokens is your go-to solution for user authentication and session management.",
    "tags": [
      "Developer Tools",
      "Security"
    ]
  },
  {
    "slug": "syncthing",
    "logo": "logo.svg",
    "name": "Syncthing",
    "description": "Syncthing is a powerful, real-time file synchronization program designed to keep your data secure and under your control. It enables the synchronization of files between two or more computers, ensuring your data is always up-to-date across your devices. Syncthing prioritizes your privacy and security, with no data ever stored on a central server that could be compromised. All communication is encrypted and authenticated, with only devices you have explicitly allowed able to connect to your other devices. The app is easy to use, with a responsive and powerful interface accessible via your browser. It works across various operating systems including Mac OS X, Windows, Linux, FreeBSD, Solaris, OpenBSD, and many others. Syncthing doesn't require complex configuration or IP addresses, it simply works, over LAN and over the Internet. You can synchronize as many folders as you need with different people or just between your own devices.",
    "tags": [
      "File Management",
      "Security",
      "Privacy"
    ]
  },
  {
    "slug": "tandoor",
    "logo": "logo.svg",
    "name": "Tandoor",
    "description": "Tandoor is an online recipe management app designed to help you manage and grow your recipe collection. It allows you to drop your collection of links and notes, and provides a platform for recipe management, storage, sharing, and collaborative cooking. Tandoor is equipped with a powerful fuzzy search engine that helps you find your recipes faster. You can search for keywords, ingredients and more. The app also allows you to import your favorite recipes from thousands of websites online, and if you already have a digital recipe collection, you can import your data from many other managers. Tandoor also provides the functionality to create shopping lists for your recipes, making meal planning and shopping a breeze. It's the perfect tool for cooking enthusiasts looking to digitize and share their cookbooks and recipes.",
    "tags": [
      "Recipe Management",
      "Cooking",
      "Meal Planning"
    ]
  },
  {
    "slug": "tautulli",
    "logo": "logo.png",
    "name": "Tautuilli",
    "description": "Tautulli is a powerful web application designed to monitor, analyze, and notify you about your Plex Media Server's activities. It runs alongside your Plex Media Server, tracking a variety of statistics including what has been watched, who watched it, when and where it was watched, and how it was watched. The app presents all these statistics in a clean, user-friendly interface with tables and graphs. Tautulli also allows you to monitor current activity on your Plex Media Server, log watch history for all your users, view streaming trends with intuitive graphs, trigger notifications or scripts from events on your Plex server, and keep track of when content is added to your Plex library. You can also create and send newsletters for recently added media, view and delete all synced content from your server, see detailed information on all of your media, and even download the official app to view activity and stats on the go. Tautulli is compatible with any system that supports python.",
    "tags": [
      "Monitoring",
      "Media"
    ]
  },
  {
    "slug": "thelounge",
    "logo": "logo.png",
    "name": "The Lounge",
    "description": "Welcome to The Lounge, your self-hosted web IRC client for the 21st century. With modern features such as push notifications, link previews, and file uploads, The Lounge brings IRC into the modern era. Stay connected to IRC servers even when you're offline and resume where you left off on any device, thanks to its responsive interface that works smoothly on every desktop, smartphone, and tablet. The Lounge supports multiple user accounts, allowing you to share your server with friends. It's a free and open-source app, licensed under the MIT license, and works on any OS where Node.js runs. The Lounge offers two modes: private and public. In private mode, it acts like a bouncer and a client combined, offering an experience similar to other modern chat applications. In public mode, it acts as an open chat available to anyone without registration. Enjoy the convenience of a modern, responsive, cross-platform, self-hosted web IRC client with The Lounge.",
    "tags": [
      "Chat"
    ]
  },
  {
    "slug": "thumbor",
    "logo": "logo.png",
    "name": "Thumbor",
    "description": "Thumbor is an intelligent imaging service designed to streamline and enhance your image processing tasks. It offers on-demand cropping, resizing, and flipping of images, ensuring the most important parts of your pictures are always preserved. Leveraging advanced face and feature detection algorithms, Thumbor smartly identifies key points in an image for optimal cropping and resizing. It also supports a variety of image filters for post-processing, which can be applied in a sequence for desired effects. Filters include brightness, contrast, grayscale, red-eye, and blur, among others. Thumbor also supports the WebP format, a superior image format that compresses better than jpeg and png, improving your website's performance. With Thumbor, you can store and load images from any location, and it's easy to implement a new loader or storage. It's a complete solution for your imaging needs, from uploading images to rendering them with smart face-recognition cropping.",
    "tags": [
      "Image Processing",
      "Open Source",
      "Smart Imaging"
    ]
  },
  {
    "slug": "tianji",
    "logo": "logo.svg",
    "name": "Tianji",
    "description": "All-in-One Insight Hub. Insight into everything, Website Analytics + Uptime Monitor + Server Status. not only another GA alternatives",
    "tags": [
      "Website Monitor",
      "Analytics",
      "Server Monitor"
    ]
  },
  {
    "slug": "tolgee",
    "logo": "logo.svg",
    "name": "Tolgee",
    "description": "Tolgee is a revolutionary localization platform designed to simplify and speed up the translation process of your application. With Tolgee, you can translate your app into any language without modifying your code. It offers a range of features including in-context translating, translation memory, machine translations, auto translation, and activity log. The in-context translating feature allows you to translate strings directly in the app you develop, even in production. Translation memory ensures you don't translate the same string twice by reusing strings you've already translated. Machine translations let you leverage the power of DeepL, Google Translate, and AWS translate. Auto translation delivers your translations instantly right after you add them. The activity log feature helps you monitor the translation activities. Tolgee also allows users to add screenshots with a single click, providing context for translations. It is designed to be developer-friendly with easy integration with all major JS frameworks. Tolgee is not only easy to use for developers but also for translators, making the localization process seamless and efficient.",
    "tags": [
      "Developer Tools",
      "Localization",
      "Translation"
    ]
  },
  {
    "slug": "tooljet",
    "logo": "logo.svg",
    "name": "ToolJet",
    "description": "ToolJet is an open-source low-code framework designed to help you build and deploy custom internal tools with ease. It comes with a built-in database, ToolJet DB, built on top of PostgreSQL, and also allows you to connect to external data sources such as PostgreSQL, MongoDB, MS SQL Server, Snowflake, BigQuery, and more. You can also connect to API/GraphQL endpoints, SaaS tools like Airtable, Stripe, Google Sheets, and cloud object storage services like AWS S3, Google Cloud Storage, and Minio. Once connected, ToolJet can run queries on these data sources to fetch and update data. The fetched data can be visualized and modified using UI widgets like tables, charts, forms, etc. You can also use Javascript or Python queries for writing business logic or interacting with the user interface of the application. With ToolJet, you can build apps in three simple steps: connect to data sources, build queries, and build the user interface using the visual App Builder. ToolJet binds together the data sources, queries, and components to convert business logic into custom applications.",
    "tags": [
      "No-Code",
      "Database",
      "Custom Applications"
    ]
  },
  {
    "slug": "traggo",
    "logo": "logo.png",
    "name": "Traggo",
    "description": "Traggo is a powerful, self-hosted time tracking and project management tool designed to help teams and individuals organize their workflows and track time efficiently. It features an intuitive interface, flexible reporting, and customizable dashboards. With Traggo, you can maintain complete control over your data, ensuring privacy and productivity.",
    "tags": [
      "Time Tracking",
      "Self-Hosted",
      "Productivity",
      "Project Management"
    ]
  },
  {
    "slug": "transmission",
    "logo": "logo.png",
    "name": "Transmission",
    "description": "Transmission is designed for easy, powerful use. Transmission has the features you want from a BitTorrent client, encryption, a web interface, peer exchange, magnet links, DHT, µTP, UPnP and NAT-PMP port forwarding, webseed support, watch directories, tracker editing, global and per-torrent speed limits, and more.",
    "tags": [
      "Torrent",
      "BitTorrent Client"
    ]
  },
  {
    "slug": "trigger",
    "logo": null,
    "name": "Trigger",
    "description": "Trigger.dev is a free and open-source platform that simplifies building workflows and automations directly within your codebase. It provides a powerful way to connect your application to APIs, schedule tasks, and manage real-time and delayed workflows with ease. By integrating seamlessly into your development process, Trigger.dev allows developers to focus on delivering high-value features instead of managing complex infrastructure. Its scalability and ease of use make it a great fit for modern web applications and cloud-based systems.",
    "tags": [
      "Workflow Automation",
      "API Integration",
      "Real-Time",
      "Open Source",
      "Cloud-Based"
    ]
  },
  {
    "slug": "trilium",
    "logo": "logo.png",
    "name": "Trilium Notes",
    "description": "Trilium is a hierarchical note-taking application designed for creating and managing large personal knowledge bases. With Trilium, you can arrange your notes into an arbitrarily deep tree structure, with the ability to place a single note in multiple locations. The app offers rich WYSIWYG note editing, including tables, images, and math, with markdown autoformat. It also supports editing notes with source code, complete with syntax highlighting. Trilium provides seamless note versioning and attributes for note organization, querying, and advanced scripting. The app also includes a synchronization feature with a self-hosted sync server. For enhanced security, Trilium offers strong note encryption with per-note granularity. Other features include sketching diagrams with built-in Excalidraw, visualizing notes and their relations with relation maps and link maps, and a REST API for automation. Trilium is optimized for both usability and performance, capable of handling upwards of 100,000 notes.",
    "tags": [
      "Notes"
    ]
  },
  {
    "slug": "twenty",
    "logo": "logo.png",
    "name": "Twenty",
    "description": "Twenty is an open-source CRM platform designed to offer full customization and control over your customer relationship management. It provides the flexibility to self-host, avoiding vendor lock-in and offering cost-effective solutions.",
    "tags": []
  },
  {
    "slug": "typebot",
    "logo": "logo.svg",
    "name": "Typebot",
    "description": "Typebot is an innovative app designed to revolutionize the way you collect information. It allows you to build advanced chatbots visually, using powerful blocks to create unique chat experiences. You can embed these chatbots anywhere on your web or mobile apps and start collecting results instantly. Typebot is designed to replace your old school forms with chatbots, leading to an increase in customer satisfaction, retention, and a threefold increase in your conversion rate compared to traditional forms. With Typebot, you can easily drag and drop blocks to create your app, and even add custom code for your specific needs. It also offers native integration blocks and instructions on how to embed the chatbot on various platforms. One of the main advantages of Typebot is its real-time data collection feature, ensuring that you won't lose any valuable data. It also offers many more powerful features such as hidden fields, team collaboration, linking to sub chatbots, custom code, custom domains, and folder management. Typebot is loved by teams and creators from all around the world for its intelligent features and drag-and-drop simplicity.",
    "tags": [
      "Chat",
      "Forms",
      "Customer Support"
    ]
  },
  {
    "slug": "typesense",
    "logo": "logo.png",
    "name": "Typesense",
    "description": "Typesense is a powerful, fast, and typo-tolerant search engine designed to provide delightful search experiences. It is an open-source alternative to Algolia and a more user-friendly alternative to ElasticSearch. Typesense is capable of handling typographical errors gracefully, right out of the box. It is meticulously architected for low-latency, instant searches, offering a response time of less than 50ms. The app allows easy tailoring of search results, sorting of results based on a particular field at query time, and refining of results through faceting and filtering. It also supports grouping of similar results, federated search across multiple collections, geographic location-based search and sorting, and vector searching. Typesense also allows the generation of API keys for access to specific records, making it suitable for multi-tenant applications. It is designed to be simple to set up, integrate with, operate, and scale, making it a perfect choice for building delightful search experiences.",
    "tags": [
      "Documentation",
      "Developer Tools",
      "Data Science",
      "Search"
    ]
  },
  {
    "slug": "umami",
    "logo": "logo.png",
    "name": "Umami",
    "description": "Umami is a privacy-focused, open-source alternative to Google Analytics. It is designed to respect user privacy by not collecting any personal information, using cookies, or tracking users across websites. It is GDPR compliant and ensures that all data collected is anonymized, making it impossible to identify any individual user. Umami is simple and easy to use, collecting only the metrics you care about and presenting them on a single page. It is a reliable and transparent product with over 4 million downloads. With Umami, you can own your data and stay compliant with ever-changing data privacy laws.",
    "tags": [
      "Analytics",
      "Privacy"
    ]
  },
  {
    "slug": "unleash",
    "logo": "logo.png",
    "name": "Unleash",
    "description": "Unleash is an open-source feature management software designed to cater to the needs of large enterprises. It provides a private, secure, and scalable platform that is ready to handle complex setups right out of the box. Unleash allows you to code freely, release confidently, and then scale your software. It offers a 'buy, then build' solution that is flexible, multilingual, and scales along with your business processes. This results in reduced costs, efficient hours, and less technical debt. Unleash also allows for progressive, targeted feature rollouts, enabling you to release features to selected users the moment you're ready. It supports change requests and approvals, and provides resilience during service outages. With Unleash, you can easily customize the software to your specific use cases, build multiple environments on separate instances, and keep your user data safe through privacy by design, data residency, and flexible hosting options.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "uptimekuma",
    "logo": "logo.svg",
    "name": "UptimeKuma",
    "description": "Uptime Kuma is a self-hosted monitoring tool designed to keep track of your website's uptime. It provides a comprehensive monitoring solution for HTTP(s), TCP, HTTP(s) Keyword, HTTP(s) Json Query, Ping, DNS Record, Push, Steam Game Server, and Docker Containers. The tool features a user-friendly, reactive, and fast UI/UX. It offers notifications via various platforms including Telegram, Discord, Gotify, Slack, Pushover, and Email (SMTP), among others. Uptime Kuma supports multi-language interfaces and multiple status pages, allowing users to map status pages to specific domains. It also provides ping charts, certificate info, proxy support, and 2FA support for enhanced security. This tool is perfect for those who want to ensure their website is always up and running.",
    "tags": [
      "Monitoring",
      "Self-hosted",
      "Uptime"
    ]
  },
  {
    "slug": "vaultwarden",
    "logo": "logo.png",
    "name": "Vaultwarden",
    "description": "Vaultwarden is an unofficial Bitwarden server implementation designed for self-hosted deployments. It is written in Rust and is compatible with the official Bitwarden clients. This application is ideal for individuals, families, and smaller organizations who find the official resource-heavy service undesirable. Vaultwarden supports a wide range of features including personal and organization vault support, password sharing and access control, file attachments, two-step login via email, Duo, YubiKey, and FIDO2 WebAuthn, and many more. It also supports live sync for desktop/browser clients/extensions and mobile clients (Android/iOS). However, it does not prioritize the development of features mainly useful to larger organizations such as single sign-on and directory syncing.",
    "tags": [
      "Password Manager",
      "Security",
      "Self-hosted"
    ]
  },
  {
    "slug": "verdaccio",
    "logo": "logo.png",
    "name": "Verdaccio",
    "description": "Verdaccio is a lightweight, private npm proxy registry built in Node.js, designed to simplify and enhance your development workflow. It provides a simple, zero-configuration-required local private NPM registry, eliminating the need for a full database to get started. Verdaccio comes equipped with its own compact database and the capability to proxy other registries, such as npmjs.org, while caching the downloaded modules for improved efficiency. It allows you to use all the benefits of the npm package system in your company without exposing all your code to the public. You can link multiple registries, fetch packages from multiple sources in a single project, and even publish locally modified versions of third-party packages. Verdaccio is compatible with popular npm clients like npm, yarn, and pnpm, and supports various plugins for extended storage capabilities.",
    "tags": [
      "Developer Tools",
      "Package Manager"
    ]
  },
  {
    "slug": "vscode-server",
    "logo": "logo.png",
    "name": "Visual Studio Code Server",
    "description": "The LinuxServer.io team presents the docker-code-server, a powerful tool that allows you to run VS Code on a remote server, accessible through your browser. This means you can code on your Chromebook, tablet, and laptop with a consistent development environment. If you're using a Windows or Mac workstation, you can more easily develop for Linux. The app also allows you to leverage large cloud servers to speed up tests, compilations, downloads, and more. It helps preserve battery life when you're on the go, as all intensive computation runs on your server, eliminating the need for running excess instances of Chrome.",
    "tags": [
      "Developer Tools",
      "Code Hosting"
    ]
  },
  {
    "slug": "wakatime",
    "logo": "logo.png",
    "name": "Wakapi",
    "description": "Wakapi is a powerful open-source tool designed to help you track and analyze your coding time. It allows you to monitor the time you've spent coding on various projects, in different programming languages, and more. It's perfect for those who love statistics and want to gain insights into their coding habits. Wakapi provides fancy statistics and plots, public leaderboards, cool badges for readmes, and weekly email reports. It's built by developers for developers, ensuring it meets your needs perfectly. With Wakapi, you can easily keep track of your coding time and improve your productivity.",
    "tags": [
      "Developer Tools",
      "Analytics"
    ]
  },
  {
    "slug": "wbo",
    "logo": "logo.png",
    "name": "WBO",
    "description": "WBO (Whiteboard Online) is an open-source, self-hosted, collaborative whiteboard tool that allows users to draw, brainstorm, and share ideas in real-time. It provides a flexible and accessible platform for teams, classrooms, or personal use, enabling simultaneous collaboration on a shared digital canvas. WBO offers tools for free-hand drawing, adding shapes, text, and images, making it ideal for team brainstorming sessions, remote meetings, and educational activities. With a clean and intuitive interface, WBO enhances remote collaboration and facilitates interactive learning.",
    "tags": [
      "Collaboration",
      "Whiteboard",
      "Self-hosted",
      "Open-source"
    ]
  },
  {
    "slug": "weaviate",
    "logo": "logo.svg",
    "name": "Weaviate",
    "description": "Weaviate is an open-source vector database that allows you to store and retrieve data objects based on their semantic properties by indexing them with vectors. It can be used stand-alone or with a variety of modules that can do the vectorization for you and extend the core capabilities. Weaviate provides a lightning-fast pure vector similarity search over raw vectors or data objects, even with filters. It combines keyword-based search with vector search techniques for state-of-the-art results. You can also use any generative model in combination with your data, for example to do Q&A over your dataset. Weaviate's next-gen vector database can power a wide range of innovative apps.",
    "tags": [
      "Developer Tools",
      "Data Science",
      "Databases"
    ]
  },
  {
    "slug": "webcord",
    "logo": "logo.png",
    "name": "Webcord",
    "description": "WebCord is an application designed to enhance your Discord experience. It is a pack of security and privacy hardenings, Discord features reimplementations, Electron / Chromium / Discord bugs workarounds, stylesheets, internal pages and wrapped https://discord.com page. It is designed to conform with ToS as much as it is possible. The application can be accessed at: http://yourhost:3000/ or https://yourhost:3001/. This container is based on Docker Baseimage KasmVNC which means there are additional environment variables and run configurations to enable or disable specific functionality.",
    "tags": [
      "Chat",
      "Privacy"
    ]
  },
  {
    "slug": "weblate",
    "logo": "logo.png",
    "name": "Weblate",
    "description": "Weblate is a powerful, web-based continuous localization system. It is designed to simplify the process of translating text from one language to another, making it an invaluable tool for projects and companies operating in multiple countries. With Weblate, users can easily translate using the platform, download and upload translations, and even integrate with version control systems for seamless workflow. The app supports a wide range of file formats, and it also provides a REST API and Python API for further flexibility. Weblate also offers features like automatic suggestions, translation memory, and various checks and fixups to ensure high-quality translations. Whether you're starting with internationalization or managing an established translators community, Weblate has the features to support your translation needs.",
    "tags": [
      "Localization",
      "Translation",
      "Web-based"
    ]
  },
  {
    "slug": "webtop",
    "logo": "logo.png",
    "name": "WebTop",
    "description": "WebTop is a browser-based Linux desktop environment, self-hosted using Docker. It provides a full-featured desktop experience accessible from any device with a modern web browser. WebTop supports multiple desktop environments and applications, making it a versatile tool for productivity, remote work, and development.",
    "tags": [
      "Browser-Based",
      "Self-Hosted",
      "Productivity",
      "Remote Desktop"
    ]
  },
  {
    "slug": "wekan",
    "logo": "logo.svg",
    "name": "Wekan",
    "description": "WeKan is an open-source, customizable, and privacy-focused Kanban app designed for efficient task management. It allows you to create multiple boards for different projects or tasks, with each board having columns to represent different stages of your work such as 'To Do', 'Doing', and 'Done'. You can add cards to each board to represent tasks, complete with titles, descriptions, and due dates. WeKan uses lists on a Kanban board to represent different stages of a workflow, helping you organize and track tasks. You can customize lists by changing their color or adding custom fields to capture more information about tasks. A card in WeKan represents a task on a Kanban board, including a title, description, due date, labels, and comments. As work progresses, you can move the card from one column to another. WeKan also offers several features to protect your data, including a self-hosting option, access controls, and open-source code for security auditing. It is designed with security in mind, and its features and options are built to help you protect your data and keep it secure.",
    "tags": [
      "Project Management",
      "Open-Source",
      "Task Management",
      "Kanban"
    ]
  },
  {
    "slug": "wg-easy",
    "logo": "logo.png",
    "name": "Wg-easy",
    "description": "WireGuard Easy is an all-in-one application designed to simplify the installation and management of WireGuard on any Linux host. With a user-friendly web interface, it allows you to list, create, edit, delete, enable, and disable clients with ease. You can also view a client's QR code and download a client's configuration file directly from the app. The app provides statistics on which clients are connected and features Tx/Rx charts for each connected client. It also supports Gravatar. WireGuard Easy requires a host with a kernel that supports WireGuard and Docker installed.",
    "tags": [
      "VPN",
      "Network Tools",
      "Security"
    ]
  },
  {
    "slug": "whisparr",
    "logo": "logo.png",
    "name": "Whisparr",
    "description": "Whisparr is an adult video collection manager designed for Usenet and BitTorrent users. It monitors multiple RSS feeds for new adult content and interfaces with clients and indexers to grab, sort, and rename them. Whisparr also features automatic upgrades of existing files in your library to better quality formats when available. It includes a calendar to track upcoming releases, manual search for precise selection, and automatic handling of failed downloads. Whisparr ensures optimal release selection with its custom formats feature, offering detailed control over prioritization. It supports major platforms like Windows, Linux, macOS, and others.",
    "tags": [
      "Adult Media",
      "Download Manager"
    ]
  },
  {
    "slug": "whiteboard",
    "logo": "logo.png",
    "name": "Whiteboard",
    "description": "Whiteboard is a lightweight, NodeJS-based collaborative sketchboard that can be easily customized to your needs. It allows multiple users to draw and write together in real-time, with each user's cursor visible to others. The app provides a range of features including the ability to undo and redo actions, drag and drop or copy and paste images or PDFs, resize, move, rotate and draw images, write text and sticky notes, and save the whiteboard to an image or JSON. You can also draw angle lines and squares by pressing 'Shift' while drawing. The app is compatible with PC, tablet, and mobile devices, and can be used in various projects such as WebRTC conference tools and online collaboration learning activities.",
    "tags": [
      "Productivity",
      "Collaboration",
      "Whiteboard"
    ]
  },
  {
    "slug": "whoogle",
    "logo": "logo.png",
    "name": "Whoogle",
    "description": "Whoogle is an open-source, privacy-focused search engine that serves as a proxy for Google Search. It allows users to access Google’s powerful search capabilities without being tracked, monitored, or bombarded with ads. Whoogle removes trackers, logs, and ads, ensuring that search queries and browsing activities remain private and anonymous. Users benefit from Google's accurate and comprehensive search results, while maintaining full control over their personal data. Its lightweight design makes it easy to deploy and use, often preferred by those seeking to balance search efficiency with enhanced privacy.",
    "tags": [
      "Search",
      "Privacy",
      "Open-Source"
    ]
  },
  {
    "slug": "wikijs",
    "logo": "logo.svg",
    "name": "Wiki.js",
    "description": "Wiki.js is a powerful and extensible open source Wiki software designed to make documentation a joy to write. It features a beautiful and intuitive interface that can be fully customized to your liking, including a light and dark mode. The software is compatible with various platforms and databases, including PostgreSQL, MySQL, MariaDB, MS SQL Server, and SQLite. With Wiki.js, you can manage all aspects of your wiki using the extensive and intuitive admin area. The software is built with performance in mind, running on the blazing fast Node.js engine. It is designed to intelligently make use of available resources, making it scalable whether it's on a tiny Raspberry Pi or on a high performance VM in the cloud. Wiki.js also allows you to control the privacy of your wiki, making it public, completely private, or a mix of both. It offers a wide range of modules that can be turned on/off on demand, catering to the unique needs of different teams. These modules include authentication, editors, history, localization, media assets, rendering, search, storage, user management, and themes. Wiki.js is proudly licensed under AGPLv3 and has been downloaded over 50 million times.",
    "tags": [
      "Wiki",
      "Documentation"
    ]
  },
  {
    "slug": "windmill",
    "logo": "logo.svg",
    "name": "Windmill",
    "description": "Windmill Cloud is a powerful tool that transforms scripts into workflows and user interfaces in just a few minutes. It is designed to help you create internal apps and robust workflows using code only where necessary. With Windmill Cloud, you can make your scripts production-grade and build all your internal tools using Python, Typescript, Go, Bash, Sql. You can compose your scripts as workflows using low-code and share an autogenerated UI or build one using low-code. The app is designed to run reliably at scale on your infrastructure or ours, with permissioning and monitoring included. It is a fully open-source alternative to Airplane, Superblocks & Retool, and it's easy to deploy on both small and large infrastructures. With Windmill Cloud, you can run long-running heavy background jobs, script with complex dependencies, endpoints with high rpm or simple one-off tasks without any overhead. You can trigger them from a webhook or the auto-generated UI and monitor them easily. Additionally, Windmill Cloud allows you to build complex flows without complexity, from atomic scripts, either from your workspace or the Hub. You can also build super fast and powerful apps using drag and drop components, connect your data and deploy your app in minutes. Windmill Cloud is designed to be super performant, ensuring your app is always running smoothly, even when running complex apps.",
    "tags": [
      "Developer Tools"
    ]
  },
  {
    "slug": "wizarr",
    "logo": "logo.png",
    "name": "Wizarr",
    "description": "Wizarr is an automatic user invitation system designed to streamline the process of inviting users to your media server. Whether you're using Plex, Jellyfin, or Emby, Wizarr allows you to create a unique link to share with users, automatically inviting them to your server. The app also guides users on how to download the necessary client and provides instructions on how to use your request software. Wizarr offers a secure invitation environment, plug and play SSO support, multi-tiered invitations, and customizable duration for membership. It also integrates with Discord, allowing you to invite users to your Discord server. The app is customizable, allowing you to add any custom HTML as needed.",
    "tags": [
      "Media",
      "Documentation"
    ]
  },
  {
    "slug": "wordpress",
    "logo": "logo.svg",
    "name": "Wordpress",
    "description": "WordPress is an open-source platform that empowers you to create a unique online space for your business, interests, or any other purpose. It offers a real-time, intuitive editing experience, allowing you to see exactly how your site will look as you add, edit, and rearrange your content. With flexible design tools and powerful features, you can create any kind of custom site. You can start with a blank canvas or choose from a wide variety of themes and patterns, customizing every detail from color and fonts to layouts and functionality. WordPress also offers over 55,000 plugins to extend your site's capabilities, whether you need to add a store, mailing list, portfolio, social feed, analytics, or anything else. Your content, design, and data always belong to you, and WordPress is committed to keeping your site as stable and secure as possible. Whether you're a global creative agency, a local business, or a personal blogger, WordPress offers endless possibilities for your online presence.",
    "tags": [
      "CMS",
      "Website Builder",
      "Blogging"
    ]
  },
  {
    "slug": "wps-office",
    "logo": "logo.png",
    "name": "WPS Office",
    "description": "WPS Office is a comprehensive office suite that is lightweight yet feature-rich. It offers high compatibility and a range of professional office software tools. With WPS Office, you can edit files in Writer, Presentation, Spreadsheet, and PDF, enhancing your work efficiency. The application can be accessed at your host on ports 3000 and 3001. This container is based on Docker Baseimage KasmVNC, which provides additional environment variables and run configurations to enable or disable specific functionality. The application also supports the docker manifest for multi-platform awareness, ensuring the correct image for your architecture is retrieved.",
    "tags": [
      "Productivity",
      "Documents",
      "Office Suite"
    ]
  },
  {
    "slug": "xbackbone",
    "logo": "logo.png",
    "name": "xBackbone",
    "description": "xBackbone is a versatile, self-hosted file and image sharing platform designed to manage and share content securely and efficiently. It features a clean and intuitive interface, supports multiple authentication options, and provides advanced file management capabilities. With xBackbone, you can maintain complete control over your shared content, ensuring privacy and flexibility.",
    "tags": [
      "File Sharing",
      "Self-Hosted",
      "Privacy",
      "Analytics"
    ]
  },
  {
    "slug": "yao",
    "logo": "logo.png",
    "name": "YAO",
    "description": "YAO is a powerful open-source app engine designed to create web services and applications in a matter of minutes. It is versatile and suitable for a variety of use-cases including AI, IoT, Industrial Internet, Connected Vehicles, DevOps, Energy, and Finance. With YAO, you can create a database model, write an interface, and describe the interface using JSON, making it a truly codeless programming experience. It supports running on ARM devices and can be used in IoT, edge computing, and industrial internet. YAO also offers easy-to-use Business Intelligence components and functions, empowering businesses with more possibilities. It has many built-in processes and supports data processing in any form through data flow. The app also features a plug-in mechanism based on GRPC for function expansion using Nodejs, Python, and other languages. YAO also provides a built-in query engine and offers enterprise-level security with permission classification, separation of administrator and employee accounts, and API level permission control.",
    "tags": [
      "No-Code",
      "Developer Tools",
      "Business Apps",
      "IoT",
      "Data Science",
      "ERP",
      "CRM"
    ]
  },
  {
    "slug": "yourls",
    "logo": "logo.png",
    "name": "YOURLS",
    "description": "YOURLS (Your Own URL Shortener) is a powerful, self-hosted service designed for creating and managing short URLs. It provides a clean and simple interface, supports plugins for extended functionality, and offers detailed link tracking analytics. With YOURLS, you can maintain control over your short links and branding. The application is accessible via your host on ports 8080 and 8081. This container is based on Docker Baseimage KasmVNC, providing additional environment variables and configurations for enhanced flexibility. It also supports the docker manifest for multi-platform awareness, ensuring the correct image for your architecture.",
    "tags": [
      "URL Shortener",
      "Self-Hosted",
      "Analytics"
    ]
  },
  {
    "slug": "zipline",
    "logo": "logo.png",
    "name": "Zipline",
    "description": "Zipline is the next generation ShareX/File upload server, designed to make file sharing and management a breeze. With a user-friendly dashboard packed with features, Zipline allows you to upload any file type, view your files in a gallery, and even shorten URLs for easy sharing. The app also provides a way to organize your files with folders for easy access and management. Zipline also offers features like image compression, video thumbnail generation, and password protection for your uploads. With Zipline, you can quickly set up your own instance and configure it to your needs. It also offers an extensive API for a more fine-grained control over your instance. Zipline is not just a file upload server, it's a comprehensive tool for managing and sharing your files with ease and efficiency.",
    "tags": [
      "File Management",
      "Dashboard",
      "URL Shortening",
      "Image Compression",
      "API"
    ]
  },
  {
    "slug": "znc",
    "logo": "logo.png",
    "name": "ZNC",
    "description": "ZNC is an IRC bouncer that is designed to stay connected to IRC servers and channels, allowing you to access them at any time.",
    "tags": [
      "Chat"
    ]
  }
]